let questions = [{
        "type": "single",
        "theme": "Открытые системы",
        "task": "Выберите правильный ответ",
        "question": "Системы, взаимодействующие через стандартные интерфейсы называются …",
        "vars": [
            "+: открытыми",
            "-: облачными",
            "-: объектно-ориентированными",
            "-: сетевыми"
        ]
    },
    {
        "type": "single",
        "theme": "Свойства ОИС 1",
        "task": "Выберите правильный ответ",
        "question": "Взаимосвязанные структурные элементы образуют систему только тогда, когда отношения между ними определяют качество целостности, называемое …",
        "vars": [
            "+: системным или эмерджентностью или интегративным",
            "-: упорядоченным",
            "-: последовательным",
            "-: комплексным"
        ]
    },
    {
        "type": "single",
        "theme": "Определение элемента ОИС",
        "task": "Выберите правильный ответ",
        "question": "Объект, обладающий существенными свойствами и реализующий определенную функцию системы называется …",
        "vars": [
            "+: элементом",
            "-: компонентом",
            "-: сегментом",
            "-: звеном"
        ]
    },
    {
        "type": "single",
        "theme": "",
        "task": "",
        "question": "Некоторый объект, обладающий существенными свойствами и реализующий определенную функцию системы называется …",
        "vars": [
            "+: элементом",
            "-: компонентом",
            "-: объектом",
            "-: звеном"
        ]
    },
    {
        "type": "single",
        "theme": "Определение системы 1",
        "task": "Выберите правильный ответ",
        "question": "Совокупность взаимосвязанных элементов, объединенных единством цели и функциональной целостностью называется …",
        "vars": [
            "+: системой",
            "-: схемой",
            "-: порядком",
            "-: дефинитивом"
        ]
    },
    {
        "type": "single",
        "theme": "Определение среды 1",
        "task": "Выберите правильный ответ",
        "question": "Множество элементов вне данной системы называется …",
        "vars": [
            "+: средой",
            "-: окружением",
            "-: биомом",
            "-: фоном"
        ]
    },
    {
        "type": "single",
        "theme": "Определение ближней среды 1",
        "task": "Выберите правильный ответ",
        "question": "Подмножество объектов, оказывающих существенное влияние на систему и (или) испытывающих ее существенное воздействие, называется … средой.",
        "vars": [
            "+: ближней",
            "-: дальней",
            "-: контактной",
            "-: прилегающей"
        ]
    },
    {
        "type": "single",
        "theme": "Определение открытой системы 1",
        "task": "Выберите правильный ответ",
        "question": "Система, реализующая открытые спецификации на интерфейсы, сервисы и поддерживаемые форматы данных, достаточные для того, чтобы обеспечить должным образом разработанным приложениям возможность переноса с минимальными изменениями на широкий диапазон систем, совместной работы с другими приложениями на локальной и удаленных системах и взаимодействия с пользователями в стиле, облегчающем тем переход от системы к системе, называется …",
        "vars": [
            "+: открытой",
            "-: закрытой",
            "-: доступной",
            "-: совместимой"
        ]
    },
    {
        "type": "single",
        "theme": "Определение открытой спецификации 1",
        "task": "Выберите правильный ответ",
        "question": "Общедоступная спецификация, которая поддерживается открытым, гласным согласительным процессом, направленным на постоянную адаптацию новой технологии, и соответствует стандартам, называется … спецификацией.",
        "vars": [
            "+: открытой",
            "-: направленной",
            "-: технологической",
            "-: стандартной"
        ]
    },
    {
        "type": "single",
        "theme": "Взаимодействие компонентов в ОИС 1",
        "task": "Выберите правильный ответ",
        "question": "Открытая система – это система, которая состоит из компонентов, взаимодействующих друг с другом через …",
        "vars": [
            "+: стандартные интерфейсы",
            "-: шину",
            "-: сетевой шлюз",
            "-: концентратор"
        ]
    },
    {
        "type": "many",
        "theme": "Свойства ОИС",
        "task": "Выберите правильные ответы",
        "question": "Неотъемлемыми свойствами открытых систем являются…",
        "vars": [
            "+: совместимость",
            "+: переносимость",
            "+: расширяемость",
            "-: протоколирование",
            "-: аудит"
        ]
    },
    {
        "type": "many",
        "theme": "",
        "task": "",
        "question": "Неотъемлемыми свойствами открытых систем являются…",
        "vars": [
            "+: интероперабельность",
            "+: мобильность",
            "+: масштабируемость",
            "-: протоколирование",
            "-: аудит"
        ]
    },
    {
        "type": "compliance",
        "theme": "Свойства ОИС. Соответствие терминов 1",
        "task": "Поставьте соответствие терминов определениям",
        "question": "",
        "vars": [
            "L1: расширяемость",
            "L2: переносимость",
            "L3: совместимость",
            "L4: дружественность",
            "L5:",
            "R1: Возможность постепенного развития функций систем, замены отдельных компонентов без существенной перестройки всей системы",
            "R2: Освобождение от зависимости от одного поставщика аппаратных или программных средств, возможность выбора продуктов из предложенных на рынке при условии соблюдения поставщиком соответствующих стандартов открытых систем",
            "R3: Способность к взаимодействию с другими системами",
            "R4: Удобство взаимодействия человека с системой",
            "R5: Возможность использования готовых информационных ресурсов и программных продуктов"
        ]
    },
    {
        "type": "many",
        "theme": "Ограничения адаптации 1",
        "task": "Выберите правильные ответы",
        "question": "Ограничением, не позволяющим стандартам мгновенно адаптироваться к усложнениям технологии и приложений, является …",
        "vars": [
            "+: неполнота стандартов",
            "+: предел предвидения технологического роста",
            "-: недостаточность разделения труда",
            "-: недостаточность инструментальных сред",
            "-: недостаточное развитие сред программирования"
        ]
    },
    {
        "type": "compliance",
        "theme": "Соответствия терминов 1",
        "task": "Поставьте соответствие терминов определениям",
        "question": "",
        "vars": [
            "L1: Система",
            "L2: Элемент системы",
            "L3: Ближняя среда системы",
            "L4: Среда системы",
            "L5:",
            "R1: Совокупность взаимосвязанных элементов, объединенных единством цели и функциональной целостностью",
            "R2: Некоторый объект, обладающий существенными свойствами и реализующий определенную функцию системы",
            "R3: Подмножество объектов, оказывающих существенное влияние на систему и (или) испытывающих ее существенное воздействие",
            "R4: Множество элементов вне данной системы",
            "R5: Совокупность взаимосвязанных элементов, расположенных компактно"
        ]
    },
    {
        "type": "compliance",
        "theme": "Свойства ОИС. Соответствие терминов 1",
        "task": "Поставьте соответствие терминов определениям",
        "question": "",
        "vars": [
            "L1: Масштабируемость",
            "L2: Мобильность",
            "L3: Интероперабельность",
            "L4: Дружественность",
            "L5:",
            "R1: Возможность постепенного развития функций систем, замены отдельных компонентов без существенной перестройки всей системы",
            "R2: Освобождение от зависимости от одного поставщика аппаратных или программных средств, возможность выбора продуктов из предложенных на рынке при условии соблюдения поставщиком соответствующих стандартов открытых систем",
            "R3: Способность к взаимодействию с другими системами",
            "R4: Удобство взаимодействия человека с системой",
            "R5: Возможность использования готовых информационных ресурсов и программных продуктов"
        ]
    },
    {
        "type": "many",
        "theme": "Принципы ОС",
        "task": "Выберите правильные ответы",
        "question": "Принципами создания ОС являются:",
        "vars": [
            "+: создание среды, которая в своей основе имеет развивающиеся, доступные и общепризнанные стандарты и обеспечивает переносимость, взаимодействие и масштабируемость приложений, пользователей и данных.",
            "+: использование методов функциональной стандартизации – построение и использование профиля – согласованного набора базовых стандартов, необходимых для решения конкретной задачи или класса задач.",
            "-: надёжная регламентация прав доступа пользователей к ресурсам системы."
        ]
    },
    {
        "type": "many",
        "theme": "Св-ва ОИС",
        "task": "Выберите правильные ответы",
        "question": "Неотъемлемыми свойствами открытых систем являются…",
        "vars": [
            "+: интероперабельность",
            "+: мобильность",
            "+: гибкость",
            "-: инкапсуляция",
            "-: полиморфизм"
        ]
    },
    {
        "type": "many",
        "theme": "Безопасность открытых систем",
        "task": "Выберите правильные варианты ответов",
        "question": "По современным взглядам на информационную безопасность открытых систем, должны обеспечиваться … данных.",
        "vars": [
            "+: конфиденциальность",
            "+: целостность",
            "+: доступность",
            "-: аутентичность",
            "-: достоверность"
        ]
    },
    {
        "type": "many",
        "theme": "Свойства ОИС 4",
        "task": "выберите все синонимы правильного ответа",
        "question": "Взаимосвязанные структурные элементы образуют систему только тогда, когда отношения между ними определяют качество целостности, называемое …",
        "vars": [
            "+: системным",
            "+: эмерджентностью",
            "+: агрегативным",
            "-: полиморфным",
            "-: аутентичным",
            "-: гомогенным"
        ]
    },
    {
        "type": "enter",
        "theme": "Определение открытой системы",
        "task": "Впишите завершение определения строчными буквами",
        "question": "Системы, взаимодействующие через стандартные интерфейсы называются ###",
        "vars": [
            "+: открытыми",
            "+: *ткрыт$#"
        ]
    },
    {
        "type": "enter",
        "theme": "Свойства ОИС 4",
        "task": "Впишите завершение определения строчными буквами",
        "question": "Взаимосвязанные структурные элементы образуют систему только тогда, когда отношения между ними определяют качество целостности, называемое ###",
        "vars": [
            "+: системным",
            "+: эмерджентностью",
            "+: агрегативным",
            "+: **стемн#$#",
            "+: *м*рджентн#$#",
            "+: *нтегр*г*тивн#$#"
        ]
    },
    {
        "type": "enter",
        "theme": "Определение системы 2",
        "task": "Впишите завершение определения строчными буквами",
        "question": "Совокупность взаимосвязанных элементов, объединенных единством цели и функциональной целостностью называется ###",
        "vars": [
            "+: системой",
            "+: с*стем#$#"
        ]
    },
    {
        "type": "enter",
        "theme": "Определение элемента ОИС 2",
        "task": "Впишите завершение определения строчными буквами",
        "question": "Некоторый объект, обладающий существенными свойствами и реализующий определенную функцию системы называется ###",
        "vars": [
            "+: элементом",
            "+: *л*мент#$#"
        ]
    },
    {
        "type": "enter",
        "theme": "Определение среды 2",
        "task": "Впишите завершение определения строчными буквами",
        "question": "Множество элементов вне данной системы называется ###",
        "vars": [
            "+: средой",
            "+: *ред#$#"
        ]
    },
    {
        "type": "enter",
        "theme": "Определение ближней среды 2",
        "task": "Впишите пропущенное слово строчными буквами",
        "question": "Подмножество объектов, оказывающих существенное влияние на систему и (или) испытывающих ее существенное воздействие, называется ### средой.",
        "vars": [
            "+: ближней",
            "+: *лижн#$#"
        ]
    },
    {
        "type": "enter",
        "theme": "Определение открытой системы 2",
        "task": "Впишите пропущенное слово строчными буквами",
        "question": "Система, реализующая открытые спецификации на интерфейсы, сервисы и поддерживаемые форматы данных, достаточные для того, чтобы обеспечить должным образом разработанным приложениям возможность переноса с минимальными изменениями на широкий диапазон систем, совместной работы с другими приложениями на локальной и удаленных системах и взаимодействия с пользователями в стиле, облегчающем тем переход от системы к системе, называется ###.",
        "vars": [
            "+: открытой",
            "+: *ткрыт#$#"
        ]
    },
    {
        "type": "enter",
        "theme": "",
        "task": "Впишите завершение определения строчными буквами",
        "question": "Общедоступная спецификация, которая поддерживается открытым, гласным согласительным процессом, направленным на постоянную адаптацию новой технологии, и соответствует стандартам, называется ### спецификацией.",
        "vars": [
            "+: открытой",
            "+: *ткрыт#$#"
        ]
    },
    {
        "type": "compliance",
        "theme": "Стандарты  ИТ. Соотв.",
        "task": "Поставьте соответствие стандартизирующих организаций их уровню",
        "question": "",
        "vars": [
            "L1: IEEE, IEC, OSI",
            "L2: ЕАСС, EWOS, ETSI",
            "L3: NIST, DIN, JISC",
            "L4:",
            "R1: Международный",
            "R2: Региональный",
            "R3: Национальный",
            "R4: Отраслевой"
        ]
    },
    {
        "type": "enter",
        "theme": "Свойства открытых систем",
        "task": "Впишите завершение определения строчными буквами",
        "question": "Способность системы к взаимодействию с другими системами, называется ###",
        "vars": [
            "+: интероперабельность",
            "+: совместимость",
            "+: *нт*р*п*раб#$#",
            "+: **вм*стим#$#"
        ]
    },
    {
        "type": "enter",
        "theme": "Свойства открытых систем",
        "task": "Впишите завершение определения строчными буквами",
        "question": "Освобождение от зависимости от одного поставщика аппаратных или программных средств, возможность выбора продуктов, называется ###",
        "vars": [
            "+: мобильностью",
            "+: переносимостью",
            "+: **бильн*с#$#",
            "+: **р*н*сим#$#"
        ]
    },
    {
        "type": "enter",
        "theme": "Свойства открытой системы 1",
        "task": "Впишите пропущенное слово строчными буквами",
        "question": "Свойство открытой системы, заключающееся в возможности сравнительно легкого добавления отдельных элементов (пользователей, компьютеров, приложений, служб), наращивания длины сегментов сети и замены существующей аппаратуры более мощной - это ###.",
        "vars": [
            "+: расширяемость",
            "+: масштабируемость",
            "+: гибкость",
            "+: р**ш*ря*м*ст#$#",
            "+: м*сшт*биру*м*ст#$#",
            "+: ги*к*ст#$#"
        ]
    },
    {
        "type": "enter",
        "theme": "Свойства открытых систем",
        "task": "Впишите завершение определения строчными буквами",
        "question": "Удобство взаимодействия человека с системой, называется ###",
        "vars": [
            "+: дружественностью",
            "+: прозрачностью",
            "+: *руж*ств*н#$#",
            "+: *р*зрачн#$#"
        ]
    },
    {
        "type": "enter",
        "theme": "роблема интеграции разнородных ресурсов",
        "task": "Впишите пропущенное слово строчными буквами",
        "question": "Разнородность применяемых технических и программных средств, операционных сред, протоколов и форматов обмена данными, языковые различия приводят к возникновению ### среды.",
        "vars": [
            "+: гетерогенной",
            "+: г*т*р*г*н#$#"
        ]
    },
    {
        "type": "single",
        "theme": "Принципы объектно-ориентированного подхода 4",
        "task": "Выберите правильный ответ",
        "question": "Принцип объектно-ориентированного подхода, позволяющий при создании новых объектов использовать свойства уже существующих объектов, описывая заново только те свойства, которые отличаются, называется …",
        "vars": [
            "+: наследованием",
            "-: динамическим связыванием",
            "-: поздним связыванием",
            "-: инкапсуляцией"
        ]
    },
    {
        "type": "single",
        "theme": "Масштабируемость (закр.)",
        "task": "Выберите правильный ответ",
        "question": "Возможность сравнительно легкого добавления отдельных элементов сети (пользователей, компьютеров, приложений, служб), наращивания длины сегментов сети и замены существующей аппаратуры более мощной - это … открытой системы.",
        "vars": [
            "+: масштабируемость",
            "-: мобильность",
            "-: интероперабельность",
            "-: дружественность"
        ]
    },
    {
        "type": "single",
        "theme": "Свойства открытой системы 7",
        "task": "Выберите правильный вариант ответа",
        "question": "Наличие универсального, комбинированного доступа к инструментам и приложениям, используемым в процессе эффективной работы, независимо от того, где находится пользователь и к какому оборудованию он имеете доступ в определённый момент времени – это … открытой системы.",
        "vars": [
            "+: мобильность",
            "-: расширяемость",
            "-: интероперабельность",
            "-: дружественность"
        ]
    },
    {
        "type": "single",
        "theme": "Интеропераб.(закр.)",
        "task": "Выберите правильный вариант ответа",
        "question": "Способность открытой системы взаимодействовать и функционировать с другими продуктами или системами без каких-либо ограничений доступа и реализации – это …",
        "vars": [
            "+: интероперабельность",
            "-: дружественность",
            "-: мобильность",
            "-: переносимость"
        ]
    },
    {
        "type": "single",
        "theme": "Инкапсуляция (закр.)",
        "task": "Выберите правильный ответ",
        "question": "Принцип объектно-ориентированного подхода, состоящий в том, что данные и процедуры объекта скрываются от внешнего пользователя, и связь с объектом ограничивается набором сообщений, которые \"понимает\" объект, называется …",
        "vars": [
            "+: инкапсуляцией",
            "-: абстрактностью типов данных",
            "-: наследованием",
            "-: полиморфизмом"
        ]
    },
    {
        "type": "single",
        "theme": "Динамич. связ.",
        "task": "Выберите правильный ответ",
        "question": "Принцип объектно-ориентированного подхода, состоящий в том, что значение имени (область памяти для данных или текст программы для процедур) становится известным только во время выполнения программы, называется …",
        "vars": [
            "+: динамическим связыванием",
            "-: полиморфизмом",
            "-: абстрактностью типов данных",
            "-: наследованием"
        ]
    },
    {
        "type": "single",
        "theme": "ОИС ориентированы",
        "task": "Выберите правильный ответ",
        "question": "Открытые информационные системы ориентированы на …",
        "vars": [
            "+: пользователя, не обладающего высокой квалификацией",
            "-: подготовленного пользователя",
            "-: специалиста в области СУБД",
            "-: руководителя предприятия"
        ]
    },
    {
        "type": "single",
        "theme": "База данных",
        "task": "Выберите правильный ответ",
        "question": "Неотъемлемой частью любой информационной системы является …",
        "vars": [
            "+: база данных",
            "-: программа, созданная в среде разработки Delphi",
            "-: возможность передавать информацию через Интернет",
            "-: программа, созданная с помощью языка высокого уровня"
        ]
    },
    {
        "type": "single",
        "theme": "Реляционные СУБД",
        "task": "Выберите правильный ответ",
        "question": "Наиболее широко распространенными в настоящее время системами управления базами данных являются…",
        "vars": [
            "+: реляционные",
            "-: иерархические",
            "-: сетевые",
            "-: объектно-ориентированные"
        ]
    },
    {
        "type": "single",
        "theme": "Постреляционные СУБД",
        "task": "Выберите правильный ответ",
        "question": "Более современными являются системы управления базами данных …",
        "vars": [
            "+: постреляционные",
            "-: иерархические",
            "-: реляционные",
            "-: объектно-ориентированные"
        ]
    },
    {
        "type": "single",
        "theme": "Архитектура клиент-сервер",
        "task": "Выберите правильный ответ",
        "question": "Традиционным методом организации информационных систем является архитектура…",
        "vars": [
            "+: клиент-сервер",
            "-: «кольцо»",
            "-: «звезда»",
            "-: клиент-клиент"
        ]
    },
    {
        "type": "single",
        "theme": "Первый шаг проектирования ИС",
        "task": "Выберите правильный ответ",
        "question": "Первым шагом в проектировании информационной системы является …",
        "vars": [
            "+: формальное описание предметной области",
            "-: построение полных и непротиворечивых моделей ИС",
            "-: выбор языка программирования",
            "-: разработка интерфейса ИС"
        ]
    },
    {
        "type": "single",
        "theme": "UML",
        "task": "Выберите правильный ответ",
        "question": "Модели информационных систем описываются, как правило, с использованием языка …",
        "vars": [
            "+: UML",
            "-: Delphi",
            "-: С++"
        ]
    },
    {
        "type": "single",
        "theme": "ИС по масштабу",
        "task": "Выберите правильный ответ",
        "question": "По масштабу информационные системы подразделяются на …",
        "vars": [
            "+: одиночные, групповые, корпоративные",
            "-: малые, большие",
            "-: простые, сложные",
            "-: реляционные, объектно-ориентированные"
        ]
    },
    {
        "type": "single",
        "theme": "Транзакция",
        "task": "Выберите правильный ответ",
        "question": "Транзакция - это …",
        "vars": [
            "+: совокупность операций",
            "-: передача данных",
            "-: обработка данных",
            "-: преобразование данных"
        ]
    },
    {
        "type": "single",
        "theme": "Фаза подготовки техн. предложений",
        "task": "Выберите правильный ответ",
        "question": "Составление сметы и бюджета проекта, определение потребности в ресурсах, разработка календарных планов и графиков работ относятся к фазе …",
        "vars": [
            "+: подготовки технического предложения",
            "-: концептуальной",
            "-: проектирования",
            "-: разработки"
        ]
    },
    {
        "type": "single",
        "theme": "Концептаульная фаза",
        "task": "Выберите правильный ответ",
        "question": "Сбор исходных данных и анализ существующего состояния, сравнительная оценка альтернатив относятся к фазе …",
        "vars": [
            "+: концептуальной",
            "-: подготовки технического предложения",
            "-: проектирования",
            "-: разработки"
        ]
    },
    {
        "type": "single",
        "theme": "IEC - это",
        "task": "Выберите правильный ответ",
        "question": "Жизненный цикл информационной системы регламентирует стандарт ISO/IEC 12207. IEC - это …",
        "vars": [
            "+: международная комиссия по электротехнике",
            "-: международная организация по стандартизации",
            "-: международная организация по информационным системам",
            "-: международная организация по программному обеспечению"
        ]
    },
    {
        "type": "single",
        "theme": "Структура жизненного цикла ИС",
        "task": "Выберите правильный ответ",
        "question": "По стандарту ISO/IEC 12207 структура жизненного цикла информационной системы состоит из основных и вспомогательных процессов …",
        "vars": [
            "+: жизненного цикла и организационных",
            "-: разработки и внедрения",
            "-: программирования и отладки",
            "-: создания и использования информационной системы"
        ]
    },
    {
        "type": "single",
        "theme": "Определение профиля (закр)",
        "task": "Выберите правильный ответ",
        "question": "Совокупность нескольких базовых стандартов с чётко определёнными подмножествами обязательных и факультативных возможностей, предназначенная для реализации заданной функции или группы функций называется …",
        "vars": [
            "+: профилем",
            "-: срезом",
            "-: группой стандартов",
            "-: системой требований"
        ]
    },
    {
        "type": "single",
        "theme": "Определение системы",
        "task": "Выберите правильный ответ",
        "question": "Согласно ISO/IEC 12207, объединение нескольких процессов, аппаратных средств, программного обеспечения, оборудования и людей для удовлетворения определённых потребностей или достижения целей это …",
        "vars": [
            "+: система",
            "-: информационная система",
            "-: полнофункциональный программно-аппаратный комплекс",
            "-: вычислительный центр"
        ]
    },
    {
        "type": "single",
        "theme": "Колич. процессов жизненного цикла ПО",
        "task": "Выберите правильный ответ",
        "question": "В стандарте ISO/IEC 12207 описано … основных процессов жизненного цикла программного обеспечения.",
        "vars": [
            "+: пять",
            "-: четыре",
            "-: три",
            "-: шесть"
        ]
    },
    {
        "type": "single",
        "theme": "Ориентация ISO/IEC 12207",
        "task": "Выберите правильный ответ",
        "question": "Стандарт ISO/IEC 12207 ориентирован на организацию действий…",
        "vars": [
            "+: разработчика и пользователя",
            "-: программистов",
            "-: разработчика",
            "-: руководителя проекта"
        ]
    },
    {
        "type": "single",
        "theme": "Архитектура информационной системы 26",
        "task": "Выберите правильный ответ",
        "question": "Стандарт ISO/IEC 12207 – базовый стандарт процессов жизненного цикла …",
        "vars": [
            "+: программного обеспечения",
            "-: информационных систем",
            "-: баз данных",
            "-: компьютерных систем"
        ]
    },
    {
        "type": "single",
        "theme": "Архитектура информационной системы 28",
        "task": "Выберите правильный ответ",
        "question": "Согласно стандарту ISO/IEC 12207 основным процессом жизненного цикла программного обеспечения является …",
        "vars": [
            "+: приобретение",
            "-: решение проблем",
            "-: обеспечение качества",
            "-: компьютерных систем"
        ]
    },
    {
        "type": "single",
        "theme": "Определение инкапсуляции (закр)",
        "task": "Выберите правильный ответ",
        "question": "Свойство объектно-ориентированных систем, состоящее в том, что данные и процедуры объекта скрываются от внешнего пользователя, называется …",
        "vars": [
            "+: инкапсуляцией",
            "-: полиморфизмом",
            "-: наследованием",
            "-: динамическим связыванием"
        ]
    },
    {
        "type": "single",
        "theme": "Определение полиморфизма (закр)",
        "task": "Выберите правильный ответ",
        "question": "Свойство объектно-ориентированных систем, состоящее в том, что одинаковые сообщения по-разному понимаются объектами разных классов, называется …",
        "vars": [
            "+: полиморфизмом",
            "-: инкапсуляцией",
            "-: наследованием",
            "-: абстракцией"
        ]
    },
    {
        "type": "single",
        "theme": "Определение наследования (закр)",
        "task": "Выберите правильный ответ",
        "question": "Использование свойств уже существующих объектов при описании новых объектов называется …",
        "vars": [
            "+: наследованием",
            "-: инкапсуляцией",
            "-: полиморфизмом",
            "-: абстракцией"
        ]
    },
    {
        "type": "single",
        "theme": "Определение динамического связывания (закр)",
        "task": "Выберите правильный ответ",
        "question": "Свойство объектно-ориентированных систем, состоящее в том, что значение имени (область памяти для данных или текст программы для процедур) становится известным только во время выполнения программы, называется …",
        "vars": [
            "+: динамическим связыванием",
            "-: абстрактностью типов данных",
            "-: полиморфизмом",
            "-: наследованием"
        ]
    },
    {
        "type": "single",
        "theme": "Определение абстрактности типов данных (закр)",
        "task": "Выберите правильный ответ",
        "question": "Свойство объединения данных и операций для описания новых типов, позволяющее использовать новые типы наравне с уже существующими, называется …",
        "vars": [
            "+: абстрактностью типов данных",
            "-: динамическим связывание",
            "-: инкапсуляцией",
            "-: полиморфизмом"
        ]
    },
    {
        "type": "single",
        "theme": "Архитектура информационной системы 28",
        "task": "Выберите правильный ответ",
        "question": "Согласно стандарту ISO/IEC 12207 основным процессом жизненного цикла программного обеспечения является …",
        "vars": [
            "+: приобретение",
            "-: решение проблем",
            "-: обеспечение качества",
            "-: компьютерных систем"
        ]
    },
    {
        "type": "single",
        "theme": "CASE-средства",
        "task": "Выберите правильный ответ",
        "question": "Для повышения эффективности разработки программного обеспечения применяются …",
        "vars": [
            "+: CASE-средства",
            "-: Delphi",
            "-: C++",
            "-: Pascal"
        ]
    },
    {
        "type": "single",
        "theme": "Microsoft.Net",
        "task": "Выберите правильный ответ",
        "question": "Microsoft.Net является …",
        "vars": [
            "+: платформой",
            "-: языком программирования",
            "-: системой управления базами данных",
            "-: прикладной программой"
        ]
    },
    {
        "type": "compliance",
        "theme": "рхитектура ОИС. Соответствие терминов",
        "task": "Поставьте соответствие терминов определениям",
        "question": "",
        "vars": [
            "L1: Полиморфизм",
            "L2: Инкапсуляция",
            "L3: Наследование",
            "L4:",
            "R1: Многозначность сообщений",
            "R2: Сокрытие реализации объектом внутри себя",
            "R3: Использование свойств уже существующих объектов при описании новых",
            "R4: Совместимость программ для разных платформ"
        ]
    },
    {
        "type": "compliance",
        "theme": "рхитектура ОИС. Соответствие терминов",
        "task": "Поставьте соответствие терминов определениям",
        "question": "",
        "vars": [
            "L1: Инкапсуляция",
            "L2: Динамическое связывание",
            "L3: Абстрактность типов данных",
            "L4:",
            "R1: Сокрытие объектом своей реализации внутри себя",
            "R2: Свойство, состоящее в том, что область памяти для данных становится известной только во время выполнения программы",
            "R3: Объединение данных и операций для описания новых типов",
            "R4: Совместимость программ для разных платформ"
        ]
    },
    {
        "type": "many",
        "theme": "Полиморфизм (закр.)",
        "task": "Выберите правильные ответ",
        "question": "Принцип объектно-ориентированного подхода, состоящий в том, что одинаковые сообщения по-разному понимаются разными объектами, в зависимости от их класса, называется …",
        "vars": [
            "+: многозначностью сообщений",
            "+: полиморфизмом",
            "-: абстрактностью типов данных",
            "-: наследованием"
        ]
    },
    {
        "type": "many",
        "theme": "CASE-средства1",
        "task": "Выберите правильные ответы",
        "question": "Под CASE-средствами понимают …",
        "vars": [
            "+: программные средства, поддерживающие процессы создания и сопровождения программного обеспечения",
            "+: среды разработки программного обеспечения",
            "-: прикладные программы",
            "-: языки программирования высокого уровня"
        ]
    },
    {
        "type": "many",
        "theme": "Расшир. (откр.)",
        "task": "Выберите правильные ответ",
        "question": "Возможность сравнительно легкого добавления отдельных элементов сети (пользователей, компьютеров, приложений, служб), наращивания длины сегментов сети и замены существующей аппаратуры более мощной - это … открытой системы.",
        "vars": [
            "+: гибкость",
            "+: расширяемость",
            "+: масштабируемость",
            "-: интероперабельность",
            "-: мобильность"
        ]
    },
    {
        "type": "compliance",
        "theme": "Соответствие терминов ООС1",
        "task": "Поставьте соответствие терминов определениям",
        "question": "",
        "vars": [
            "L1: Наследование",
            "L2: Полиморфизм",
            "L3: Инкапсуляция",
            "L4:",
            "R1: Использование свойств уже существующих объектов при описании новых объектов",
            "R2: Многозначность сообщений",
            "R3: Скрытие реализации",
            "R4: Совместимость программ для разных платформ"
        ]
    },
    {
        "type": "compliance",
        "theme": "Соответствие терминов ООС5",
        "task": "Поставьте соответствие терминов определениям",
        "question": "",
        "vars": [
            "L1: Инкапсуляция",
            "L2: Динамическое связывание",
            "L3: Абстрактность типов данных",
            "L4:",
            "R1: Скрытие данных и процедур объекта от внешнего пользователя",
            "R2: Свойство объектно-ориентированной системы, состоящее в том, что область памяти для данных или текст программы для процедур становится известными только во время выполнения программы",
            "R3: Объединение данных и операций для описания новых типов, позволяющее использовать новые типы наравне с уже существующими",
            "R4: Совместимость программ для разных платформ"
        ]
    },
    {
        "type": "compliance",
        "theme": "рхитектура ОИС (соотв)",
        "task": "Поставьте соответствие терминов определениям",
        "question": "",
        "vars": [
            "L1: Инкапсуляция",
            "L2: Динамическое связывание",
            "L3: Абстрактность типов данных",
            "L4:",
            "R1: Скрытие данных и процедур объекта от внешнего пользователя",
            "R2: Свойство объектно-ориентированной системы, состоящее в том, что область памяти для данных или текст программы для процедур становится известными только во время выполнения программы",
            "R3: Объединение данных и операций для описания новых типов, позволяющее использовать новые типы наравне с уже существующими",
            "R4: Совместимость программ для разных платформ"
        ]
    },
    {
        "type": "enter",
        "theme": "Принципы объектно-ориентированного подхода 1",
        "task": "Впишите пропущенное слово строчными буквами",
        "question": "Принцип объектно-ориентированного подхода, состоящий в том, что значение имени (область памяти для данных или текст программы для процедур) становится известным только во время выполнения программы, называется ### связыванием.",
        "vars": [
            "+: поздним",
            "+: динамическим",
            "+: *оздн#$#",
            "+: *озн#$#",
            "+: **н*мич*ск#$#"
        ]
    },
    {
        "type": "enter",
        "theme": "Принципы объектно-ориентированного подхода 3",
        "task": "Впишите пропущенное слово строчными буквами",
        "question": "Принцип объектно-ориентированного подхода, состоящий в объединении данных и операций для описания новых типов, позволяющих использовать новые типы наравне с уже существующими, называется ### типов данных.",
        "vars": [
            "+: абстрактностью",
            "+: **страктн*ст#$#"
        ]
    },
    {
        "type": "enter",
        "theme": "Наследование (откр.)",
        "task": "Впишите завершение определения строчными буквами",
        "question": "Принцип объектно-ориентированного подхода, позволяющий при создании новых объектов использовать свойства уже существующих объектов, описывая заново только те свойства, которые отличаются, называется ###",
        "vars": [
            "+: наследованием",
            "+: **след*в#$#"
        ]
    },
    {
        "type": "enter",
        "theme": "Мобилн. (откр.)",
        "task": "Впишите пропущенное слово строчными буквами",
        "question": "Наличие универсального, комбинированного доступа к инструментам и приложениям, используемым в процессе эффективной работы, независимо от того, где находится пользователь и к какому оборудованию он имеете доступ в определённый момент времени – это ### открытой системы.",
        "vars": [
            "+: мобильность",
            "+: переносимость",
            "+: м*бильн*ст#$#",
            "+: п*р*н*сим*ст#$#"
        ]
    },
    {
        "type": "enter",
        "theme": "Интеропераб. (откр.)",
        "task": "Впишите пропущенное слово строчными буквами",
        "question": "Способность открытой системы взаимодействовать и функционировать с другими продуктами или системами без каких-либо ограничений доступа и реализации – это ###.",
        "vars": [
            "+: интероперабельность",
            "+: совместимость",
            "+: *нтер*п*раб#$#",
            "+: **вместим#$#"
        ]
    },
    {
        "type": "enter",
        "theme": "Инкапсуляция (откр.)",
        "task": "Впишите завершение определения строчными буквами",
        "question": "Принцип объектно-ориентированного подхода, состоящий в том, что данные и процедуры объекта скрываются от внешнего пользователя, и связь с объектом ограничивается набором сообщений, которые \"понимает\" объект, называется ###",
        "vars": [
            "+: инкапсуляцией",
            "+: *нк*пс*ляц#$#"
        ]
    },
    {
        "type": "enter",
        "theme": "Полиморфизм (откр.)",
        "task": "Впишите завершение определения строчными буквами",
        "question": "Принцип объектно-ориентированного подхода, состоящий в том, что одинаковые сообщения по-разному понимаются разными объектами, в зависимости от их класса, называется ###",
        "vars": [
            "+: полиморфизмом",
            "+: многозначностью",
            "+: п*л*м*рфизм#$#",
            "+: мн*г*значн*ст#$#"
        ]
    },
    {
        "type": "enter",
        "theme": "Определение профиля (откр)",
        "task": "Впишите завершение определения строчными буквами",
        "question": "Совокупность нескольких базовых стандартов с чётко определёнными подмножествами обязательных и факультативных возможностей, предназначенная для реализации заданной функции или группы функций называется ###",
        "vars": [
            "+: профилем",
            "+: проф*л#$#"
        ]
    },
    {
        "type": "enter",
        "theme": "Определение инкапсуляции (откр)",
        "task": "Впишите завершение определения строчными буквами",
        "question": "Свойство объектно-ориентированных систем, состоящее в том, что данные и процедуры объекта скрываются от внешнего пользователя, называется ###",
        "vars": [
            "+: инкапсуляцией",
            "+: инк*псуляц#$#"
        ]
    },
    {
        "type": "enter",
        "theme": "Определение полиморфизма (откр)",
        "task": "Впишите завершение определения строчными буквами",
        "question": "Свойство объектно-ориентированных систем, состоящее в том, что одинаковые сообщения по-разному понимаются объектами разных классов, называется ###",
        "vars": [
            "+: полиморфизмом",
            "+: п*л*м*рфизм#$#"
        ]
    },
    {
        "type": "enter",
        "theme": "Определение наследования (откр)",
        "task": "Впишите завершение определения строчными буквами",
        "question": "Использование свойств уже существующих объектов при описании новых объектов называется ###",
        "vars": [
            "+: наследованием",
            "+: н*след*ван#$#"
        ]
    },
    {
        "type": "enter",
        "theme": "Определение динамического связывания (откр)",
        "task": "Впишите пропущенное слово строчными буквами",
        "question": "Свойство объектно-ориентированных систем, состоящее в том, что значение имени (область памяти для данных или текст программы для процедур) становится известным только во время выполнения программы, называется ### связыванием.",
        "vars": [
            "+: динамическим",
            "+: поздним",
            "+: д*н*мич*ск#$#",
            "+: *оздн#$#"
        ]
    },
    {
        "type": "enter",
        "theme": "Определение абстрактности типов данных (откр)",
        "task": "Завершите определение",
        "question": "Свойство объединения данных и операций для описания новых типов, позволяющее использовать новые типы наравне с уже существующими, называется ### типов данных",
        "vars": [
            "+: абстрактностью",
            "+: *бстрактн*ст#$#"
        ]
    },
    {
        "type": "single",
        "theme": "История открытых информационных систем в России 7",
        "task": "Выберите правильный ответ",
        "question": "Высокопроизводительный компьютер со значительным объёмом оперативной и внешней памяти, предназначенный для организации централизованных хранилищ данных большой ёмкости и выполнения интенсивных вычислительных работ – это …",
        "vars": [
            "+: мейнфрейм",
            "-: мини-ЭВМ",
            "-: персональная ЭВМ",
            "-: гетерогенная система"
        ]
    },
    {
        "type": "single",
        "theme": "",
        "task": "Выберите правильный ответ",
        "question": "Высокопроизводительный компьютер со значительным объёмом оперативной и внешней памяти, предназначенный для организации централизованных хранилищ данных большой ёмкости и выполнения интенсивных вычислительных работ – это …",
        "vars": [
            "+: мейнфрейм",
            "-: персональная ЭВМ",
            "-: гетерогенная ЭВМ"
        ]
    },
    {
        "type": "single",
        "theme": "История открытых информационных систем в России 9",
        "task": "Выберите правильный ответ",
        "question": "Высокопроизводительный компьютер со значительным объёмом оперативной и внешней памяти, предназначенный для организации централизованных хранилищ данных большой ёмкости и выполнения интенсивных вычислительных работ – это …",
        "vars": [
            "+: большая универсальная ЭВМ",
            "-: гетерогенная ЭВМ",
            "-: персональная ЭВМ"
        ]
    },
    {
        "type": "single",
        "theme": "История открытых информационных систем в России 10",
        "task": "Выберите правильный ответ",
        "question": "Проблемы совмести и переносимости программного обеспечения возникли при наступлении этапа применения …",
        "vars": [
            "+: гетерогенных систем",
            "-: гетеродинных систем",
            "-: портативных ЭВМ",
            "-: мини-ЭВМ"
        ]
    },
    {
        "type": "single",
        "theme": "",
        "task": "Выберите правильный ответ",
        "question": "Проблемы совмести и переносимости программного обеспечения возникли при наступлении этапа применения …",
        "vars": [
            "+: разнородных систем",
            "-: гетеродинных систем",
            "-: портативных ЭВМ",
            "-: мини-ЭВМ"
        ]
    },
    {
        "type": "single",
        "theme": "",
        "task": "Выберите правильный ответ",
        "question": "Проблемы совмести и переносимости программного обеспечения возникли при наступлении этапа применения …",
        "vars": [
            "+: открытых систем",
            "-: гетеродинных систем",
            "-: портативных ЭВМ",
            "-: мини-ЭВМ"
        ]
    },
    {
        "type": "single",
        "theme": "История открытых информационных систем в России 15",
        "task": "Выберите правильный ответ",
        "question": "Большая универсальная ЭВМ - это …",
        "vars": [
            "+: мейнфрейм",
            "-: персональная ЭВМ",
            "-: гетерогенная система",
            "-: мини-ЭВМ"
        ]
    },
    {
        "type": "single",
        "theme": "История открытых информационных систем в России 16",
        "task": "Выберите правильный ответ",
        "question": "Мейнфрейм - это …",
        "vars": [
            "+: большая универсальная ЭВМ",
            "-: персональная ЭВМ",
            "-: гетерогенная система",
            "-: мини-ЭВМ"
        ]
    },
    {
        "type": "single",
        "theme": "колич. групп компонентов в MUSIC (закр)",
        "task": "Выберите правильный вариант ответа",
        "question": "Модель MUSIC содержит … групп компонентов.",
        "vars": [
            "+: пять",
            "-:три",
            "-:четыре",
            "-: шесть"
        ]
    },
    {
        "type": "single",
        "theme": "Модель среды открытых систем EWOS 1",
        "task": "Выберите правильный вариант ответа",
        "question": "Европейская рабочая группа по открытым системам (EWOS) предложила … профилей стандартов составляющих среды открытых систем.",
        "vars": [
            "+: шесть",
            "-: семь",
            "-: восемь",
            "-: пять"
        ]
    },
    {
        "type": "single",
        "theme": "Понятие протокола (закр)",
        "task": "Выберите правильный ответ",
        "question": "Точно определенная последовательность действий, посредством которой две или более сторон совместно решают некоторую задачу, называется …",
        "vars": [
            "+: протоколом",
            "-: алгоритмом",
            "-: транзакцией",
            "-: профилем"
        ]
    },
    {
        "type": "single",
        "theme": "Понятие алгоритма (закр)",
        "task": "Выберите правильный ответ",
        "question": "Точно определенная последовательность действий, в которой участвует только одна сторона, называется …",
        "vars": [
            "+: алгоритмом",
            "-: протоколом"
        ]
    },
    {
        "type": "many",
        "theme": "История открытых информационных систем в России 13",
        "task": "Выберите правильные варианты ответа",
        "question": "Проблемы совмести и переносимости программного обеспечения возникли при наступлении этапа применения …",
        "vars": [
            "+: открытых систем",
            "+: гетерогенных систем",
            "+: разнородных систем",
            "-: портативных ЭВМ",
            "-: мини-ЭВМ"
        ]
    },
    {
        "type": "many",
        "theme": "Модель среды открытых систем MUSIC 3",
        "task": "Выберите правильные варианты ответов",
        "question": "Модель MUSIC содержит следующие группы компонентов:",
        "vars": [
            "+: управление",
            "+: пользовательский интерфейс",
            "-: рабочие станции",
            "-: транзакционный интерфейс"
        ]
    },
    {
        "type": "many",
        "theme": "Модель среды открытых систем MUSIC 4",
        "task": "Выберите правильные варианты ответов",
        "question": "Модель MUSIC содержит следующие группы компонентов:",
        "vars": [
            "+: системные интерфейсы для программ",
            "+: форматы информации и данных",
            "+: интерфейсы коммуникаций",
            "-: рабочие станции",
            "-: транзакционный интерфейс"
        ]
    },
    {
        "type": "many",
        "theme": "Модель среды открытых систем EWOS 3",
        "task": "Выберите правильные варианты ответов",
        "question": "Европейская рабочая группа по открытым системам (EWOS) предложила следующие профили стандартов составляющих среды открытых систем:",
        "vars": [
            "+: среда рабочих станций",
            "+: среда серверов процессов",
            "-: среда пользователей",
            "-: среда интерфейсов"
        ]
    },
    {
        "type": "many",
        "theme": "Модель среды открытых систем EWOS 4",
        "task": "Выберите правильные варианты ответов",
        "question": "Европейская рабочая группа по открытым системам (EWOS) предложила следующие профили стандартов составляющих среды открытых систем:",
        "vars": [
            "+: среда серверов данных",
            "+: среда транзакций",
            "-: среда управления",
            "-: среда форматов информации и данных"
        ]
    },
    {
        "type": "many",
        "theme": "Модель среды открытых систем EWOS 5",
        "task": "Выберите правильные ответы",
        "question": "Европейская рабочая группа по открытым системам (EWOS) предложила следующие профили стандартов составляющих среды открытых систем:",
        "vars": [
            "+: среда реального времени",
            "+: среда суперкомпьютеров",
            "-: среда управления",
            "-: среда пользователей"
        ]
    },
    {
        "type": "many",
        "theme": "Свойства протоколов 1",
        "task": "Выберите правильные ответы",
        "question": "К свойствам протоколов относится следующее:",
        "vars": [
            "+: действия выполняются поочередно от начала до конца, ни одно действие не начнется до тех пор, пока не закончится предыдущее.",
            "+: одного лица не достаточно для выполнения протокола.",
            "-: одного лица достаточно для выполнения протокола."
        ]
    },
    {
        "type": "many",
        "theme": "Свойства протоколов 3",
        "task": "Выберите правильные ответы",
        "question": "К свойствам протоколов относится следующее:",
        "vars": [
            "+: все участники протокола заранее знают последовательность действий, не могут отклониться от протокола.",
            "+: одного лица не достаточно для выполнения протокола.",
            "-: одного лица достаточно для выполнения протокола."
        ]
    },
    {
        "type": "many",
        "theme": "Свойства протоколов 4",
        "task": "Выберите правильные ответы",
        "question": "К свойствам протоколов относится следующее:",
        "vars": [
            "+: у протокола есть цель, при этом у каждого участника протокола могут быть своя цель, не обязательно одна и та же.",
            "+: одного лица не достаточно для выполнения протокола.",
            "-: одна сторона может одновременно выполнять несколько действий."
        ]
    },
    {
        "type": "enter",
        "theme": "История открытых информационных систем в России 6",
        "task": "Впишите завершение определения строчными буквами",
        "question": "Высокопроизводительный компьютер со значительным объёмом оперативной и внешней памяти, предназначенный для организации централизованных хранилищ данных большой ёмкости и выполнения интенсивных вычислительных работ называется ###",
        "vars": [
            "+: мейнфреймом",
            "+: м*йнфр*йм#$#",
            "+: м*йн-фр*йм#$#",
            "+: м*йнфр*йм#$#"
        ]
    },
    {
        "type": "enter",
        "theme": "История открытых информационных систем в России 14",
        "task": "Впишите завершение определения строчными буквами",
        "question": "Проблемы совмести и переносимости программного обеспечения возникли при наступлении этапа применения ### систем ЭВМ.",
        "vars": [
            "+: гетерогенных",
            "+: разнородных",
            "+: открытых",
            "+: г*т*р*генн#$#",
            "+: г*т*р*ген#$#",
            "+: р*зн*родн#$#",
            "+: *ткрыт#$#"
        ]
    },
    {
        "type": "enter",
        "theme": "колич. групп компонентов в MUSIC (откр)",
        "task": "Впишите пропущенную цифру",
        "question": "Модель MUSIC содержит ### групп компонентов.",
        "vars": [
            "+: 5"
        ]
    },
    {
        "type": "enter",
        "theme": "Модель среды открытых систем EWOS 2",
        "task": "Впишите пропущенную цифру",
        "question": "Европейская рабочая группа по открытым системам (EWOS) предложила ###профилей стандартов составляющих среды открытых систем.",
        "vars": [
            "+: 6"
        ]
    },
    {
        "type": "enter",
        "theme": "Понятие протокола (откр)",
        "task": "Впишите пропущенное слово строчными буквами",
        "question": "Точно определенная последовательность действий, посредством которой две или более сторон совместно решают некоторую задачу, называется ###",
        "vars": [
            "+: протоколом",
            "+: пр*т*кол#$#"
        ]
    },
    {
        "type": "enter",
        "theme": "Понятие алгоритма (откр)",
        "task": "Вставьте пропущенное слово строчными буквами",
        "question": "Точно определенная последовательность действий, в которой участвует только одна сторона, называется  ###",
        "vars": [
            "+: алгоритмом",
            "+: *лг*ритм#$#"
        ]
    },
    {
        "type": "single",
        "theme": "Определение сетевого уровня OSI (закр.)",
        "task": "Выберите правильный ответ",
        "question": "Фрагментацию и сборку передаваемых транспортным уровнем данных, маршрутизацию и продвижение их по сети от компьютера-отправителя к компьютеру-получателю выполняет … уровень модели OSI.",
        "vars": [
            "+: сетевой",
            "-: прикладной",
            "-: сеансовый",
            "-: канальный"
        ]
    },
    {
        "type": "single",
        "theme": "Определение транспортного уровня OSI (закр.)",
        "task": "Выберите правильный ответ",
        "question": "Обеспечение безошибочного сквозного обмена потоками данных между процессами во время сеанса выполняет … уровень модели OSI.",
        "vars": [
            "+: транспортный",
            "-: канальный",
            "-: сетевой",
            "-: сеансовый"
        ]
    },
    {
        "type": "single",
        "theme": "Определение сеансового уровня OSI (закр)",
        "task": "Выберите правильный ответ",
        "question": "Установление, поддержку и закрытие логического сеанса связи между удаленными процессами выполняет … уровень модели OSI.",
        "vars": [
            "+: сеансовый",
            "-: канальный",
            "-: сетевой",
            "-: транспортный"
        ]
    },
    {
        "type": "single",
        "theme": "Определение уровня представления OSI (закр)",
        "task": "Выберите правильный ответ",
        "question": "Согласование форматов, кодировок данных, процессов выполняет … уровень модели OSI.",
        "vars": [
            "+: представленческий",
            "-: прикладной",
            "-: сетевой",
            "-: транспортный"
        ]
    },
    {
        "type": "single",
        "theme": "Определение уровня приложения OSI (закр)",
        "task": "Выберите правильный ответ",
        "question": "Интерфейсом с прикладными процессами служит … модели OSI.",
        "vars": [
            "+: уровень приложения",
            "-: уровень представления",
            "-: сеансовый уровень",
            "-: сетевой уровень"
        ]
    },
    {
        "type": "single",
        "theme": "Определение уровня модели OSI",
        "task": "Выберите правильный ответ",
        "question": "Представление данных в виде сигналов и их кодирование являются функциями … уровня модели OSI.",
        "vars": [
            "+: физического",
            "-: прикладного",
            "-: транспортного",
            "-: сетевого"
        ]
    },
    {
        "type": "single",
        "theme": "Определение уровня модели OSI",
        "task": "Выберите правильный ответ",
        "question": "Управление каналом передачи данных, доступом к среде передачи и передачу данных по каналу выполняет … уровень модели OSI.",
        "vars": [
            "+: канальный",
            "-: сеансовый",
            "-: физический",
            "-: транспортный"
        ]
    },
    {
        "type": "single",
        "theme": "Определение уровня модели OSI",
        "task": "Выберите правильный ответ",
        "question": "… уровень обеспечивает прикладные процессы,  лежащие за пределами масштаба модели OSI",
        "vars": [
            "+: прикладной",
            "-: сеансовый",
            "-: сетевой",
            "-: транспортный"
        ]
    },
    {
        "type": "single",
        "theme": "Определение уровня модели OSI",
        "task": "Выберите правильный ответ",
        "question": "Фрагментация и сборка передаваемых транспортным уровнем данных, маршрутизация и продвижение их по сети от компьютера-отправителя к компьютеру-получателю",
        "vars": [
            "+: сетевой",
            "-: сеансовый",
            "-: физический",
            "-: канальный"
        ]
    },
    {
        "type": "single",
        "theme": "Определение уровня модели OSI",
        "task": "Выберите правильный ответ",
        "question": "Установление, поддержка и закрытие логического сеанса связи между удаленными процессами выполняет … уровень модели OSI.",
        "vars": [
            "+: сеансовый",
            "-: канальный",
            "-: сетевой",
            "-: транспортный"
        ]
    },
    {
        "type": "single",
        "theme": "Определение уровня модели OSI",
        "task": "Выберите правильный ответ",
        "question": "Согласование представления (форматов, кодировок) данных прикладных процессов выполняет … уровень модели OSI.",
        "vars": [
            "+: представительский",
            "-: сеансовый",
            "-: сетевой",
            "-: транспортный"
        ]
    },
    {
        "type": "single",
        "theme": "Определение уровня модели OSI",
        "task": "Выберите правильный ответ",
        "question": "Обеспечение безошибочного сквозного обмена потоками данных между процессами во время сеанса выполняет … уровень модели OSI.",
        "vars": [
            "+: транспортный",
            "-: сеансовый",
            "-: физический",
            "-: прикладной"
        ]
    },
    {
        "type": "compliance",
        "theme": "заимодействие ОИС (соотв)",
        "task": "Поставьте соответствие между уровнями модели OSI и их описаниями и функциями",
        "question": "Расположите уровни модели OSI снизу вверх (в порядке увеличения уровня абстракции).",
        "vars": [
            "L1: Физический уровень",
            "L2: Сеансовый уровень",
            "L3: Сетевой уровень",
            "L4: Транспортный",
            "L5:",
            "R1: Представление данных в виде физических сигналов и их кодирование",
            "R2: Установление, поддержка и закрытие логического сеанса связи между удаленными процессами",
            "R3: Фрагментация и сборка передаваемых транспортным уровнем данных, маршрутизация и продвижение их по сети от компьютера-отправителя к компьютеру-получателю",
            "R4: Обеспечение безошибочного сквозного обмена потоками данных между процессами во время сеанса",
            "R5: Управление каналом передачи данных, доступом к среде передачи и передачу данных по каналу"
        ]
    },
    {
        "type": "compliance",
        "theme": "заимодействие ОИС (соотв)",
        "task": "Поставьте соответствие между уровнями модели OSI и их функциями",
        "question": "",
        "vars": [
            "L1: Уровень приложения",
            "L2: Уровень представления",
            "L3: Сеансовый уровень",
            "L4: Физический уровень",
            "L5:",
            "R1: Интерфейс с прикладными процессами",
            "R2: Согласование представления (форматов, кодировок) данных прикладных процессов",
            "R3: Установление, поддержка и закрытие логического сеанса связи между удаленными процессами",
            "R4: Представление данных в виде физических сигналов и их кодирование",
            "R5: Управление каналом передачи данных, управление доступом к среде передачи, передача данных по каналу, обнаружение ошибок в канале и их коррекция"
        ]
    },
    {
        "type": "compliance",
        "theme": "заимодействие ОИС. (Соотв)",
        "task": "Поставьте соответствие между уровнями модели OSI и их функциями",
        "question": "",
        "vars": [
            "L1: Транспортный",
            "L2: Уровень представления",
            "L3: Сеансовый уровень",
            "L4: Физический уровень",
            "L5:",
            "R1: Обеспечение безошибочного сквозного обмена потоками данных между процессами во время сеанса",
            "R2: Согласование представления (форматов, кодировок) данных прикладных процессов",
            "R3: Установление, поддержка и закрытие логического сеанса связи между удаленными процессами",
            "R4: Представление данных в виде физических сигналов и их кодирование",
            "R5: Управление каналом передачи данных, управление доступом к среде передачи, передача данных по каналу, обнаружение ошибок в канале и их коррекция"
        ]
    },
    {
        "type": "compliance",
        "theme": "заимодействие ОИС. (Соотв.)",
        "task": "Поставьте соответствие между уровнями модели OSI и их функциями",
        "question": "",
        "vars": [
            "L1: Уровень приложения",
            "L2: Транспортный",
            "L3: Сеансовый уровень",
            "L4: Физический уровень",
            "L5:",
            "R1: Интерфейс с прикладными процессами",
            "R2: Обеспечение безошибочного сквозного обмена потоками данных между процессами во время сеанса",
            "R3: Установление, поддержка и закрытие логического сеанса связи между удаленными процессами",
            "R4: Представление данных в виде физических сигналов и их кодирование",
            "R5: Управление каналом передачи данных, управление доступом к среде передачи, передача данных по каналу, обнаружение ошибок в канале и их коррекция"
        ]
    },
    {
        "type": "compliance",
        "theme": "заимодействие ОИС. Соответствие терминов",
        "task": "Поставьте соответствие между уровнями модели OSI и их функциями",
        "question": "",
        "vars": [
            "L1: Уровень приложения",
            "L2: Уровень представления",
            "L3: Транспортный",
            "L4:Физический уровень",
            "L5:",
            "R1: Интерфейс с прикладными процессами",
            "R2: Согласование представления (форматов, кодировок) данных прикладных процессов",
            "R3: Обеспечение безошибочного сквозного обмена потоками данных между процессами во время сеанса",
            "R4: Представление данных в виде физических сигналов и их кодирование",
            "R5: Управление каналом передачи данных, управление доступом к среде передачи, передача данных по каналу, обнаружение ошибок в канале и их коррекция"
        ]
    },
    {
        "type": "compliance",
        "theme": "заимодействие ОИС. Соответствие терминов",
        "task": "Поставьте соответствие между уровнями модели OSI и их функциями",
        "question": "",
        "vars": [
            "L1: Уровень приложения",
            "L2: Уровень представления",
            "L3: Сеансовый уровень",
            "L4:Транспортный",
            "L5:",
            "R1: Интерфейс с прикладными процессами",
            "R2: Согласование представления (форматов, кодировок) данных прикладных процессов",
            "R3: Установление, поддержка и закрытие логического сеанса связи между удаленными процессами",
            "R4: Обеспечение безошибочного сквозного обмена потоками данных между процессами во время сеанса",
            "R5: Управление каналом передачи данных, управление доступом к среде передачи, передача данных по каналу, обнаружение ошибок в канале и их коррекция"
        ]
    },
    {
        "type": "compliance",
        "theme": "заимодействие ОИС. Соответствие терминов",
        "task": "Поставьте соответствие между уровнями модели OSI и их функциями",
        "question": "",
        "vars": [
            "L1: Уровень приложения",
            "L2: Уровень представления",
            "L3: Физический уровень",
            "L4:",
            "R1: Интерфейс с прикладными процессами",
            "R2: Согласование представления (форматов, кодировок) данных прикладных процессов",
            "R3: Представление данных в виде физических сигналов и их кодирование",
            "R4: Управление каналом передачи данных, управление доступом к среде передачи, передача данных по каналу, обнаружение ошибок в канале и их коррекция"
        ]
    },
    {
        "type": "compliance",
        "theme": "заимодействие ОИС. Соответствие терминов",
        "task": "Поставьте соответствие между уровнями модели OSI и их функциями",
        "question": "",
        "vars": [
            "L1: Уровень приложения",
            "L2: Уровень представления",
            "L3: Сеансовый уровень",
            "L4:",
            "R1: Интерфейс с прикладными процессами",
            "R2: Согласование представления (форматов, кодировок) данных прикладных процессов",
            "R3: Установление, поддержка и закрытие логического сеанса связи между удаленными процессами",
            "R4: Управление каналом передачи данных, управление доступом к среде передачи, передача данных по каналу, обнаружение ошибок в канале и их коррекция"
        ]
    },
    {
        "type": "compliance",
        "theme": "заимодействие ОИС. Соответствие терминов",
        "task": "Поставьте соответствие между уровнями модели OSI и их функциями",
        "question": "",
        "vars": [
            "L1: Уровень приложения",
            "L2: Уровень представления",
            "L3: Транспортный уровень",
            "L4:",
            "R1: Интерфейс с прикладными процессами",
            "R2: Согласование представления (форматов, кодировок) данных прикладных процессов",
            "R3: Обеспечение безошибочного сквозного обмена потоками данных между процессами во время сеанса",
            "R4: Управление каналом передачи данных, управление доступом к среде передачи, передача данных по каналу, обнаружение ошибок в канале и их коррекция"
        ]
    },
    {
        "type": "compliance",
        "theme": "заимодействие ОИС. Соответствие терминов",
        "task": "Поставьте соответствие между уровнями модели OSI и их функциями",
        "question": "",
        "vars": [
            "L1: Уровень приложения",
            "L2: Уровень представления",
            "L3: Сетевой уровень",
            "L4:",
            "R1: Интерфейс с прикладными процессами",
            "R2: Согласование представления (форматов, кодировок) данных прикладных процессов",
            "R3: Фрагментация и сборка передаваемых транспортным уровнем данных, маршрутизация и продвижение их по сети от компьютера-отправителя к компьютеру-получателю",
            "R4: Управление каналом передачи данных, управление доступом к среде передачи, передача данных по каналу, обнаружение ошибок в канале и их коррекция"
        ]
    },
    {
        "type": "compliance",
        "theme": "заимодействие ОИС. Соответствие терминов",
        "task": "Поставьте соответствие между уровнями модели OSI и их функциями",
        "question": "",
        "vars": [
            "L1: Сеансовый уровень",
            "L2: Уровень представления",
            "L3: Уровень приложения",
            "L4: Транспортный уровень",
            "L5:",
            "R1: Установление, поддержка и закрытие логического сеанса связи между удаленными процессами",
            "R2: Согласование представления (форматов, кодировок) данных прикладных процессов",
            "R3: Интерфейс с прикладными процессами",
            "R4: Обеспечение безошибочного сквозного обмена потоками данных между процессами во время сеанса",
            "R5: Управление каналом передачи данных, управление доступом к среде передачи, передача данных по каналу, обнаружение ошибок в канале и их коррекция"
        ]
    },
    {
        "type": "compliance",
        "theme": "заимодействие ОИС. Соответствие терминов",
        "task": "Поставьте соответствие между уровнями модели OSI и их функциями",
        "question": "",
        "vars": [
            "L1: Транспортный уровень",
            "L2: Сетевой уровень",
            "L3: Канальный уровень",
            "L4:",
            "R1: Обеспечение безошибочного сквозного обмена потоками данных между процессами во время сеанса",
            "R2: Фрагментация и сборка передаваемых транспортным уровнем данных, маршрутизация и продвижение их по сети от компьютера-отправителя к компьютеру-получателю",
            "R3: Управление каналом передачи данных, управление доступом к среде передачи, передача данных по каналу, обнаружение ошибок в канале и их коррекция",
            "R4: Установление, поддержка и закрытие логического сеанса связи между удаленными процессами"
        ]
    },
    {
        "type": "compliance",
        "theme": "заимодействие ОИС. Соответствие терминов",
        "task": "Поставьте соответствие между уровнями модели OSI и их функциями",
        "question": "",
        "vars": [
            "L1: Транспортный уровень",
            "L2: Сетевой уровень",
            "L3: Канальный уровень",
            "L4: Сеансовый уровень",
            "L5:",
            "R1: Обеспечение безошибочного сквозного обмена потоками данных между процессами во время сеанса",
            "R2: Фрагментация и сборка передаваемых транспортным уровнем данных, маршрутизация и продвижение их по сети от компьютера-отправителя к компьютеру-получателю",
            "R3: Управление каналом передачи данных, управление доступом к среде передачи, передача данных по каналу, обнаружение ошибок в канале и их коррекция",
            "R4: Установление, поддержка и закрытие логического сеанса связи между удаленными процессами",
            "R5: Установление, поддержка и закрытие логического сеанса связи между удаленными процессами"
        ]
    },
    {
        "type": "compliance",
        "theme": "заимодействие ОИС. Соответствие терминов",
        "task": "Поставьте соответствие между уровнями модели OSI и их функциями",
        "question": "",
        "vars": [
            "L1: Сеансовый уровень",
            "L2: Сетевой уровень",
            "L3: Канальный уровень",
            "L4:",
            "R1: Установление, поддержка и закрытие логического сеанса связи между удаленными процессами",
            "R2: Фрагментация и сборка передаваемых транспортным уровнем данных, маршрутизация и продвижение их по сети от компьютера-отправителя к компьютеру-получателю",
            "R3: Управление каналом передачи данных, управление доступом к среде передачи, передача данных по каналу, обнаружение ошибок в канале и их коррекция",
            "R4: Установление, поддержка и закрытие логического сеанса связи между удаленными процессами"
        ]
    },
    {
        "type": "compliance",
        "theme": "заимодействие ОИС. Соответствие терминов",
        "task": "Поставьте соответствие между уровнями модели OSI и их функциями",
        "question": "",
        "vars": [
            "L1: Сеансовый уровень",
            "L2: Сетевой уровень",
            "L3: Канальный уровень",
            "L4: Физический уровень",
            "L5:",
            "R1: Установление, поддержка и закрытие логического сеанса связи между удаленными процессами",
            "R2: Фрагментация и сборка передаваемых транспортным уровнем данных, маршрутизация и продвижение их по сети от компьютера-отправителя к компьютеру-получателю",
            "R3: Управление каналом передачи данных, управление доступом к среде передачи, передача данных по каналу, обнаружение ошибок в канале и их коррекция",
            "R4: Представление данных в виде физических сигналов и их кодирование",
            "R5: Установление, поддержка и закрытие логического сеанса связи между удаленными процессами"
        ]
    },
    {
        "type": "compliance",
        "theme": "заимодействие ОИС. Соответствие терминов",
        "task": "Поставьте соответствие между уровнями модели OSI и их функциями",
        "question": "",
        "vars": [
            "L1: Транспортный уровень",
            "L2: Сетевой уровень",
            "L3: Канальный уровень",
            "L4: Уровень представления",
            "L5:",
            "R1: Обеспечение безошибочного сквозного обмена потоками данных между процессами во время сеанса",
            "R2: Фрагментация и сборка передаваемых транспортным уровнем данных, маршрутизация и продвижение их по сети от компьютера-отправителя к компьютеру-получателю",
            "R3: Управление каналом передачи данных, управление доступом к среде передачи, передача данных по каналу, обнаружение ошибок в канале и их коррекция",
            "R4: Согласование представления (форматов, кодировок) данных прикладных процессов",
            "R5: Установление, поддержка и закрытие логического сеанса связи между удаленными процессами"
        ]
    },
    {
        "type": "enter",
        "theme": "Определение сетевого уровня OSI (откр.)",
        "task": "Впишите пропущенное слово",
        "question": "Фрагментацию и сборку передаваемых транспортным уровнем данных, маршрутизацию и продвижение их по сети от компьютера-отправителя к компьютеру-получателю выполняет ### уровень модели OSI.",
        "vars": [
            "+: сетевой",
            "+: с*тев#$#"
        ]
    },
    {
        "type": "enter",
        "theme": "Определение транспортного уровня OSI (откр)",
        "task": "Впишите пропущенное слово",
        "question": "Обеспечение безошибочного сквозного обмена потоками данных между процессами во время сеанса выполняет ### уровень модели OSI.",
        "vars": [
            "+: транспортный",
            "+: трансп*ртн#$#"
        ]
    },
    {
        "type": "enter",
        "theme": "Определение сеансового уровня OSI (откр)",
        "task": "Впишите пропущенное слово",
        "question": "Установление, поддержку и закрытие логического сеанса связи между удаленными процессами выполняет ### уровень модели OSI.",
        "vars": [
            "+: сеансовый",
            "+: с*анс*в#$#"
        ]
    },
    {
        "type": "enter",
        "theme": "Определение уровня представления OSI (откр)",
        "task": "Впишите пропущенное слово строчными буквами",
        "question": "Согласование представления (форматов, кодировок) данных прикладных процессов выполняет уровень ### модели OSI.",
        "vars": [
            "+: представления",
            "+: представленческий",
            "+: пр*дст*влен#$#",
            "+: пр*дст*вленч*ск#$#"
        ]
    },
    {
        "type": "enter",
        "theme": "Определение уровня приложения OSI (откр)",
        "task": "Впишите пропущенное слово строчными буквами",
        "question": "Интерфейсом с прикладными процессами служит уровень ### модели OSI.",
        "vars": [
            "+: приложения",
            "+: прикладной",
            "+: пр*л*жен#$#",
            "+: пр*кл*дн#$#"
        ]
    },
    {
        "type": "enter",
        "theme": "Определение уровня модели OSI",
        "task": "Впишите пропущенное слово строчными буквами",
        "question": "Представление данных в виде сигналов и их кодирование являются функциями ### уровня модели OSI.",
        "vars": [
            "+: физического",
            "+: **зич*ск#$#"
        ]
    },
    {
        "type": "enter",
        "theme": "Определение уровня модели OSI",
        "task": "Впишите пропущенное слово строчными буквами",
        "question": "Управление каналом передачи данных, доступом к среде передачи и передачу данных по каналу выполняет ### уровень модели OSI.",
        "vars": [
            "+: канальный",
            "+: **нальн#$#"
        ]
    },
    {
        "type": "enter",
        "theme": "Определение уровня модели OSI",
        "task": "Впишите пропущенное слово строчными буквами",
        "question": "###уровень обеспечивает прикладные процессы,  лежащие за пределами масштаба модели OSI",
        "vars": [
            "+: прикладной",
            "+: *р*кладн#$#"
        ]
    },
    {
        "type": "enter",
        "theme": "Определение уровня модели OSI",
        "task": "Впишите пропущенное слово строчными буквами",
        "question": "Фрагментация и сборка передаваемых транспортным уровнем данных, маршрутизация и продвижение их по сети от компьютера-отправителя к компьютеру-получателю",
        "vars": [
            "+: сетевой",
            "+: **тев#$#"
        ]
    },
    {
        "type": "enter",
        "theme": "Определение уровня модели OSI",
        "task": "Впишите пропущенное слово строчными буквами",
        "question": "Установление, поддержка и закрытие логического сеанса связи между удаленными процессами### уровень модели OSI.",
        "vars": [
            "+: сеансовый",
            "+: **ансов#$#"
        ]
    },
    {
        "type": "enter",
        "theme": "Определение уровня модели OSI",
        "task": "Впишите пропущенное слово строчными буквами",
        "question": "Согласование представления (форматов, кодировок) данных прикладных процессов### уровень модели OSI.",
        "vars": [
            "+: представительский",
            "+: *р*дст*в#$#"
        ]
    },
    {
        "type": "enter",
        "theme": "Определение уровня модели OSI",
        "task": "Впишите пропущенное слово строчными буквами",
        "question": "Обеспечение безошибочного сквозного обмена потоками данных между процессами во время сеанса выполняет ### уровень модели OSI.",
        "vars": [
            "+: транспортный",
            "+: *р*нспорт#$#"
        ]
    },
    {
        "type": "single",
        "theme": "Федеральные органы стандартизации 1",
        "task": "Выберите правильный вариант ответа",
        "question": "Главным федеральным органом России по вопросам стандартизации является …",
        "vars": [
            "+: Росстандарт",
            "-: Госстандарт",
            "-: Росгосстандарт",
            "-: Министерство стандартизации"
        ]
    },
    {
        "type": "single",
        "theme": "Государственный профиль взаимодействия открытых систем  1",
        "task": "Выберите правильный вариант ответа",
        "question": "Государственный профиль взаимодействия открытых систем определяет:",
        "vars": [
            "+: государственную политику России в области информационных технологий, её ориентацию на ИСО/МЭК;",
            "-: порядок назначения на должности сотрудников для разработки стандартов, касающихся информационных технологий.",
            "-:набор взаимосвязанных мировых стандартов, предназначенных для регламентации прикладных задач (электронная почта, кодирование символов, базы данных и т.д.);"
        ]
    },
    {
        "type": "single",
        "theme": "Государственный профиль взаимодействия открытых систем  2",
        "task": "Выберите правильный вариант ответа",
        "question": "Государственный профиль взаимодействия открытых систем определяет:",
        "vars": [
            "+: набор взаимосвязанных государственных стандартов России, предназначенный для регламентации прикладных задач (электронная почта, кодирование символов, базы данных и т.д.);",
            "-: порядок назначения на должности сотрудников для разработки стандартов, касающихся информационных технологий.",
            "-: набор взаимосвязанных мировых стандартов, предназначенных для регламентации прикладных задач (электронная почта, кодирование символов, базы данных и т.д.);"
        ]
    },
    {
        "type": "single",
        "theme": "Государственный профиль взаимодействия открытых систем  3",
        "task": "Выберите правильный вариант ответа",
        "question": "Государственный профиль взаимодействия открытых систем определяет:",
        "vars": [
            "+: очередность разработки стандартов, касающихся информационных технологий.",
            "-: порядок назначения на должности сотрудников для разработки стандартов, касающихся информационных технологий.",
            "-: набор взаимосвязанных мировых стандартов, предназначенных для регламентации прикладных задач (электронная почта, кодирование символов, базы данных и т.д.);"
        ]
    },
    {
        "type": "single",
        "theme": "Разработка проекта стандарта (окончательная редакция) 1",
        "task": "Выберите правильный вариант ответа",
        "question": "Проект стандарта (окончательную редакцию) с пояснительной запиской ТК (ПК) направляют:",
        "vars": [
            "+: членам ТК (ПК);",
            "-: служащим Министерства промышленности и торговли Российской Федерации",
            "-: в инженерную организацию"
        ]
    },
    {
        "type": "single",
        "theme": "Разработка проекта стандарта (окончательная редакция) 2",
        "task": "Выберите правильный вариант ответа",
        "question": "Проект стандарта (окончательную редакцию) с пояснительной запиской ТК (ПК) направляют:",
        "vars": [
            "+: в научно-исследовательскую организацию (в двух экземплярах);",
            "-: служащим Министерства промышленности и торговли Российской Федерации",
            "-: в инженерную организацию"
        ]
    },
    {
        "type": "single",
        "theme": "Разработка проекта стандарта (окончательная редакция) 3",
        "task": "Выберите правильный вариант ответа",
        "question": "Проект стандарта (окончательную редакцию) с пояснительной запиской ТК (ПК) направляют:",
        "vars": [
            "+: органам государственного контроля и надзора, если они не являются членами ТК (ПК), и если это необходимо;",
            "-: служащим Министерства промышленности и торговли Российской Федерации",
            "-:в инженерную организацию"
        ]
    },
    {
        "type": "single",
        "theme": "Сроки согласования проекта 1",
        "task": "Выберите правильный вариант ответа",
        "question": "Органы государственного контроля и надзора, которые не являются членами ТК (ПК), согласовывают этот проект в … срок со дня получения проекта стандарта.",
        "vars": [
            "+: месячный",
            "-: недельный",
            "-: двухнедельный",
            "-: пятидневный"
        ]
    },
    {
        "type": "single",
        "theme": "оспрофиль ВОС РФ. Преимущества Госпрофиля ВОС",
        "task": "Выберите правильный ответ",
        "question": "К ожидаемым преимуществам внедрения в РФ Госпрофиля ВОС относится…",
        "vars": [
            "+: взаимная совместимость всех технических и программных средств внутри РФ и на международном уровне",
            "-: взаимная совместимость всех технических средств внутри РФ",
            "-: взаимная совместимость всех программных средств внутри РФ",
            "-: взаимная совместимость всех технических и программных средств внутри РФ"
        ]
    },
    {
        "type": "single",
        "theme": "Сроки подготовки заключения по проекту 1",
        "task": "Выберите правильный вариант ответа",
        "question": "Научно-исследовательская организация готовит заключение на проект стандарта, обеспечивает его издательское редактирование, направляет в ТК (ПК) заключение и экземпляр проекта стандарта, прошедшего издательское редактирование, в срок, не превышающий … со дня получения проекта.",
        "vars": [
            "+: месяца",
            "-: недели",
            "-: двух недель",
            "-: пяти дней"
        ]
    },
    {
        "type": "single",
        "theme": "Окончательная редакция проекта стандарта 1",
        "task": "Выберите правильный вариант ответа",
        "question": "ТК направляет для принятия в Госстандарт России (Госстрой России) проект стандарта (окончательную редакцию) в …экземплярах.",
        "vars": [
            "+: трех",
            "-: четырёх",
            "-: двух",
            "-: пяти"
        ]
    },
    {
        "type": "single",
        "theme": "Принятие и государственная регистрация стандарта 1",
        "task": "Выберите правильный вариант ответа",
        "question": "Проект стандарта рассматривают, принимают его и вводят в действие Постановлением …",
        "vars": [
            "+: Госстандарта России",
            "-: Правительства России",
            "-: Совета Федерации",
            "-: Государственной Думы"
        ]
    },
    {
        "type": "single",
        "theme": "Принятие и государственная регистрация стандарта 6",
        "task": "Выберите правильный вариант ответа",
        "question": "При принятии стандарта устанавливают дату его введения в действие с учетом мероприятий, необходимых для внедрения стандарта. Срок действия стандарта, как правило,…",
        "vars": [
            "+: не устанавливают",
            "-: равен 5 годам",
            "-: равен 10 годам",
            "-: равен 15 годам"
        ]
    },
    {
        "type": "single",
        "theme": "Отмена стандарта 1",
        "task": "Выберите правильный вариант ответа",
        "question": "Госстандарт России принимает решение об отмене стандарта:",
        "vars": [
            "+: в связи с прекращением выпуска продукции или оказания услуг",
            "-: по требованию членов Госстроя России"
        ]
    },
    {
        "type": "single",
        "theme": "Отмена стандарта 2",
        "task": "Выберите правильный вариант ответа",
        "question": "Госстандарт России принимает решение об отмене стандарта:",
        "vars": [
            "+: при разработке взамен данного стандарта другого нормативного документа",
            "-: по желанию членов Госстроя России"
        ]
    },
    {
        "type": "single",
        "theme": "Разработка изменения к стандарту 1",
        "task": "Выберите правильный вариант ответа",
        "question": "Проект изменения к стандарту направляют для принятия в Госстандарт России, как правило, не позднее чем за … месяцев до предполагаемой даты введения изменения в действие.",
        "vars": [
            "+: девять",
            "-: шесть",
            "-: двенадцать",
            "-: десять"
        ]
    },
    {
        "type": "single",
        "theme": "Разработка изменения к стандарту 4",
        "task": "Выберите правильный вариант ответа",
        "question": "Каждому вносимому в стандарт изменению Госстандарт России присваивает порядковый номер и устанавливает дату введения изменения в действие (как правило, не менее чем через … месяцев со дня принятия изменения).",
        "vars": [
            "+: шесть",
            "-: девять",
            "-: двенадцать",
            "-: десять"
        ]
    },
    {
        "type": "single",
        "theme": "Пересмотр стандарта 1",
        "task": "Выберите правильный вариант ответа",
        "question": "При пересмотре стандарта на конкретную продукцию в случае, если …, действующий стандарт не отменяют.",
        "vars": [
            "+: необходимо выполнять ремонт ранее выпущенных изделий, находящихся в эксплуатации",
            "-: разработка и внедрение стандарта не покрывается бюджетом"
        ]
    },
    {
        "type": "single",
        "theme": "Пересмотр стандарта 2",
        "task": "Выберите правильный вариант ответа",
        "question": "При пересмотре стандарта на конкретную продукцию в случае, если …, действующий стандарт не отменяют.",
        "vars": [
            "+: необходимо изготовлять запасные части",
            "-: разработка и внедрение стандарта не покрывается бюджетом"
        ]
    },
    {
        "type": "single",
        "theme": "оспрофиль ВОС РФ. Определение правительственного профиля ВОС 1",
        "task": "Выберите правильный ответ",
        "question": "Профиль ВОС, который отражает техническую политику государства в области информационной технологии и стремление каждого государства обеспечить соответствие изделий информационной технологии текущим стандартам ISO по взаимодействию открытых систем, называется …",
        "vars": [
            "+: правительственным",
            "-: государственным",
            "-: политическим",
            "-: федеральным"
        ]
    },
    {
        "type": "single",
        "theme": "оспрофиль ВОС РФ. Определение государственного профиля ВОС 1",
        "task": "Выберите правильный ответ",
        "question": "Профиль ВОС, который имеет основной целью создание единого информационного пространства России, совместимого с мировым информационным пространством, называется …",
        "vars": [
            "+: государственным",
            "-: правительственным",
            "-: политическим",
            "-: федеральным"
        ]
    },
    {
        "type": "many",
        "theme": "Государственная система стандартизации Российской Федерации1",
        "task": "Выберите правильные варианты ответов",
        "question": "Стандарт Р 1.5-92 «Государственная система стандартизации Российской Федерации. Общие требования к построению, изложению, оформлению и содержанию стандартов» устанавливает требования к:",
        "vars": [
            "+: разработке стандартов",
            "+: согласованию стандартов",
            "-: сотрудникам, разрабатывающим стандарты",
            "-: иностранным стандартам"
        ]
    },
    {
        "type": "many",
        "theme": "Государственная система стандартизации Российской Федерации2",
        "task": "Выберите правильные варианты ответов",
        "question": "Стандарт Р 1.5-92 «Государственная система стандартизации Российской Федерации. Общие требования к построению, изложению, оформлению и содержанию стандартов» устанавливает требования к:",
        "vars": [
            "+: принятию стандартов",
            "+: изданию стандартов",
            "-:  сотрудникам, разрабатывающим стандарты",
            "-: иностранным стандартам"
        ]
    },
    {
        "type": "many",
        "theme": "Государственная система стандартизации Российской Федерации3",
        "task": "Выберите правильные варианты ответов",
        "question": "Стандарт Р 1.5-92 «Государственная система стандартизации Российской Федерации. Общие требования к построению, изложению, оформлению и содержанию стандартов» устанавливает требования к:",
        "vars": [
            "+: обновлению стандартов",
            "+: отмене стандартов",
            "-:  сотрудникам, разрабатывающим стандарты",
            "-: иностранным стандартам"
        ]
    },
    {
        "type": "many",
        "theme": "Государственная система стандартизации Российской Федерации4",
        "task": "Выберите правильные варианты ответов",
        "question": "Положения стандарта Р 1.5-92 «Государственная система стандартизации Российской Федерации. Общие требования к построению, изложению, оформлению и содержанию стандартов» подлежат применению:",
        "vars": [
            "+: техническими комитетами по стандартизации",
            "+: государственными органами управления",
            "-: всеми гражданами РФ",
            "-: иностранными гражданами"
        ]
    },
    {
        "type": "many",
        "theme": "Государственная система стандартизации Российской Федерации5",
        "task": "Выберите правильные варианты ответов",
        "question": "Положения стандарта Р 1.5-92 «Государственная система стандартизации Российской Федерации. Общие требования к построению, изложению, оформлению и содержанию стандартов» подлежат применению:",
        "vars": [
            "+: предприятиями",
            "+: предпринимателями",
            "-: всеми гражданами РФ",
            "-: иностранными гражданами"
        ]
    },
    {
        "type": "many",
        "theme": "Государственная система стандартизации Российской Федерации6",
        "task": "Выберите правильные варианты ответов",
        "question": "Положения стандарта Р 1.5-92 «Государственная система стандартизации Российской Федерации. Общие требования к построению, изложению, оформлению и содержанию стандартов» подлежат применению:",
        "vars": [
            "+: научно-техническими обществами",
            "+: инженерными обществами",
            "-: всеми гражданами РФ",
            "-: иностранными гражданами"
        ]
    },
    {
        "type": "many",
        "theme": "Разработка государственных стандартов Российской Федерации 1",
        "task": "Выберите правильный вариант ответа",
        "question": "Разработку государственных стандартов Российской Федерации в соответствии с заданиями планов государственной стандартизации Российской Федерации, программ (планов) работ ТК и договоров на разработку стандартов или в инициативном порядке осуществляют:",
        "vars": [
            "+: технические комитеты по стандартизации (ТК)",
            "+: предприятия",
            "+: общественные объединения",
            "-: депутаты Государственной Думы",
            "-: служащие Министерства промышленности и торговли Российской Федерации‎"
        ]
    },
    {
        "type": "many",
        "theme": "Организация разработки стандарта 1",
        "task": "Выберите правильные варианты ответов",
        "question": "Заявки на разработку стандартов могут представлять:",
        "vars": [
            "+: ТК",
            "+: научно-технические общества",
            "+: инженерные общества",
            "+: государственные органы управления",
            "-: депутаты Государственной Думы РФ",
            "-: рядовые граждане"
        ]
    },
    {
        "type": "many",
        "theme": "Разработка проекта стандарта1",
        "task": "Выберите правильные варианты ответов",
        "question": "ТК организует разработку проекта стандарта и совершает следующие действия:",
        "vars": [
            "+: определяет подкомитет (ПК), в котором будут разрабатывать стандарт;",
            "+: определяет рабочую группу или предприятие для разработки проекта стандарта;",
            "-:определяет рабочую группу или предприятие для проверки качества проделанной работы.",
            "-:устанавливает сроки всех необходимых согласований"
        ]
    },
    {
        "type": "many",
        "theme": "Разработка проекта стандарта2",
        "task": "Выберите правильные варианты ответов",
        "question": "ТК организует разработку проекта стандарта и совершает следующие действия:",
        "vars": [
            "+: устанавливает сроки выполнения работ по стадиям разработки стандарта в соответствии со сроками, установленными договором",
            "+: определяет рабочую группу или предприятие для разработки проекта стандарта;",
            "-: определяет рабочую группу или предприятие для проверки качества проделанной работы.",
            "-:устанавливает сроки всех необходимых согласований"
        ]
    },
    {
        "type": "many",
        "theme": "Разработка проекта стандарта (первая редакция) 1",
        "task": "Выберите правильные варианты ответов",
        "question": "Рабочая группа (предприятие) готовит проект стандарта и пояснительную записку к нему. В пояснительной записке к проекту стандарта в общем случае приводят:",
        "vars": [
            "+: основание для разработки стандарта с указанием соответствующего документа;",
            "+: краткую характеристику объекта стандартизации;",
            "-: краткую характеристику субъекта стандартизации;",
            "-: подробное описание объекта стандартизации;"
        ]
    },
    {
        "type": "many",
        "theme": "Разработка проекта стандарта (первая редакция) 2",
        "task": "Выберите правильные ответы",
        "question": "Рабочая группа (предприятие) готовит проект стандарта и пояснительную записку к нему. В пояснительной записке к проекту стандарта в общем случае приводят:",
        "vars": [
            "+: сведения о соответствии проекта стандарта законодательству Российской Федерации, международным, региональным стандартам, правилам, нормам и рекомендациям по стандартизации (их проектам), а также прогрессивным национальным стандартам других стран;",
            "+: сведения о патентной чистоте проекта стандарта;",
            "-: краткую характеристику субъекта стандартизации;",
            "-: подробное описание объекта стандартизации;"
        ]
    },
    {
        "type": "many",
        "theme": "Разработка проекта стандарта (первая редакция) 3",
        "task": "Выберите правильные ответы",
        "question": "Рабочая группа (предприятие) готовит проект стандарта и пояснительную записку к нему. В пояснительной записке к проекту стандарта в общем случае приводят:",
        "vars": [
            "+: сведения о взаимосвязи проекта стандарта с другими нормативными документами",
            "+: сведения о рассылке на отзыв и опубликовании аннотации о проекте стандарта",
            "-: краткую характеристику субъекта стандартизации;",
            "-: подробное описание объекта стандартизации;"
        ]
    },
    {
        "type": "many",
        "theme": "Разработка проекта стандарта (первая редакция) 4",
        "task": "Выберите правильные ответы",
        "question": "Рабочая группа (предприятие) готовит проект стандарта и пояснительную записку к нему. В пояснительной записке к проекту стандарта в общем случае приводят:",
        "vars": [
            "+: сведения о согласовании, если оно проводилось;",
            "+: источники информации;",
            "-: краткую характеристику субъекта стандартизации;",
            "-: подробное описание объекта стандартизации;"
        ]
    },
    {
        "type": "many",
        "theme": "Принятие проекта стандарта 1",
        "task": "Выберите правильные варианты ответов",
        "question": "Проект стандарта не может быть направлен для принятия в следующих случаях:",
        "vars": [
            "+: если за него не проголосовали члены ТК (ПК), являющиеся полномочными представителями органов государственного контроля и надзора;",
            "+: если его не согласовали органы государственного контроля и надзора, не являющиеся членами ТК (ПК).",
            "-: если за него проголосовали члены ТК (ПК), являющиеся полномочными представителями органов государственного контроля и надзора;",
            "-: если его не согласовали органы государственного контроля и надзора, являющиеся членами ТК (ПК)."
        ]
    },
    {
        "type": "many",
        "theme": "Принятие проекта стандарта 2",
        "task": "Выберите правильные варианты ответов",
        "question": "ТК направляет для принятия в Госстандарт России проект стандарта (окончательную редакцию) в трех экземплярах, один из которых должен быть первым, с сопроводительным письмом и следующей документацией в одном экземпляре:",
        "vars": [
            "+: пояснительной запиской к проекту стандарта;",
            "+: протоколом заседания ТК (ПК) по рассмотрению окончательной редакции проекта стандарта;",
            "-: нотариально заверенными документами, подтверждающими согласование окончательной редакции проекта стандарта, если оно проводилось;",
            "-: протоколом заседания ТК (ПК) по рассмотрению первой редакции проекта стандарта;"
        ]
    },
    {
        "type": "many",
        "theme": "Принятие проекта стандарта 3",
        "task": "Выберите правильные варианты ответов",
        "question": "ТК направляет для принятия в Госстандарт России проект стандарта (окончательную редакцию) в трех экземплярах, один из которых должен быть первым, с сопроводительным письмом и следующей документацией в одном экземпляре:",
        "vars": [
            "+: подлинными документами, подтверждающими согласование окончательной редакции проекта стандарта, если оно проводилось;",
            "+: экземпляром проекта стандарта, прошедшего издательское редактирование.",
            "-: нотариально заверенными документами, подтверждающими согласование окончательной редакции проекта стандарта, если оно проводилось;",
            "-: протоколом заседания ТК (ПК) по рассмотрению первой редакции проекта стандарта;"
        ]
    },
    {
        "type": "many",
        "theme": "Принятие и государственная регистрация стандарта 3",
        "task": "Выберите правильные варианты ответов",
        "question": "Перед принятием стандарта Госстандарт России проводит его проверку на соответствие:",
        "vars": [
            "+: законодательству Российской Федерации",
            "+: требованиям государственных стандартов",
            "-: международным требованиям",
            "-: правилам русского языка"
        ]
    },
    {
        "type": "many",
        "theme": "Принятие и государственная регистрация стандарта 4",
        "task": "Выберите правильные варианты ответов",
        "question": "Перед принятием стандарта Госстандарт России проводит его проверку на соответствие:",
        "vars": [
            "+: метрологическим правилам и нормам",
            "+: применяемой терминологии",
            "-: международным требованиям",
            "-: правилам русского языка"
        ]
    },
    {
        "type": "many",
        "theme": "Принятие и государственная регистрация стандарта 5",
        "task": "Выберите правильные варианты ответов",
        "question": "Перед принятием стандарта Госстандарт России проводит его проверку на соответствие: …",
        "vars": [
            "+: правилам построения;",
            "+: правилам изложения;",
            "+: правилам оформления;",
            "-: международным требованиям;"
        ]
    },
    {
        "type": "many",
        "theme": "тмена стандарта",
        "task": "Выберите правильные варианты ответов",
        "question": "При согласии с предложением об отмене стандарта ТК направляет в Госстандарт России с сопроводительным письмом следующую документацию в одном экземпляре:",
        "vars": [
            "+: протокол заседания ТК (ПК), содержащий предложение об отмене стандарта;",
            "+: информацию о том, какой документ будет действовать взамен, или информацию об отмене стандарта без замены",
            "+:подлинные документы, подтверждающие согласование возможности отмены стандарта с органами государственного контроля и надзора",
            "-: нотариально заверенные документы, подтверждающие согласование возможности отмены стандарта с органами государственного контроля и надзора",
            "-: заверенный список участников заседания ТК (ПК)"
        ]
    },
    {
        "type": "compliance",
        "theme": "Классификация стандартов по уровню утверждающей организации 1",
        "task": "становите соответствие",
        "question": "Стандарты в области информационных технологий можно классифицировать по уровню утверждающей организации следующим образом:",
        "vars": [
            "L1: Верхний уровень",
            "L2: Средний уровень",
            "L3: Нижний уровень",
            "R1: международные стандарты (ISP), признанные соответствующими международными комитетами;",
            "R2: региональные стандарты, создаваемые для группы стран или континентов;",
            "R3: национальные стандарты, действующие в рамках отдельных государств."
        ]
    },
    {
        "type": "enter",
        "theme": "Федеральные органы стандартизации 2",
        "task": "Впишите пропущенное слово строчными буквами",
        "question": "Главным федеральным органом России по вопросам стандартизации является###",
        "vars": [
            "+: росстандарт",
            "+: р*сст*нд*рт#$#"
        ]
    },
    {
        "type": "compliance",
        "theme": "Порядок разработки стандарта 1",
        "task": "Установите соответствие",
        "question": "Сопоставьте стадии разработки стандарта с их порядком.",
        "vars": [
            "L1:1-я стадия",
            "L2: 2-я стадия",
            "L3: 3-я стадия",
            "R1: организация разработки стандарта",
            "R2: разработка проекта стандарта (первая редакция)",
            "R3: разработка проекта стандарта (окончательная редакция) и представление его для принятия"
        ]
    },
    {
        "type": "compliance",
        "theme": "Порядок разработки стандарта 3",
        "task": "Установите соответствие",
        "question": "Сопоставьте стадии разработки стандарта с их порядком.",
        "vars": [
            "L1:3-я стадия",
            "L2: 4-я стадия",
            "L3: 5-я стадия",
            "R1: разработка проекта стандарта (окончательная редакция) и представление его для принятия",
            "R2: принятие и государственная регистрация стандарта",
            "R3: издание стандарта"
        ]
    },
    {
        "type": "enter",
        "theme": "Госстрой России 1",
        "task": "Впишите пропущенное слово строчными буквами",
        "question": "Подготовку и рассмотрение заявок, формирование годового плана государственной стандартизации Российской Федерации, заключение договора на разработку стандарта осуществляют в порядке, установленном Госстандартом или ### России.",
        "vars": [
            "+: госстроем",
            "+: госстро#$#"
        ]
    },
    {
        "type": "enter",
        "theme": "Госстрой России 2",
        "task": "Впишите пропущенное слово строчными буквами",
        "question": "Подготовку и рассмотрение заявок, формирование годового плана государственной стандартизации Российской Федерации, заключение договора на разработку стандарта осуществляют в порядке, установленном ### или Госстроем России.",
        "vars": [
            "+: росстандартом",
            "+: *осст*ндарт#$#"
        ]
    },
    {
        "type": "enter",
        "theme": "Сроки согласования проекта 2",
        "task": "Впишите пропущенное слово строчными буквами",
        "question": "Органы государственного контроля и надзора, которые не являются членами ТК (ПК), согласовывают этот проект в ### срок со дня получения проекта стандарта.",
        "vars": [
            "+: месячный",
            "+: мес*чн#$#"
        ]
    },
    {
        "type": "enter",
        "theme": "Сроки подготовки заключения по проекту 2",
        "task": "Впишите пропущенное слово строчными буквами",
        "question": "Научно-исследовательская организация готовит заключение на проект стандарта, обеспечивает его издательское редактирование, направляет в ТК (ПК) заключение и экземпляр проекта стандарта, прошедшего издательское редактирование, в срок, не превышающий ###со дня получения проекта.",
        "vars": [
            "+: месяца",
            "+: мес*ц#$#"
        ]
    },
    {
        "type": "enter",
        "theme": "Окончательная редакция проекта стандарта 2",
        "task": "Впишите пропущенную цифру",
        "question": "ТК направляет для принятия в Госстандарт России (Госстрой России) проект стандарта (окончательную редакцию) в ###экземплярах.",
        "vars": [
            "+: 3"
        ]
    },
    {
        "type": "enter",
        "theme": "Принятие и государственная регистрация стандарта 2",
        "task": "Впишите пропущенное слово",
        "question": "Госстандарт России рассматривает проект стандарта, принимает его и вводит в действие ### Госстандарта России.",
        "vars": [
            "+: постановлением",
            "+: п*ст*н*влен#$#"
        ]
    },
    {
        "type": "enter",
        "theme": "Разработка изменения к стандарту2",
        "task": "Впишите пропущенную цифру",
        "question": "Проект изменения к стандарту направляют для принятия в Госстандарт России, как правило, не позднее чем за ###месяцев до предполагаемой даты введения изменения в действие.",
        "vars": [
            "+: 9"
        ]
    },
    {
        "type": "enter",
        "theme": "Разработка изменения к стандарту 5",
        "task": "Впишите пропущенную цифру",
        "question": "Каждому вносимому в стандарт изменению Госстандарт России (Госстрой России) присваивает порядковый номер и устанавливает дату введения изменения в действие (как правило, не менее чем через ###месяцев со дня принятия изменения).",
        "vars": [
            "+: 6"
        ]
    },
    {
        "type": "enter",
        "theme": "Разработка изменения к стандарту 6",
        "task": "Впишите пропущенное слово строчными буквами",
        "question": "Информация об изменении к стандарту и текст этого изменения публикуются в информационном указателе «Государственные стандарты Российской Федерации», ###выпускаемом Госстандартом России.",
        "vars": [
            "+: ежемесячно",
            "+: *ж*мес*чн#$#"
        ]
    },
    {
        "type": "enter",
        "theme": "оспрофиль ВОС РФ. Определение правительственного профиля ВОС 2",
        "task": "Впишите завершение определения строчными буквами",
        "question": "Профиль ВОС, который отражает техническую политику государства в области информационной технологии и стремление каждого государства обеспечить соответствие изделий информационной технологии текущим стандартам ISO по взаимодействию открытых систем, называется ###",
        "vars": [
            "+: правительственным",
            "+: пр*вит*льств*нн#$#"
        ]
    },
    {
        "type": "enter",
        "theme": "оспрофиль ВОС РФ. Определение государственного профиля ВОС 2",
        "task": "Впишите завершение определения строчными буквами",
        "question": "Профиль ВОС, который имеет основной целью создание единого информационного пространства России, совместимого с мировым информационным пространством, называется ###",
        "vars": [
            "+: государственным",
            "+: г*сударств*нн#$#"
        ]
    },
    {
        "type": "single",
        "theme": "Взаимодействие ИС 1",
        "task": "Выберите правильный вариант ответа",
        "question": "Точное определение взаимодействия информационных систем дает европейская организация EICTA: Взаимодействие информационных систем это …",
        "vars": [
            "+: возможность двух или более компьютерных сетей, устройств, приложений или компонентов обмениваться информацией между собой и использовать эту информацию.",
            "-: возможность двух или более информационных систем обмениваться информацией между собой и использовать эту информацию."
        ]
    },
    {
        "type": "single",
        "theme": "Взаимодействие ИС 7",
        "task": "Выберите правильный вариант ответа",
        "question": "Взаимодействие информационных систем является главным противовесом для создания фрагментарных национальных решений, которые потенциально не только не дают использовать эффект масштаба и сокращения издержек, но и не дают использовать сетевой эффект для получения …эффекта.",
        "vars": [
            "+: синергетического",
            "-: семантического",
            "-: морфологического"
        ]
    },
    {
        "type": "single",
        "theme": "Стандарты де-юре 2",
        "task": "Выберите правильный вариант ответа",
        "question": "Обеспечить совместимость можно различными путями. Например, установив юридически стандарты, так называемые стандарты...",
        "vars": [
            "+: де-юре",
            "-: де-факто"
        ]
    },
    {
        "type": "single",
        "theme": "Стандарты де-факто 2",
        "task": "Выберите правильный вариант ответа",
        "question": "В последнее время наблюдается тенденция перехода к использованию индустриальных стандартов, так называемых стандартов ...",
        "vars": [
            "+:де-факто",
            "-: де-юре"
        ]
    },
    {
        "type": "single",
        "theme": "Организация IDABC",
        "task": "Выберите правильный вариант ответа",
        "question": "В 2004 г. была создана организация…, задачей которой была разработка нормативов и правил для обмена информацией в Европе.",
        "vars": [
            "+: IDABC",
            "-: IDUBC",
            "-: IMABT",
            "-: IGUVC"
        ]
    },
    {
        "type": "single",
        "theme": "Документ EIF 1",
        "task": "Выберите правильный вариант ответа",
        "question": "Одним из главных результатов работы организации IDABC стала разработка общего подхода к достижению взаимодействия информационных систем, описанного в документе …",
        "vars": [
            "+: EIF",
            "-: EOF",
            "-: MIF",
            "-: EON"
        ]
    },
    {
        "type": "single",
        "theme": "ДокументEIF 2",
        "task": "Выберите правильный вариант ответа",
        "question": "Так как национальные регламентирующие документы не в полной мере учитывают специфики применения аналогичных средств в других странах, то необходим был документ, который позволял бы осуществлять более полное взаимодействие информационных систем на межнациональном уровне. Этим документом стал ...",
        "vars": [
            "+: EIF",
            "-: EOF",
            "-: MIF",
            "-: EON"
        ]
    },
    {
        "type": "single",
        "theme": "Организационная совместимость 2",
        "task": "Выберите правильный вариант ответа",
        "question": "Совместимость бизнес целей и процессов, при помощи которых различные национальные администрации, должны обеспечивать функционирование сервисов электронных правительств называется …совместимостью.",
        "vars": [
            "+:организационной",
            "-: семантической",
            "-: технологической",
            "-: практической"
        ]
    },
    {
        "type": "single",
        "theme": "Семантическая совместимость 2",
        "task": "Выберите правильный вариант ответа",
        "question": "Возможность точного понимания, какая информация содержится в передаваемых сервисами электронных правительств данных, возможно ли точное восприятие этой информации различными приложениями, называется …совместимостью.",
        "vars": [
            "+: Семантической",
            "-: Организационной",
            "-: Технологической",
            "-: Практической"
        ]
    },
    {
        "type": "single",
        "theme": "Технологическая совместимость 2",
        "task": "Выберите правильный вариант ответа",
        "question": "Возможность совместимости собственно информационных систем, включая такие области, как интерфейсы взаимодействия, контроль доступа к информации и обеспечение безопасности, называется …совместимостью.",
        "vars": [
            "+: Технологической",
            "-: Организационной",
            "-: Семантической",
            "-: Практической"
        ]
    },
    {
        "type": "single",
        "theme": "RAND лицензия 1",
        "task": "Выберите правильный вариант ответа",
        "question": "RAND лицензия предоставляется консорциумом W3C компаниям, желающим запатентовать свои продукты. RAND означает, что любые платежи за использование этого патента будут …",
        "vars": [
            "+: законными",
            "-: резонными",
            "-: правильными",
            "-: обоснованными"
        ]
    },
    {
        "type": "single",
        "theme": "ервис-ориентированная архитектура 1",
        "task": "Выберите правильный ответ",
        "question": "Свойством SOA (сервис-ориентированных архитектур) является фактор …",
        "vars": [
            "+: слабого связывания",
            "-: сильного связывания",
            "-: однократности использования",
            "-: нерасширяемости"
        ]
    },
    {
        "type": "single",
        "theme": "ервис-ориентированная архитектура 2",
        "task": "Выберите правильный ответ",
        "question": "Свойством SOA (сервис-ориентированных архитектур) является фактор …",
        "vars": [
            "+: повторного использования",
            "-: однократности использования",
            "-: сильного связывания",
            "-: нерасширяемости"
        ]
    },
    {
        "type": "single",
        "theme": "ервис-ориентированная архитектура 3",
        "task": "Выберите правильный ответ",
        "question": "Свойством SOA (сервис-ориентированных архитектур) является фактор …",
        "vars": [
            "+: расширяемости",
            "-: нерасширяемости",
            "-: однократности использования",
            "-: сильного связывания"
        ]
    },
    {
        "type": "single",
        "theme": "ервис-ориентированная архитектура 6",
        "task": "Выберите правильный вариант ответа",
        "question": "Одним из аспектов концепции слабого связывания SOA (сервис-ориентированных архитектур) является …",
        "vars": [
            "+: виртуализация сервиса",
            "-: локализация сервиса",
            "-: однократность использования",
            "-: сильное связывание"
        ]
    },
    {
        "type": "single",
        "theme": "ервис-ориентированная архитектура 7",
        "task": "Выберите правильный вариант ответа",
        "question": "Одним из аспектов концепции слабого связывания SOA (сервис-ориентированных архитектур) является …",
        "vars": [
            "+: независимость местоположения",
            "-: локализация сервиса",
            "-: расширяемость",
            "-: повторность использования"
        ]
    },
    {
        "type": "many",
        "theme": "заимодействие ИС 2",
        "task": "Выберите правильные варианты ответов",
        "question": "Возможность взаимодействия информационных систем имеет большое значение для всех заинтересованных лиц в цепочке создания ценностей:",
        "vars": [
            "+: для поставщиков содержания и поставщиков сервисов",
            "+: для разработчиков решений",
            "-: для предпринимателей, владеющих небольшим бизнесом",
            "-: для разработчиков оффлайнового ПО"
        ]
    },
    {
        "type": "many",
        "theme": "заимодействие ИС 3",
        "task": "Выберите правильные варианты ответов",
        "question": "Возможность взаимодействия информационных систем имеет большое значение для всех заинтересованных лиц в цепочке создания ценностей:",
        "vars": [
            "+: для поставщиков сетей и аппаратных решений",
            "+: для конечных потребителей",
            "-: для предпринимателей, владеющих небольшим бизнесом",
            "-: для разработчиков оффлайнового ПО"
        ]
    },
    {
        "type": "many",
        "theme": "заимодействие ИС 8",
        "task": "Выберите правильные варианты ответов",
        "question": "В документах EICTA отмечается, что взаимодействие информационных систем оказывает такое положительно влияние на страны Европы, как:",
        "vars": [
            "+: рост конкурентоспособности",
            "+: рост производительности труда",
            "-: рост валового внешнего продукта",
            "-: уменьшение занятости"
        ]
    },
    {
        "type": "many",
        "theme": "заимодействие ИС 9",
        "task": "Выберите правильные варианты ответов",
        "question": "В документах EICTA отмечается, что взаимодействие информационных систем оказывает такое положительно влияние на страны Европы, как:",
        "vars": [
            "+: рост валового внутреннего продукта",
            "+: увеличение занятости",
            "-: рост валового внешнего продукта",
            "-: уменьшение занятости"
        ]
    },
    {
        "type": "many",
        "theme": "Документ EIF 4",
        "task": "Выберите правильные варианты ответов",
        "question": "В соответствии с EIF существует следующие аспекты совместимости информационных систем:",
        "vars": [
            "+: организационная совместимость",
            "+: семантическая совместимость",
            "-: практическая совместимость",
            "-: теоретическая совместимость"
        ]
    },
    {
        "type": "many",
        "theme": "Документ EIF 5",
        "task": "Выберите правильные варианты ответов",
        "question": "В соответствии с EIF существует следующие аспекты совместимости информационных систем:",
        "vars": [
            "+: семантическая совместимость",
            "+: технологическая совместимость",
            "-: практическая совместимость",
            "-: теоретическая совместимость"
        ]
    },
    {
        "type": "many",
        "theme": "Консенсус 1",
        "task": "Выберите правильные варианты ответов",
        "question": "Открытые стандарты это технические спецификации, которые разрабатываются и поддерживаются в рамках открытого процесса, основанного на консенсусе означающем, что:",
        "vars": [
            "+: предлагаемые стандарты рассматриваются рабочей группой, которая учитывает интересы всех сторон: и разработчиков, и пользователей",
            "+: все заинтересованные участники допускаются к обсуждению",
            "-: рассмотрение не включает в себя циклы публичных комментариев к стандартам, и возможны изменения и модификации предлагаемых стандартов",
            "-: процесс принятия решений закрыт и не показывается в свободном доступе"
        ]
    },
    {
        "type": "many",
        "theme": "Консенсус 2",
        "task": "Выберите правильные варианты ответов",
        "question": "Открытые стандарты это технические спецификации, которые разрабатываются и поддерживаются в рамках открытого процесса, основанного на консенсусе означающем, что:",
        "vars": [
            "+: рассмотрение включает в себя циклы публичных комментариев к стандартам, и возможны изменения и модификации предлагаемых стандартов",
            "+: процесс принятия решений прозрачен и решение не может быть вынесено только в пользу какой-то группы",
            "-: предлагаемые стандарты рассматриваются рабочей группой, не учитывая интересов разработчиков",
            "-: к обсуждению допускаются только рабочая группа"
        ]
    },
    {
        "type": "many",
        "theme": "Открытые стандарты 1",
        "task": "Выберите правильные варианты ответов",
        "question": "Открытые стандарты это технические спецификации, которые:",
        "vars": [
            "+: публично доступны",
            "+: рассчитаны на широкое применение",
            "-: технологии принадлежат только одному производителю",
            "-: лицензируются по правилам NAND"
        ]
    },
    {
        "type": "many",
        "theme": "Открытые стандарты  2",
        "task": "Выберите правильные варианты ответов",
        "question": "Открытые стандарты это технические спецификации, которые:",
        "vars": [
            "+: технологически нейтральны по отношению к производителям",
            "+: лицензируются по правилам RAND",
            "-: публично не доступны",
            "-: рассчитаны на узкое применение"
        ]
    },
    {
        "type": "many",
        "theme": "Организации, разрабатывающие открытые стандарты 1",
        "task": "Выберите правильные варианты ответов",
        "question": "Примеры организаций, разрабатывающих открытые стандарты:",
        "vars": [
            "+: ISO",
            "+: ANSI",
            "-: APPLE",
            "-: ADOBE"
        ]
    },
    {
        "type": "many",
        "theme": "Организации, разрабатывающие открытые стандарты 2",
        "task": "Выберите правильные варианты ответов",
        "question": "Примеры организаций, разрабатывающих открытые стандарты:",
        "vars": [
            "+: ETSI",
            "+: IEEE",
            "-: APPLE",
            "-: ADOBE"
        ]
    },
    {
        "type": "many",
        "theme": "Организации, разрабатывающие открытые стандарты3",
        "task": "Выберите правильные варианты ответов",
        "question": "Примеры организаций, разрабатывающих открытые стандарты:",
        "vars": [
            "+: W3C",
            "+: IETF",
            "-: APPLE",
            "-: ADOBE"
        ]
    },
    {
        "type": "many",
        "theme": "Организации, разрабатывающие открытые стандарты4",
        "task": "Выберите правильные варианты ответов",
        "question": "Примеры организаций, разрабатывающих открытые стандарты:",
        "vars": [
            "+: OASIS",
            "+: ISO",
            "-: APPLE",
            "-: ADOBE"
        ]
    },
    {
        "type": "many",
        "theme": "Преимущества открытых стандартов 1",
        "task": "Выберите правильные варианты ответов",
        "question": "Открытые стандарты имеют ряд огромных преимуществ:",
        "vars": [
            "+: не зависят от модели ведения бизнеса производителя решений",
            "+: не являются обязательными для участия в них и их применения",
            "-: не поддерживают совместимость при обеспечении широкого применения и сохранении конкуренции"
        ]
    },
    {
        "type": "many",
        "theme": "Преимущества открытых стандартов 2",
        "task": "Выберите правильные варианты ответов",
        "question": "Открытые стандарты имеют ряд огромных преимуществ:",
        "vars": [
            "+: поддерживают совместимость при обеспечении широкого применения и сохранении конкуренции.",
            "+: не зависят от модели ведения бизнеса производителя решений",
            "-: являются обязательными для участия в них и их применения"
        ]
    },
    {
        "type": "compliance",
        "theme": "Взаимодействие ИС 4",
        "task": "Сделайте соответствие",
        "question": "Возможность взаимодействия информационных систем имеет большое значение для всех заинтересованных лиц в цепочке создания ценностей:",
        "vars": [
            "L1: для поставщиков сервисов",
            "L2: для поставщиков сетей и аппаратных решений",
            "L3: для конечных потребителей",
            "L4: для разработчиков прикладного ПО",
            "R1: это возможность достичь максимально возможной аудитории",
            "R2: это возможность иметь максимально не фрагментированный рынок и возможность производить унифицированные решения",
            "R3: это возможность использовать информацию из максимально большого числа источников, вне зависимости от того, на каких устройствах и при помощи каких программных средств эта информация создана",
            "R4:"
        ]
    },
    {
        "type": "compliance",
        "theme": "Взаимодействие ИС 5",
        "task": "Сделайте соответствие",
        "question": "Возможность взаимодействия информационных систем имеет большое значение для всех заинтересованных лиц в цепочке создания ценностей:",
        "vars": [
            "L1: для поставщиков сетей и аппаратных решений",
            "L2: для конечных потребителей",
            "L3: для поставщиков содержания и поставщиков сервисов",
            "L4: для разработчиков прикладного ПО",
            "R1: это возможность иметь максимально не фрагментированный рынок и возможность производить унифицированные решения",
            "R2: это возможность использовать информацию из максимально большого числа источников, вне зависимости от того, на каких устройствах и при помощи каких программных средств эта информация создана",
            "R3: это возможность достичь максимально возможной аудитории",
            "R4:"
        ]
    },
    {
        "type": "enter",
        "theme": "Взаимодействие ИС 6",
        "task": "Впишите пропущенное слово строчными буквами",
        "question": "Взаимодействие информационных систем является главным противовесом для создания фрагментарных национальных решений, которые потенциально не только не дают использовать эффект масштаба и сокращения издержек, но и не дают использовать сетевой эффект для получения ### эффекта.",
        "vars": [
            "+: синергетического",
            "+: с*н*рг*тич*ск#$#"
        ]
    },
    {
        "type": "enter",
        "theme": "Стандарты де-юре 1",
        "task": "Впишите пропущенное слово строчными буквами",
        "question": "Обеспечить совместимость можно различными путями. Например, установив юридически стандарты, так называемые стандарты ###.",
        "vars": [
            "+: де-юре",
            "+: д**юр#$#"
        ]
    },
    {
        "type": "enter",
        "theme": "Стандарты де-факто 1",
        "task": "Впишите пропущенное слово строчными буквами",
        "question": "В последнее время наблюдается тенденция перехода к использованию индустриальных стандартов, так называемых стандартов ###.",
        "vars": [
            "+: де-факто",
            "+: д**факт#$#"
        ]
    },
    {
        "type": "compliance",
        "theme": "Подходы к взаимодействию информационных систем 1",
        "task": "Сделайте соответствие",
        "question": "К моменту начала создания документа EIF во многих европейских странах уже существовали свои подходы к взаимодействию информационных систем:",
        "vars": [
            "L1: в Германии это был…",
            "L2: в Дании это был…",
            "L3: в Великобритании это был…",
            "L4: в Японии это был …",
            "R1: SAGA",
            "R2: Reference Profile",
            "R3: e-GIF",
            "R4:"
        ]
    },
    {
        "type": "enter",
        "theme": "Документ EIF 3",
        "task": "Впишите пропущенную цифру",
        "question": "В соответствии с EIF существует ### аспекта совместимости информационных систем.",
        "vars": [
            "+: 3"
        ]
    },
    {
        "type": "enter",
        "theme": "Организационная совместимость 1",
        "task": "Впишите пропущенное слово строчными буквами",
        "question": "Совместимость бизнес целей и процессов, при помощи которых различные национальные администрации, должны обеспечивать функционирование сервисов электронных правительств называется ### совместимостью.",
        "vars": [
            "+: организационной",
            "+:*рган*з*ц*он#$#"
        ]
    },
    {
        "type": "enter",
        "theme": "Семантическая совместимость 1",
        "task": "Впишите пропущенное слово строчными буквами",
        "question": "Возможность точного понимания, какая информация содержится в передаваемых сервисами электронных правительств данных, возможно ли точное восприятие этой информации различными приложениями, называется ### совместимостью.",
        "vars": [
            "+:семантической",
            "+:c*м*нтич*ск#$#"
        ]
    },
    {
        "type": "enter",
        "theme": "Технологическая совместимость 1",
        "task": "Впишите пропущенное слово строчными буквами",
        "question": "Возможность совместимости собственно информационных систем, включая такие области, как интерфейсы взаимодействия, контроль доступа к информации и обеспечение безопасности, называется ### совместимостью.",
        "vars": [
            "+: технологической",
            "+: т*хн*л*гическ#$#"
        ]
    },
    {
        "type": "compliance",
        "theme": "Документ EIF 6",
        "task": "Сделайте соответствие",
        "question": "В соответствии с EIF существует три аспекта совместимости информационных систем:",
        "vars": [
            "L1: организационная совместимость",
            "L2: семантическая совместимость",
            "L3: технологической совместимостью",
            "R1: Совместимость бизнес целей и процессов, при помощи которых различные национальные администрации, должны обеспечивать функционирование сервисов электронных правительств называется …",
            "R2: Возможность точного понимания, какая информация содержится в передаваемых сервисами электронных правительств данных, возможно ли точное восприятие этой информации различными приложениями, называется …",
            "R3: Возможность совместимости собственно информационных систем, включая такие области, как интерфейсы взаимодействия, контроль доступа к информации и обеспечение безопасности, называется …"
        ]
    },
    {
        "type": "enter",
        "theme": "RAND лицензия 2",
        "task": "Впишите пропущенное слово строчными буквами",
        "question": "RAND лицензия предоставляется консорциумом W3C компаниям, желающим запатентовать свои продукты. RAND означает, что любые платежи за использование этого патента будут «резонными». Другими словами, эти платежи не являются###.",
        "vars": [
            "+: дискриминационными",
            "+: д*скр*м*н*ц*он#$#"
        ]
    },
    {
        "type": "compliance",
        "theme": "Организации, разрабатывающие открытые стандарты5",
        "task": "Установите соответствие",
        "question": "Сопоставьте названия и описания организаций, разрабатывающих открытые стандарты",
        "vars": [
            "L1: ISO",
            "L2: ANSI",
            "L3: ETSI",
            "L4: IETF",
            "R1: международная организация по стандартизации",
            "R2: частная некоммерческая организация, которая администрирует и координирует систему стандартизации США",
            "R3: Европейская организация по стандартизации в области информационно телекоммуникационных систем",
            "R4:"
        ]
    },
    {
        "type": "compliance",
        "theme": "Организации, разрабатывающие открытые стандарты7",
        "task": "Сделайте соответствие",
        "question": "Сопоставьте названия и описания организаций, разрабатывающих открытые стандарты",
        "vars": [
            "L1:W3C",
            "L2: IETF",
            "L3: ISO",
            "R1: международная организация, разрабатывающая протоколы и стандарты для Интернета (самые известные их стандарты – HTML, HTTP, URL)",
            "R2: международная организация, разрабатывающая стандарты в области архитектуры Интернета (наиболее известный стандарт – TCP/IP)",
            "R3:"
        ]
    },
    {
        "type": "compliance",
        "theme": "Организации, разрабатывающие открытые стандарты8",
        "task": "Сделайте соответствие",
        "question": "Сопоставьте названия и описания организаций, разрабатывающих открытые стандарты",
        "vars": [
            "L1: OASIS",
            "L2: ANSI",
            "L3: ISO",
            "R1: международная организация, разрабатывающая различные открытые стандарты (SAML и WSS)",
            "R2: частная некоммерческая организация, которая администрирует и координирует систему стандартизации США",
            "R3:"
        ]
    },
    {
        "type": "compliance",
        "theme": "Сервис-ориентированная архитектура 4",
        "task": "Поставьте соответствие между факторами SOA (сервис-ориентированной архитектуры) и их описаниями",
        "question": "",
        "vars": [
            "L1: Слабое связывание",
            "L2: Расширяемость",
            "L4:",
            "R1: Устраняет жесткие связи, препятствующие изменениям",
            "R2: Делает SOA-решения доступными организациям любого размера",
            "R3: Делает процессы более согласованными, поскольку они базируются на одних и тех же компонентах"
        ]
    },
    {
        "type": "compliance",
        "theme": "Сервис-ориентированная архитектура 5",
        "task": "Поставьте соответствие между факторами SOA (сервис-ориентированной архитектуры) и их описаниями",
        "question": "",
        "vars": [
            "L1: Слабое связывание",
            "L2: Расширяемость",
            "L3: Повторность использования",
            "L4:",
            "R1: Позволяет делать меньше вложений в реализацию и больше в повторное использование",
            "R2: Способствует повышению качества благодаря конкуренции между провайдерами сервисов",
            "R3: Изменяет процесс разработки на более динамичный и подходящий для ведения бизнеса",
            "R4: Взаимная совместимость всех технических и программных средств внутри РФ и на международном уровне"
        ]
    },
    {
        "type": "single",
        "theme": "Гипервизор 2",
        "task": "Выберите правильный вариант ответа",
        "question": "Система отслеживания деятельности виртуальной машины называется ...",
        "vars": [
            "+: гипервизором",
            "-: монитором",
            "-: дисплеем",
            "-: большим братом"
        ]
    },
    {
        "type": "single",
        "theme": "Виртуализация 2",
        "task": "Выберите правильный вариант ответа",
        "question": "VMware предлагает надежную платформу для виртуализации, масштабируемую вплоть до включения …материальных компьютеров и устройств хранения.",
        "vars": [
            "+: сотен",
            "-: десятков",
            "-: тысяч",
            "-: миллионов"
        ]
    },
    {
        "type": "single",
        "theme": "Виртуализация 3",
        "task": "Выберите правильный вариант ответа",
        "question": "Впервые технологию виртуализации применила компания IBM более … лет назад в качестве методики логического разделения ресурсов ЭВМ наотдельные виртуальные машины.",
        "vars": [
            "+: 30",
            "-: 20",
            "-: 10",
            "-: 40"
        ]
    },
    {
        "type": "single",
        "theme": "Виртуализация 5",
        "task": "Выберите правильный вариант ответа",
        "question": "Впервые технологию виртуализации применила компания …более 30  лет назад в качестве методики логического разделения ресурсов ЭВМ наотдельные виртуальные машины.",
        "vars": [
            "+: IBM",
            "-: Intel",
            "-: Apple",
            "-: Microsoft"
        ]
    },
    {
        "type": "single",
        "theme": "Виртуализация 6",
        "task": "Выберите правильный вариант ответа",
        "question": "В1990-хгодах компания… , преодолев множество сложностей в процессе разработки, создала технологию виртуализации компьютеров на базе x86, призванную устранить проблемы незадействованных в работе ресурсов.",
        "vars": [
            "+: VMware",
            "-: Adobe",
            "-: Foxit",
            "-: Valve"
        ]
    },
    {
        "type": "single",
        "theme": "Виртуальная инфраструктура 3",
        "task": "Выберите правильный вариант ответа",
        "question": "По сути, виртуальная инфраструктура представляет собой …распределение физических ресурсов в соответствии с потребностями предприятия.",
        "vars": [
            "+: динамическое",
            "-: правильное",
            "-: быстрое",
            "-: активное"
        ]
    },
    {
        "type": "single",
        "theme": "Виртуализация ресурсов",
        "task": "Выберите правильный ответ",
        "question": "Термином «зонирование» обозначают …",
        "vars": [
            "+: разделение ресурсов",
            "-: трансляцию сетевых адресов (NAT)",
            "-: кластеризацию компьютеров",
            "-: частичную виртуализацию"
        ]
    },
    {
        "type": "single",
        "theme": "Виртуализация информационных систем",
        "task": "Выберите правильный ответ",
        "question": "Способность виртуальных машин выполнять любое программное обеспечение под управлением любой стандартной операционной системы, называется ...",
        "vars": [
            "+: совместимостью",
            "-: изолированностью",
            "-: инкапсуляцией",
            "-: независимостью от оборудования"
        ]
    },
    {
        "type": "single",
        "theme": "Виртуализация информационных систем",
        "task": "Выберите правильный ответ",
        "question": "Способность виртуальных машин использовать физические ресурсы одного и того же компьютера и функционировать независимо друг от друга, как отдельные физические машины, называется ...",
        "vars": [
            "+: изолированностью",
            "-: совместимостью",
            "-: инкапсуляцией",
            "-: независимостью от оборудования"
        ]
    },
    {
        "type": "single",
        "theme": "Виртуализация информационных систем",
        "task": "Выберите правильный ответ",
        "question": "Способность виртуальной машины представлять собой программный контейнер, связывающий полный комплект виртуальных аппаратных ресурсов, а также операционную систему и все её приложения, называется ...",
        "vars": [
            "+: инкапсуляцией",
            "-: совместимостью",
            "-: изолированностью",
            "-: независимостью от оборудования"
        ]
    },
    {
        "type": "single",
        "theme": "Виртуализация информационных систем",
        "task": "Выберите правильный ответ",
        "question": "Возможность задать виртуальной машине настройки, абсолютно не совпадающие с физическими характеристиками базового аппаратного обеспечения, называется ...",
        "vars": [
            "+: независимостью от оборудования",
            "-: совместимостью",
            "-: изолированностью",
            "-: инкапсуляцией"
        ]
    },
    {
        "type": "single",
        "theme": "иртуализация платформ 1",
        "task": "Выберите правильный ответ",
        "question": "Под виртуализацией платформ понимают создание программных систем на основе …",
        "vars": [
            "+: существующих аппаратно-программных комплексов, зависящих или независящих от них",
            "-: существующих аппаратных комплексов, зависящих от них",
            "-: существующих программных комплексов, независящих от них",
            "-: существующих аппаратно-программных комплексов, независящих от них"
        ]
    },
    {
        "type": "single",
        "theme": "иртуализация платформ 2",
        "task": "Выберите правильный ответ",
        "question": "Система, предоставляющая аппаратные ресурсы и программное обеспечение виртуальной машине, называется …",
        "vars": [
            "+: хостовой",
            "-: серверной",
            "-: клиентской",
            "-: гостевой"
        ]
    },
    {
        "type": "single",
        "theme": "иртуализация платформ 3",
        "task": "Выберите правильный ответ",
        "question": "Виды виртуализации платформ зависят от того, насколько полно осуществляется симуляция … обеспечения.",
        "vars": [
            "+: аппаратного",
            "-: программного",
            "-: аппаратно-программного"
        ]
    },
    {
        "type": "single",
        "theme": "иртуализация платформ7",
        "task": "Выберите правильный ответ",
        "question": "Виртуальная машина полностью виртуализует все аппаратное обеспечение с сохранением гостевой операционной системы в неизменном виде при ...",
        "vars": [
            "+: полной эмуляции",
            "-: частичной эмуляции",
            "-: нативной виртуализации",
            "-: эмуляции адресного пространства"
        ]
    },
    {
        "type": "single",
        "theme": "иртуализация платформ8",
        "task": "Выберите правильный ответ",
        "question": "Машина виртуализует лишь необходимое количество аппаратного обеспечения, чтобы она могла быть запущена изолированно, в случае ...",
        "vars": [
            "+: частичной эмуляции",
            "-: полной эмуляции",
            "-: симуляции",
            "-: частичной виртуализации"
        ]
    },
    {
        "type": "single",
        "theme": "иртуализация платформ11",
        "task": "Выберите правильный ответ",
        "question": "Машина виртуализует лишь необходимое количество аппаратного обеспечения, чтобы она могла быть запущена изолированно, в случае ...",
        "vars": [
            "+: нативной виртуализации",
            "-: полной эмуляции",
            "-: симуляции",
            "-: частичной виртуализации"
        ]
    },
    {
        "type": "single",
        "theme": "иртуализация платформ 16",
        "task": "Выберите правильный ответ",
        "question": "Связующим звеном между гостевыми системами и аппаратурой, существенно увеличивающим быстродействие платформы, приближая его к быстродействию физической платформы, является …",
        "vars": [
            "+: гипервизор",
            "-: супервизор",
            "-: мультивизор",
            "-: монитор"
        ]
    },
    {
        "type": "single",
        "theme": "иртуализация платформ 18",
        "task": "Выберите правильный ответ",
        "question": "К минусам частичной эмуляции можно отнести зависимость виртуальных машин от архитектуры аппаратной платформы …",
        "vars": [
            "+: виртуальных машин от архитектуры аппаратной платформы",
            "-: гостевых систем от архитектуры аппаратной платформы",
            "-: виртуальных машин от архитектуры операционной системы",
            "-: гостевых систем от архитектуры операционной системы"
        ]
    },
    {
        "type": "single",
        "theme": "иртуализация платформ22",
        "task": "Выберите правильный ответ",
        "question": "Виртуальная машина симулирует несколько экземпляров аппаратного окружения (но не всего), в частности, пространства адресов при …",
        "vars": [
            "+: частичной виртуализации",
            "-: полной эмуляции",
            "-: частичной эмуляции",
            "-: эмуляции адресного пространства"
        ]
    },
    {
        "type": "single",
        "theme": "иртуализация платформ23",
        "task": "Выберите правильный ответ",
        "question": "Частичная виртуализация …",
        "vars": [
            "+: позволяет совместно использовать ресурсы и изолировать процессы",
            "-: позволяет изолировать процессы",
            "-: позволяет совмещать ресурсы",
            "-: не позволяет совмещать ресурсы"
        ]
    },
    {
        "type": "single",
        "theme": "иртуализация платформ24",
        "task": "Выберите правильный ответ",
        "question": "Частичная виртуализация …",
        "vars": [
            "+: не позволяет разделять экземпляры гостевых операционных систем",
            "-: не позволяет совместно использовать ресурсы и изолировать процессы",
            "-: не позволяет совместно использовать ресурсы",
            "-: позволяет разделять экземпляры гостевых систем"
        ]
    },
    {
        "type": "single",
        "theme": "иртуализация платформ25",
        "task": "Выберите правильный ответ",
        "question": "При частичной виртуализации на уровне операционной системы происходит ….",
        "vars": [
            "+: изоляция каких-либо процессов",
            "-: изоляция каких-либо ресурсов",
            "-: объединение потоков параллельно выполняемых процессов"
        ]
    },
    {
        "type": "single",
        "theme": "иртуализация платформ26",
        "task": "Выберите правильный ответ",
        "question": "Специальный программный интерфейс APIиспользуется для взаимодействия с гостевой операционной системойпри ...",
        "vars": [
            "+: паравиртуализации",
            "-: полной эмуляции",
            "-: симуляции",
            "-: частичной эмуляции"
        ]
    },
    {
        "type": "single",
        "theme": "иртуализация платформ28",
        "task": "Выберите правильный ответ",
        "question": "Паравиртуализация требует …",
        "vars": [
            "+: модификации кода гостевой системы",
            "-: изоляции процессов на уровне операционной системы",
            "-: разделения экземпляров гостевых операционных систем",
            "-: все варианты верны"
        ]
    },
    {
        "type": "single",
        "theme": "иртуализация платформ29",
        "task": "Выберите правильный ответ",
        "question": "Гипервизор используется в подходах …",
        "vars": [
            "+: паравиртуализации",
            "-: полной эмуляции",
            "-: симуляции",
            "-: нигде из перечисленных вариантов"
        ]
    },
    {
        "type": "single",
        "theme": "Виртуализация уровня ОС 1",
        "task": "Выберите правильный ответ",
        "question": "Виртуализация физического сервера на уровне операционной системы в целях создания нескольких защищенных виртуализованных серверов на одном физическом является сутью ...",
        "vars": [
            "+: виртуализации уровня операционной системы",
            "-: паравиртуализации",
            "-: симуляции",
            "-: частичной эмуляции"
        ]
    },
    {
        "type": "single",
        "theme": "Виртуализация уровня ОС 2",
        "task": "Выберите правильный ответ",
        "question": "Виртуализация физического сервера на уровне операционной системы в целях создания нескольких защищенных виртуализованных серверов на одном физическом является сутью ...",
        "vars": [
            "+: виртуализации уровня операционной системы",
            "-: полной эмуляции",
            "-: виртуализации адресного пространства",
            "-: частичной виртуализации"
        ]
    },
    {
        "type": "single",
        "theme": "Виртуализация платформ 32",
        "task": "Выберите правильный ответ",
        "question": "Гостевая система в случае виртуализации операционной системы …",
        "vars": [
            "+: разделяет использование одного ядра хостовой операционной системы с другими гостевыми системами",
            "-: создаёт новое ядро для хостовой операционной системы",
            "-: создаёт новое ядро для каждой из гостевых систем"
        ]
    },
    {
        "type": "single",
        "theme": "Виртуализация платформ 33",
        "task": "Выберите правильный ответ",
        "question": "Разделение использования ядра хостовой операционной системы свойственно подходу …",
        "vars": [
            "+: виртуализации операционной системы",
            "-: паравиртуализации",
            "-: полной эмуляции",
            "-: частичной эмуляции"
        ]
    },
    {
        "type": "single",
        "theme": "Виртуализация платформ 34",
        "task": "Выберите правильный ответ",
        "question": "В случае виртуализации уровня операционной системы виртуальная машина представляет собой окружение для приложений, запускаемых …",
        "vars": [
            "+: изолированно",
            "-: последовательно",
            "-: совместно",
            "-: нет верного ответа"
        ]
    },
    {
        "type": "single",
        "theme": "Виртуализация платформ 35",
        "task": "Выберите правильный ответ",
        "question": "Помещение приложения в контейнер вместе с необходимыми для работы элементами (файлами реестра, конфигурационными файлами, пользовательскими и системными объектами) свойственно подходу ...",
        "vars": [
            "+: виртуализации уровня приложений",
            "-: виртуализации уровня операционной системы",
            "-: симуляции",
            "-: эмуляции"
        ]
    },
    {
        "type": "single",
        "theme": "Виртуализация платформ 36",
        "task": "Выберите правильный ответ",
        "question": "Помещение приложения в контейнер вместе с необходимыми для работы элементами (файлами реестра, конфигурационными файлами, пользовательскими и системными объектами) свойственно подходу …",
        "vars": [
            "+: виртуализации уровня приложений",
            "-: паравиртуализации",
            "-: нативной виртуализации",
            "-: полной эмуляции"
        ]
    },
    {
        "type": "single",
        "theme": "Виртуализация платформ 37",
        "task": "Выберите правильный ответ",
        "question": "Помещение приложения в контейнер вместе с необходимыми для работы элементами (файлами реестра, конфигурационными файлами, пользовательскими и системными объектами) свойственно подходу …",
        "vars": [
            "+: виртуализации уровня приложений",
            "-: виртуализации адресного пространства",
            "-: частичной эмуляции",
            "-: частичной виртуализации"
        ]
    },
    {
        "type": "single",
        "theme": "Виртуализация платформ 38",
        "task": "Выберите правильный ответ",
        "question": "В случае виртуализации уровня приложения получается приложение,…",
        "vars": [
            "+: не требующее установки на аналогичной платформе",
            "-: устанавливаемое на жёсткий диск рабочей станции"
        ]
    },
    {
        "type": "single",
        "theme": "Виртуализация платформ 39",
        "task": "Выберите правильный ответ",
        "question": "В случае виртуализации уровня приложения при переносе полученного приложения на другую машину и его запуске виртуальное окружение, созданное для программы, разрешает конфликты между …",
        "vars": [
            "+: программой и операционной системой, а также другими приложениями",
            "-: программой и операционной системой",
            "-: программой и другими приложениями",
            "-: нет верного варианта"
        ]
    },
    {
        "type": "single",
        "theme": "Виртуализация ресурсов 9",
        "task": "Выберите правильный ответ",
        "question": "В сетях хранения данных термином «зонирование» обозначают …",
        "vars": [
            "-: инкапсуляцию",
            "-: трансляцию сетевых адресов (NAT), позволяющая создавать виртуальные пространства сетевых адресов и имен",
            "-: кластеризацию компьютеров и распределённые вычисления",
            "+: разделение ресурсов"
        ]
    },
    {
        "type": "single",
        "theme": "Виртуализация ресурсов 11",
        "task": "Выберите правильный ответ",
        "question": "В сетях хранения данных термином «зонирование» обозначают …",
        "vars": [
            "+: разделение ресурсов",
            "-: агрегацию компонентов",
            "-: объединение компонентов",
            "-: концентрацию компонентов"
        ]
    },
    {
        "type": "single",
        "theme": "Виртуализация ресурсов 12",
        "task": "Выберите правильный ответ",
        "question": "Инкапсуляция - это…",
        "vars": [
            "+: сокрытие объектом внутри себя своей реализации",
            "-: разделение ресурсов",
            "-: объединение компонентов",
            "-: трансляция сетевых адресов (NAT), позволяющая создавать виртуальные пространства сетевых адресов и имен"
        ]
    },
    {
        "type": "single",
        "theme": "Виртуализация ресурсов 14",
        "task": "Выберите правильный ответ",
        "question": "Процесс создания системы, предоставляющей пользователю удобный интерфейс для работы с ней и скрывающей подробности сложности своей реализации, называется …",
        "vars": [
            "+: инкапсуляцией",
            "-: разделением ресурсов",
            "-: объединением компонентов",
            "-: трансляцией сетевых адресов"
        ]
    },
    {
        "type": "many",
        "theme": "Проблемы  ИТ-инфраструктуры 90-ых1",
        "task": "Выберите правильные варианты ответов",
        "question": "Развитие серверов и настольных ПК на базе x86 привело к появлению новой ИТ-инфраструктуры и новых проблем, например:",
        "vars": [
            "+: неэффективное использование ресурсов инфраструктуры",
            "+: повышение затрат на физическую инфраструктуру",
            "-: снижение расходов на управление ИТ"
        ]
    },
    {
        "type": "many",
        "theme": "Проблемы  ИТ-инфраструктуры 90-ых2",
        "task": "Выберите правильные варианты ответов",
        "question": "Развитие серверов и настольных ПК на базе x86 привело к появлению новой ИТ-инфраструктуры и новых проблем, например:",
        "vars": [
            "+: увеличение расходов на управление ИТ",
            "+: недостаточно надежная система аварийного восстановления и защиты в критических ситуациях",
            "-: увеличение расходов на управление ИС"
        ]
    },
    {
        "type": "many",
        "theme": "Преимущества виртуальных машин 1",
        "task": "Выберите правильные варианты ответов",
        "question": "Виртуальные машины обладают следующими основными преимуществами для пользователя:",
        "vars": [
            "+: совместимость",
            "+: изолированность",
            "-: большая вычислительная мощность",
            "-: простота освоения"
        ]
    },
    {
        "type": "many",
        "theme": "Преимущества виртуальных машин 2",
        "task": "Выберите правильные варианты ответов",
        "question": "Виртуальные машины обладают следующими основными преимуществами для пользователя:",
        "vars": [
            "+: инкапсуляция",
            "+: независимость от оборудования",
            "-: большая вычислительная мощность",
            "-: простота освоения"
        ]
    },
    {
        "type": "many",
        "theme": "Основные причины внедрения ПО для виртуализации 1",
        "task": "Выберите правильные варианты ответов",
        "question": "Основные причины внедрения ПО для виртуализации:",
        "vars": [
            "+: сокращение расходов на физическую инфраструктуру",
            "+: консолидация серверов и оптимизация инфраструктуры",
            "-: понижение гибкости и скорости реагирования системы",
            "-: понижение доступности приложений и обеспечение непрерывности работы предприятия"
        ]
    },
    {
        "type": "many",
        "theme": "Основные причины внедрения ПО для виртуализации 2",
        "task": "Выберите правильные варианты ответов",
        "question": "Основные причины внедрения ПО для виртуализации:",
        "vars": [
            "+: повышение гибкости и скорости реагирования системы",
            "+: повышение доступности приложений и обеспечение непрерывности работы",
            "-: понижение гибкости и скорости реагирования системы"
        ]
    },
    {
        "type": "many",
        "theme": "Виртуальная инфраструктура 6",
        "task": "Выберите правильные варианты ответов",
        "question": "Виртуальная инфраструктура включает в себя следующие компоненты:",
        "vars": [
            "+: гипервизоры для одного узла для полной виртуализации каждого компьютера",
            "+: пакет услуг инфраструктуры на основе виртуализации",
            "-: виртуальные машины"
        ]
    },
    {
        "type": "many",
        "theme": "Виртуальная инфраструктура 7",
        "task": "Выберите правильные варианты ответов",
        "question": "Виртуальная инфраструктура включает в себя следующие компоненты:",
        "vars": [
            "+: решения для автоматизации",
            "+: пакет услуг инфраструктуры распределенных систем на основе виртуализации",
            "-: виртуальные машины"
        ]
    },
    {
        "type": "many",
        "theme": "Виртуальная инфраструктура 8",
        "task": "Выберите правильные варианты ответов",
        "question": "Благодаря отделению всей программной среды от исходной аппаратной инфраструктуры виртуализация позволяет объединить ряд …в единый пул ресурсов.",
        "vars": [
            "+: серверов",
            "+: инфраструктур хранения",
            "+: сетей",
            "-: мониторов"
        ]
    },
    {
        "type": "many",
        "theme": "Преимущества виртуальной инфраструктуры 2",
        "task": "Выберите правильные варианты ответов",
        "question": "Преимущества виртуальной инфраструктуры:",
        "vars": [
            "+: введение в работу новых приложений занимает всего несколько минут",
            "+: время на восстановление системы после незапланированного простоя сокращается на 85%",
            "-: использование 100–120% ресурсов серверов",
            "-: ежегодная экономия более 100 000 долларов США на каждую виртуализированную рабочую нагрузку"
        ]
    },
    {
        "type": "many",
        "theme": "Виртуализация ресурсов",
        "task": "Выберите правильные ответы",
        "question": "Примеры виртуализации – это …",
        "vars": [
            "+: многопроцессорные системы, представляющиеся как одна мощная система",
            "+: RAID-массивы",
            "-: организация сетей с использованием протокола Ethernet"
        ]
    },
    {
        "type": "many",
        "theme": "Виртуализация ресурсов",
        "task": "Выберите правильные ответы",
        "question": "Пример виртуализации – это …",
        "vars": [
            "+: виртуальные частные сети (VPN)",
            "+: трансляция сетевых адресов (NAT)",
            "-: организация сетей с использованием протокола Ethernet"
        ]
    },
    {
        "type": "many",
        "theme": "Виртуализация ресурсов",
        "task": "Выберите правильные ответы",
        "question": "Примеры виртуализации – это …",
        "vars": [
            "+: виртуальный частные сети (VPN)",
            "+: RAID-массивы",
            "-: организация сетей с использованием протокола Ethernet"
        ]
    },
    {
        "type": "many",
        "theme": "Виртуализация ресурсов",
        "task": "Выберите правильные ответы",
        "question": "Пример виртуализации – это …",
        "vars": [
            "+: средства комбинирования нескольких физических дисков в один логический",
            "+: виртуальные частные сети (VPN)",
            "+: трансляция сетевых адресов (NAT)",
            "-: организация сетей с использованием протокола Ethernet"
        ]
    },
    {
        "type": "many",
        "theme": "иртуализация платформ5",
        "task": "Выберите правильные варианты ответа",
        "question": "Виртуальная машина полностью виртуализует все аппаратное обеспечение с сохранением гостевой операционной системы в неизменном видепри ....",
        "vars": [
            "+: полной эмуляции",
            "+: симуляции",
            "-: частичной эмуляции",
            "-: частичной симуляции"
        ]
    },
    {
        "type": "many",
        "theme": "иртуализация платформ 19",
        "task": "Выберите правильные варианты ответа",
        "question": "При … виртуальная машина симулирует несколько экземпляров аппаратного окружения (но не всего), в частности, пространства адресов.",
        "vars": [
            "+: частичной виртуализации",
            "+: виртуализации адресного пространства",
            "-: симуляция",
            "-: нативная эмуляция"
        ]
    },
    {
        "type": "many",
        "theme": "иртуализация платформ30",
        "task": "Выберите правильные варианты ответа",
        "question": "Гипервизор используют подходы …",
        "vars": [
            "+: паравиртуализации",
            "+: частичной эмуляции",
            "-: симуляции",
            "-: частичной виртуализации"
        ]
    },
    {
        "type": "many",
        "theme": "иртуализация платформ31",
        "task": "Выберите правильные варианты ответа",
        "question": "API-вызовы к гостевой системе в случае паравиртуализации называются …",
        "vars": [
            "+: гипервызовами",
            "+: супервызовами",
            "-: мультивызовами",
            "-: поливызовами"
        ]
    },
    {
        "type": "many",
        "theme": "Виртуализация ресурсов 1",
        "task": "Выберите правильные ответы",
        "question": "Виртуализация ресурсов позволяет … управление группами ресурсов таких как сети, хранилища данных и пространства имен.",
        "vars": [
            "+: концентрировать",
            "+: абстрагировать",
            "+: упрощать",
            "-: разделять"
        ]
    },
    {
        "type": "many",
        "theme": "Виртуализация ресурсов 2",
        "task": "Выберите правильные ответы",
        "question": "Виртуализация ресурсов позволяет концентрировать управление группами ресурсов таких как …",
        "vars": [
            "+: сети",
            "+: хранилища данных",
            "+: пространства имен",
            "-: кванты процессорного времени",
            "-: физическая память"
        ]
    },
    {
        "type": "many",
        "theme": "Виртуализация ресурсов 3",
        "task": "Выберите правильные ответы",
        "question": "Виртуализация ресурсов позволяет абстрагировать управление группами ресурсов таких как …",
        "vars": [
            "+: сети",
            "+: хранилища данных",
            "+: пространства имен",
            "-: кванты процессорного времени",
            "-: физическая память"
        ]
    },
    {
        "type": "many",
        "theme": "Виртуализация ресурсов 4",
        "task": "Выберите правильные ответы",
        "question": "Виртуализация ресурсов позволяет упрощать управление группами ресурсов таких как …",
        "vars": [
            "+: сети",
            "+: хранилища данных",
            "+: пространства имен",
            "-: кванты процессорного времени",
            "-: физическая память"
        ]
    },
    {
        "type": "many",
        "theme": "Виртуализация ресурсов 5",
        "task": "Выберите правильные ответы",
        "question": "Организация нескольких физических или логических объектов в пулы ресурсов (группы), представляющих удобные интерфейсы пользователю, осуществляется засчёт … компонентов.",
        "vars": [
            "+: объединения",
            "+: агрегации",
            "+: концентрации",
            "-: дублирования",
            "-: разделения"
        ]
    },
    {
        "type": "many",
        "theme": "Виртуализация ресурсов 6",
        "task": "Выберите правильные ответы",
        "question": "Пример(ы) виртуализации с использованием объединения, агрегации и концентрации компонентов – это …",
        "vars": [
            "+: многопроцессорные системы, представляющиеся как одна мощная система",
            "+: RAID-массивы и средства управления томами, комбинирующие несколько физических дисков в один логический",
            "+: построение сетей хранения данных SAN (StorageAreaNetwork)",
            "-: организация сетей с использованием протокола Ethernet"
        ]
    },
    {
        "type": "many",
        "theme": "Виртуализация ресурсов 7",
        "task": "Выберите правильные ответы",
        "question": "Пример(ы) виртуализации с использованием объединения, агрегации и концентрации компонентов – это …",
        "vars": [
            "+: виртуальные частные сети (VPN)",
            "+: трансляция сетевых адресов (NAT), позволяющая создавать виртуальные пространства сетевых адресов и имен",
            "+: RAID-массивы и средства управления томами",
            "-: организация сетей с использованием протокола Ethernet"
        ]
    },
    {
        "type": "enter",
        "theme": "Виртуализация 1",
        "task": "Впишите пропущенное слово строчными буквами",
        "question": "Возможность одного компьютера выполнять работу нескольких компьютеров благодаря распределению его ресурсов по нескольким средам называется ###",
        "vars": [
            "+: виртуализацией",
            "+: в*рту*л*зац#$#"
        ]
    },
    {
        "type": "enter",
        "theme": "Гипервизор 1",
        "task": "Вставьте пропущенное слово строчными буквами",
        "question": "Система отслеживания деятельности виртуальной машины называется ###.",
        "vars": [
            "+: гипервизором",
            "+: гип*рв*з*р#$#"
        ]
    },
    {
        "type": "enter",
        "theme": "Виртуализация 4",
        "task": "Впишите пропущенную цифру",
        "question": "Впервые технологию виртуализации применила компания IBM более ###лет назад в качестве методики логического разделения ресурсов ЭВМ наотдельные виртуальные машины.",
        "vars": [
            "+: 30"
        ]
    },
    {
        "type": "compliance",
        "theme": "Преимущества виртуальных машин 3",
        "task": "Сделайте соответствие",
        "question": "Виртуальные машины обладают следующими основными преимуществами для пользователя:",
        "vars": [
            "L1: совместимость",
            "L2: изолированность",
            "L3: инкапсуляция",
            "R1: виртуальная машина работает под управлением собственной гостевой оперативной системы и выполняет собственные приложения. Она также содержит все компоненты, стандартные для физического компьютера.",
            "R2: виртуальные машины могут использовать общие физические ресурсы одного компьютера и при этом оставаться полностью независимыми  друг от друга",
            "R3:"
        ]
    },
    {
        "type": "compliance",
        "theme": "Преимущества виртуальных машин 4",
        "task": "Сделайте соответствие",
        "question": "Виртуальные машины обладают следующими основными преимуществами для пользователя:",
        "vars": [
            "L1: инкапсуляция",
            "L2: независимость от оборудования",
            "L3: совместимость",
            "R1: Виртуальная машина представляет собой программный контейнер, связывающий полный комплект виртуальных аппаратных ресурсов, а также ОС и все её приложения в программном пакете.",
            "R2: Виртуальные машины полностью работоспособны вне зависимости от мощности оборудования.",
            "R3:"
        ]
    },
    {
        "type": "enter",
        "theme": "Виртуальная инфраструктура 1",
        "task": "Впишите пропущенное слово строчными буквами",
        "question": "Виртуальная машина использует аппаратные ресурсы одного компьютера, а виртуальная ###–все объединенные аппаратные ресурсы.",
        "vars": [
            "+: инфраструктура",
            "+: *нфр*структур#$#"
        ]
    },
    {
        "type": "enter",
        "theme": "Виртуальная машина",
        "task": "Впишите пропущенное слово строчными буквами",
        "question": "Виртуальная ###использует аппаратные ресурсы одного компьютера, а виртуальная инфраструктура –все объединенные аппаратные ресурсы.",
        "vars": [
            "+: машина",
            "+: м*шин#$#"
        ]
    },
    {
        "type": "enter",
        "theme": "Виртуальная инфраструктура 2",
        "task": "Впишите пропущенное слово строчными буквами",
        "question": "По сути, виртуальная инфраструктура представляет собой ###распределение физических ресурсов в соответствии с потребностями предприятия.",
        "vars": [
            "+: динамическое",
            "+: д*н*мич*ск#$#"
        ]
    },
    {
        "type": "enter",
        "theme": "Виртуальная инфраструктура 4",
        "task": "Впишите пропущенное слово строчными буквами",
        "question": "Виртуальная машина использует материальные ресурсы одного компьютера, а виртуальная инфраструктура – материальные ресурсы всей ИТ-###",
        "vars": [
            "+: среды",
            "+: сред#$#"
        ]
    },
    {
        "type": "enter",
        "theme": "Виртуализация ресурсов",
        "task": "Впишите пропущенное слово строчными буквами",
        "question": "Разделение ресурсов обозначают термином ###.",
        "vars": [
            "+: зонирование",
            "+: з*нир*ван#$#"
        ]
    },
    {
        "type": "enter",
        "theme": "Виртуализация информационных систем",
        "task": "Впишите завершение определения строчными буквами",
        "question": "Способность виртуальных машин выполнять любое программное обеспечение под управлением любой стандартной операционной системы, называется ###",
        "vars": [
            "+: совместимостью",
            "+: с*вместим*ст#$#"
        ]
    },
    {
        "type": "enter",
        "theme": "Виртуализация информационных систем",
        "task": "Впишите завершение определения строчными буквами",
        "question": "Способность виртуальных машин использовать физические ресурсы одного и того же компьютера и функционировать независимо друг от друга, как отдельные физические машины, называется ###",
        "vars": [
            "+: изолированностью",
            "+: *з*лир*в*н#$#"
        ]
    },
    {
        "type": "enter",
        "theme": "Виртуализация информационных систем",
        "task": "Впишите завершение определения строчными буквами",
        "question": "Способность виртуальной машины представлять собой программный контейнер, связывающий полный комплект виртуальных аппаратных ресурсов, а также операционную систему и все её приложения, называется ###",
        "vars": [
            "+: инкапсуляцией",
            "+: *нк*пс*ляц#$#"
        ]
    },
    {
        "type": "enter",
        "theme": "Виртуализация информационных систем",
        "task": "Впишите завершение определения строчными буквами",
        "question": "Возможность задать виртуальной машине настройки, абсолютно не совпадающие с физическими характеристиками базового аппаратного обеспечения, называется ###",
        "vars": [
            "+: независимостью",
            "+: н*з*вис*м#$#"
        ]
    },
    {
        "type": "enter",
        "theme": "Виртуализация платформ 2",
        "task": "Впишите завершение определения строчными буквами",
        "question": "Система, предоставляющая аппаратные ресурсы и программное обеспечение виртуальной машине, называется ###",
        "vars": [
            "+: хостовой",
            "+: хост*в#$#"
        ]
    },
    {
        "type": "enter",
        "theme": "Виртуализация платформ 4",
        "task": "Впишите пропущенное слово строчными буквами",
        "question": "Виды виртуализации платформ зависят от того, насколько полно осуществляется симуляция ### обеспечения.",
        "vars": [
            "+: аппаратного",
            "+: *пп*ратн#$#"
        ]
    },
    {
        "type": "enter",
        "theme": "Виртуализация платформ 6",
        "task": "Завершите пропущенное слово строчными буквами",
        "question": "Виртуальная машина полностью виртуализует все аппаратное обеспечение с сохранением гостевой операционной системы в неизменном виде при ###",
        "vars": [
            "+: симуляции",
            "+: с*муляц#$#"
        ]
    },
    {
        "type": "enter",
        "theme": "Виртуализация платформ 9",
        "task": "Впишите пропущенное слово строчными буквами",
        "question": "Машина виртуализует лишь необходимое количество аппаратного обеспечения, чтобы она могла быть запущена изолированно, в случае ### эмуляции.",
        "vars": [
            "+: частичной",
            "+: ч*стичн#$#"
        ]
    },
    {
        "type": "enter",
        "theme": "Виртуализация платформ 10",
        "task": "Впишите пропущенное слово строчными буквами",
        "question": "Машина виртуализует лишь необходимое количество аппаратного обеспечения, чтобы она могла быть запущена изолированно, в случае частичной ###.",
        "vars": [
            "+: эмуляции",
            "+: *муляц#$#"
        ]
    },
    {
        "type": "enter",
        "theme": "Виртуализация платформ 12",
        "task": "Впишите пропущенное слово строчными буквами",
        "question": "Виртуальная машина виртуализует лишь необходимое количество аппаратного обеспечения, чтобы она могла быть запущена изолированно, в случае ### виртуализации.",
        "vars": [
            "+: нативной",
            "+: н*тивн#$#"
        ]
    },
    {
        "type": "enter",
        "theme": "Виртуализация платформ 13",
        "task": "Впишите пропущенное слово строчными буквами",
        "question": "Машина виртуализует лишь необходимое количество аппаратного обеспечения, чтобы она могла быть запущена изолированно, в случае нативной###.",
        "vars": [
            "+: виртуализации",
            "+: в*ртуал*зац#$#"
        ]
    },
    {
        "type": "enter",
        "theme": "Виртуализация платформ 17",
        "task": "Впишите завершение определения строчными буквами",
        "question": "Связующим звеном между гостевыми системами и аппаратурой, существенно увеличивающим быстродействие платформы, приближая его к быстродействию физической платформы, является ###",
        "vars": [
            "+: гипервизор",
            "+: гип*рвиз*р#$#"
        ]
    },
    {
        "type": "enter",
        "theme": "Виртуализация платформ 20",
        "task": "Впишите пропущенное слово строчными буквами",
        "question": "Виртуальная машина симулирует несколько экземпляров аппаратного окружения (но не всего), в частности, пространства адресов, в случае частичной ###",
        "vars": [
            "+: виртуализации",
            "+: в*рту*л*зац#$#"
        ]
    },
    {
        "type": "enter",
        "theme": "Виртуализация платформ 21",
        "task": "Впишите пропущенное слово строчными буквами",
        "question": "Виртуальная машина симулирует несколько экземпляров аппаратного окружения (но не всего), в частности, пространства адресов, в случае ### виртуализации.",
        "vars": [
            "+: частичной",
            "+: ч*стичн#$#"
        ]
    },
    {
        "type": "enter",
        "theme": "Виртуализация платформ 27",
        "task": "Впишите пропущенное слово строчными буквами",
        "question": "Специальный программный интерфейс APIиспользуется для взаимодействия с гостевой операционной системойпри ###.",
        "vars": [
            "+: паравиртуализации",
            "+: пар*в*рту*л*зац#$#"
        ]
    },
    {
        "type": "enter",
        "theme": "Гипервызов",
        "task": "Завершите определение строчными буквами",
        "question": "API-вызовы к гостевой системе в случае паравиртуализации называются ###",
        "vars": [
            "+: гипервызовами",
            "+: супервызовами",
            "+: гип*рвыз*в#$#",
            "+: суп*рвыз*в#$#"
        ]
    },
    {
        "type": "compliance",
        "theme": "Виртуализация ресурсов 8",
        "task": "Поставьте соответствия видов виртуализации ресурсов и их описаний",
        "question": "",
        "vars": [
            "L1: Объединение, агрегация, концентрация",
            "L2: Кластеризация компьютеров и распределенные вычисления",
            "L3: Разделение ресурсов",
            "L4:",
            "R1: Организация нескольких физических или логических объектов в пулы ресурсов (группы), представляющих удобные интерфейсы пользователю",
            "R2: Техники, применяемые при объединении множества отдельных компьютеров в глобальные системы (метакомпьютеры), совместно решающие общую задачу",
            "R3: Разделение какого-либо одного большого ресурса на несколько однотипных объектов, удобных для использования",
            "R4: Сокрытие объектом внутри себя своей реализации"
        ]
    },
    {
        "type": "enter",
        "theme": "Виртуализация ресурсов 10",
        "task": "Впишите пропущенное слово строчными буквами",
        "question": "В сетях хранения данных разделение ресурсов – это ###",
        "vars": [
            "+: зонирование",
            "+: з*нир*ванн#$#"
        ]
    },
    {
        "type": "enter",
        "theme": "Виртуализация ресурсов 13",
        "task": "Завершите определение строчными буквами",
        "question": "Сокрытие объектом внутри себя своей реализации – это ###",
        "vars": [
            "+: инкапсуляция",
            "+: *нк*псуляц#$#"
        ]
    },
    {
        "type": "enter",
        "theme": "Виртуализация ресурсов 15",
        "task": "Впишите завершение определения строчными буквами",
        "question": "Процесс создания системы, предоставляющей пользователю удобный интерфейс для работы с ней и скрывающей подробности сложности своей реализации, называется ###",
        "vars": [
            "+: инкапсуляцией",
            "+: *нк*псуляц#$#"
        ]
    },
    {
        "type": "single",
        "theme": "Облачные вычисления 2",
        "task": "Выберите правильный вариант ответа",
        "question": "Модель обеспечения повсеместного и удобного сетевого доступа по требованию к общему пулу конфигурируемых вычислительных ресурсов называется … вычислениями",
        "vars": [
            "+: облачными",
            "-:  небесными",
            "-:  удалёнными",
            "-:  заказными"
        ]
    },
    {
        "type": "single",
        "theme": "История и эволюция облачных технологий 1",
        "task": "Выберите правильный вариант ответа",
        "question": "Первой компанией, в полной мере осознавшей коммерческую перспективу общедоступных технологий виртуализации, стала …",
        "vars": [
            "+: Amazon",
            "-: Apple",
            "-:  Adobe",
            "-:  Mozilla"
        ]
    },
    {
        "type": "single",
        "theme": "История и эволюция облачных технологий 2",
        "task": "Выберите правильный вариант ответа",
        "question": "Если до … года виртуализация понималась преимущественно как возможность развернуть нужное количество виртуальных серверов на собственном оборудовании, то благодаря появлению Amazon Elastic Compute Cloud в привычку вошла идея аренды виртуальных серверов на чужом оборудовании.",
        "vars": [
            "+:2006",
            "-: 2001",
            "-:2000",
            "-: 2010"
        ]
    },
    {
        "type": "single",
        "theme": "Этапы развития облачных технологий 1",
        "task": "Выберите правильный вариант ответа",
        "question": "Согласно модели, предложенной Gartner, облачные вычисления будут развиваться в …этапа, частично совпадающих друг со другом по времени.",
        "vars": [
            "+: три",
            "-: четыре",
            "-: два"
        ]
    },
    {
        "type": "single",
        "theme": "Сервис SpotCloud1",
        "task": "Выберите правильный вариант ответа",
        "question": "Впервые сервис аренды части вычислительных мощностей Spot Cloud был запущен в феврале 2011 года компанией …",
        "vars": [
            "+: Enomaly",
            "-: HP",
            "-: Apple",
            "-: Google"
        ]
    },
    {
        "type": "single",
        "theme": "СервисSpotCloud2",
        "task": "Выберите правильный вариант ответа",
        "question": "Впервые сервис аренды части вычислительных мощностей… был запущен в феврале 2011 года компанией Enomaly.",
        "vars": [
            "+: Spot Cloud",
            "-: iCloud",
            "-: Google Cloud",
            "-: McCloud"
        ]
    },
    {
        "type": "single",
        "theme": "Облачные вычисления 2",
        "task": "Вставьте пропущенное слово строчными буквами",
        "question": "«Облака» представляют собой такое внедрение облачных вычислений, при котором часть системы размещается в публичном «облаке», т.е. на базе дата-центров облачного провайдера, а часть – в приватном «облаке», т.е. на серверах, принадлежащих самой компании называются …",
        "vars": [
            "+: Гибридными",
            "-:  Совмещёнными",
            "-:  Публично-приватными",
            "-:  Приватно-публичными"
        ]
    },
    {
        "type": "single",
        "theme": "Облачные вычисления 4",
        "task": "Выберите правильный вариант ответа",
        "question": "В последнее время крупнейшие облачные компании активно перестраивают свою стратегию с учетом «гибридизации» облачных вычислений. Так, …планирует развиваться путем создания сообщества партнеров и поставщиков, сервисы которых будут интегрироваться с облачной платформой.",
        "vars": [
            "+: Amazon Web Services",
            "-: Google",
            "-: Apple",
            "-: Adobe"
        ]
    },
    {
        "type": "single",
        "theme": "Облачные вычисления 5",
        "task": "Выберите правильный вариант ответа",
        "question": "В рамках стратегии развития облачных вычислений Microsoft недавно добавила возможность помещения самостоятельно сформированных образов виртуальных машин в «облаке» …",
        "vars": [
            "+: Windows Azure",
            "-: Windows Safe",
            "-: WindowsBrake",
            "-: WindowsInsurance"
        ]
    },
    {
        "type": "single",
        "theme": "ПродуктыIaaS 1",
        "task": "Выберите правильный вариант ответа",
        "question": "Инфраструктура как сервис сокращённо обозначается как:",
        "vars": [
            "+: IaaS",
            "-: PaaS",
            "-: SaaS",
            "-: ZaaS"
        ]
    },
    {
        "type": "single",
        "theme": "AWS 1",
        "task": "Выберите правильный вариант ответа",
        "question": "Наиболееизвестное и наиболее успешное предложение класса IaaS - …",
        "vars": [
            "+: Amazon Web Services",
            "-: W3C",
            "-: Apple",
            "-: Microsoft"
        ]
    },
    {
        "type": "single",
        "theme": "AWS 2",
        "task": "Выберите правильный вариант ответа",
        "question": "Несмотря на то, что бренд AWS был представлен еще в 2002 году,фактически AWS в современном виде существует с …года, когда были анонсированы сервисы ElasticComputeCloud (EC2) и SimpleStorageService (S3).",
        "vars": [
            "+: 2006",
            "-: 2005",
            "-: 2004",
            "-: 2003"
        ]
    },
    {
        "type": "single",
        "theme": "Rackspace Cloud 2",
        "task": "Выберите правильный вариант ответа",
        "question": "Интересным шагом Rackspace как поставщика облачных сервисов стал запуск платформы с открытым…, предназначенной для создания публичных и приватных IaaS-инфраструктур.",
        "vars": [
            "+: Open Stack",
            "-: Open Source",
            "-: Open Cloud",
            "-: Open Rack"
        ]
    },
    {
        "type": "single",
        "theme": "Rackspace Cloud3",
        "task": "Выберите правильный вариант ответа",
        "question": "В основу Open Stack были положены как собственные наработки…, так и некоторые результаты проектов, выполненных по заказу NASA.",
        "vars": [
            "+: Rackspace",
            "-: AWS",
            "-: Microsoft",
            "-: Apple"
        ]
    },
    {
        "type": "single",
        "theme": "Rackspace Cloud 4",
        "task": "Выберите правильный вариант ответа",
        "question": "В основу Open Stack были положены как собственные наработки Rackspace, так и некоторые результаты проектов, выполненных…, впоследствии присоединившаяся к Rackspace.",
        "vars": [
            "+: Anso Labs",
            "-: Aperture Labs",
            "-: Abstergo Ind.",
            "-: Umbrella Labs"
        ]
    },
    {
        "type": "single",
        "theme": "RackspaceCloud7",
        "task": "Выберите правильный вариант ответа",
        "question": "Rackspace также предлагает облачную услугу…, которая позволяет добавлять доступные вычислительные ресурсы по мере увеличения нагрузки на сайт.",
        "vars": [
            "+: Cloud Sites",
            "-: Cloud Hosting",
            "-: Cloud Load",
            "-: Cloud Secure"
        ]
    },
    {
        "type": "single",
        "theme": "Rackspace Cloud 7",
        "task": "Выберите правильный вариант ответа",
        "question": "Созданная в 2009 году швейцарская компания …предлагает простое решение, позволяющие добавлять и убавлять ресурсы, доступные отдельно взятой виртуальной машине.",
        "vars": [
            "+: Cloud Sigma",
            "-: Cloud Beta",
            "-: Cloud Alpha",
            "-: Cloud Gamma"
        ]
    },
    {
        "type": "single",
        "theme": "Российский IaaS 1",
        "task": "Выберите правильный вариант ответа",
        "question": "Некоторые провайдеры, например, … , предлагают возможность вынесения в «облако» корпоративной инфраструктуры.",
        "vars": [
            "+: Parking",
            "-: Corbina",
            "-: Lanta",
            "-: Yota"
        ]
    },
    {
        "type": "single",
        "theme": "Российский IaaS 3",
        "task": "Выберите правильный вариант ответа",
        "question": "К преимуществам отечественных облачных провайдеров относится возможность …",
        "vars": [
            "+: увеличивать и уменьшать количество доступной оперативной памяти и дискового пространства",
            "-: получать высококвалифицированную техническую поддержку",
            "-: работать с российскими платёжными системами"
        ]
    },
    {
        "type": "single",
        "theme": "РоссийскийIaaS4",
        "task": "Выберите правильный вариант ответа",
        "question": "К преимуществам отечественных облачных провайдеров относится возможность …",
        "vars": [
            "+: платить только лишь за фактически использованное процессорное время",
            "-: получать высококвалифицированную техническую поддержку",
            "-: работать с российскими платёжными системами"
        ]
    },
    {
        "type": "single",
        "theme": "Российский IaaS 5",
        "task": "Выберите правильный вариант ответа",
        "question": "Провайдер…отходит от общей модели: необходимо платить за дисковое пространство, израсходованное выше нормы, а также за процессорное время.",
        "vars": [
            "+: ISP Server",
            "-: Selectel",
            "-: Corbina",
            "-: Lanta"
        ]
    },
    {
        "type": "single",
        "theme": "РоссийскийIaaS7",
        "task": "Выберите правильный вариант ответа",
        "question": "Провайдер…отходит от общей модели: реализована чрезвычайно гранулированная система учета вычислительных ресурсов, в рамках которой подсчитывается не только процессорное время и объем ОЗУ, но и нагрузка на сеть, количество дисковых операций, объем занятого дискового пространства, объем информации, записанной на диск или прочитанной с диска.",
        "vars": [
            "+: Selectel",
            "-: ISP Server",
            "-: Corbina",
            "-: Lanta"
        ]
    },
    {
        "type": "single",
        "theme": "Продукты SaaS 1",
        "task": "Выберите правильный вариант ответа",
        "question": "Наиболее зрелые коммерческие предложения сегмента SaaSсегоднясвязаны с корпоративной электронной почтой и системами автоматизациибизнеса:",
        "vars": [
            "+: CRM, ERP",
            "-:  SRM, UPR",
            "-: CRD, URF",
            "-: SFD, ERF"
        ]
    },
    {
        "type": "single",
        "theme": "ПродуктыSaaS 2",
        "task": "Выберите правильный вариант ответа",
        "question": "Из всех облачных решений только …-приложения непосредственно доступны конечному пользователю.",
        "vars": [
            "+: SaaS",
            "-: PaaS",
            "-: IaaS",
            "-: ZaaS"
        ]
    },
    {
        "type": "single",
        "theme": "Продукты SaaS 3",
        "task": "Выберите правильный вариант ответа",
        "question": "Отечественное SaaS-решение …является альтернативой коммерческим услугам от специалистов, занимающихся поисковой оптимизацией веб-сайтов.",
        "vars": [
            "+: SeoPult",
            "-: SeoManager",
            "-: SeoControl",
            "-: SeoHandling"
        ]
    },
    {
        "type": "single",
        "theme": "Электронная почта и коммуникации 1",
        "task": "Выберите правильный вариант ответа",
        "question": "Один из старейших видов SaaS-приложений - …",
        "vars": [
            "+: Электронная почта",
            "-: ICQ",
            "-: IRC",
            "-: Торренттрекер"
        ]
    },
    {
        "type": "single",
        "theme": "Электронная почта и коммуникации 4",
        "task": "Выберите правильный вариант ответа",
        "question": "Вероятно в недалеком будущем полноценную интеграцию Office 365 с IP-телефонией реализует и Microsoft, которая недавно приобрела самого известного провайдера IP-телефонии…",
        "vars": [
            "+: Skype",
            "-: Steam",
            "-: Speak",
            "-: Scooma"
        ]
    },
    {
        "type": "single",
        "theme": "SaaS для автоматизации бизнеса 1",
        "task": "Выберите правильный вариант ответа",
        "question": "SaaS-системы занимают устойчивые позиции в сфере корпоративных решенийкласса CRM и ERP. Они особенно выгодны в условиях быстро растущего малого и среднего бизнеса, так как …",
        "vars": [
            "+: SaaS-решением можно начать пользоваться сразу после оплаты",
            "-: SaaS-решения крайне дёшевы",
            "-: SaaS-решения крайне удобны",
            "-: SaaS-решения подходят только самым богатым предприятиям"
        ]
    },
    {
        "type": "single",
        "theme": "SaaS для автоматизации бизнеса2",
        "task": "Выберите правильный вариант ответа",
        "question": "Признанным мировым лидером в области CRM является …",
        "vars": [
            "+: Salesforce.com",
            "-: Salesmight.com",
            "-: Tradeforce.com",
            "-: Trademight.com"
        ]
    },
    {
        "type": "single",
        "theme": "SaaS для автоматизации бизнеса4",
        "task": "Выберите правильный вариант ответа",
        "question": "Microsoft активно продвигает собственное CRM-решение …",
        "vars": [
            "+: Dynamics CRM",
            "-: On-crm",
            "-: qCRM",
            "-: MicroCRM"
        ]
    },
    {
        "type": "single",
        "theme": "Office 365 2",
        "task": "Выберите правильный вариант ответа",
        "question": "Летом ### года Microsoft официально анонсировала Office 365 – единоеоблачное предложение, содержащее настольный пакет Office,а также инструменты для совместной работы.",
        "vars": [
            "+: 2011",
            "-: 2010",
            "-: 2012",
            "-: 2009"
        ]
    },
    {
        "type": "single",
        "theme": "Office 365 6",
        "task": "Выберите правильный вариант ответа",
        "question": "Важная особенность сервисов Office365 – ими можно пользоваться не только с помощью обыкновенных ПК, но и с…",
        "vars": [
            "+: мобильных устройств",
            "-: калькуляторов",
            "-: холодильников",
            "-: микроволновых печей"
        ]
    },
    {
        "type": "single",
        "theme": "ПродуктыPaaS 1",
        "task": "Выберите правильный вариант ответа",
        "question": "Решения …позволяют упростить разработку и развертывание масштабируемых веб-приложений и сэкономить трудозатраты программистов.",
        "vars": [
            "+: PaaS",
            "-: SaaS",
            "-: IaaS",
            "-: ZaaS"
        ]
    },
    {
        "type": "single",
        "theme": "Продукты PaaS 2",
        "task": "Выберите правильный вариант ответа",
        "question": "Облачные решения класса PaaS– относительно новое направление, старт которому был дан в …годах, когда компания Salesforce.com представила сервис Force.com, а Google– платформу Google App Engine.",
        "vars": [
            "+: 2007–2008",
            "-: 2005–2007",
            "-: 2003–2005",
            "-: 2000–2003"
        ]
    },
    {
        "type": "single",
        "theme": "Этапы развития рынка облачных вычислений",
        "task": "Выберите правильный ответ",
        "question": "Внедрение облачных вычислений компаниями, готовыми идти на риски, произошло во время этапа, называемого ...",
        "vars": [
            "+: временем первопроходцев",
            "-: консолидацией рынка",
            "-: массовым распространением"
        ]
    },
    {
        "type": "single",
        "theme": "Этапы развития рынка облачных вычислений",
        "task": "Выберите правильный ответ",
        "question": "Этап, характеризуемый растущим спросом пользователей, ростом конкуренции и снижением числа поставщиков, называется ...",
        "vars": [
            "+: консолидацией рынка",
            "-: этапом первопроходцев",
            "-: массовым распространением"
        ]
    },
    {
        "type": "single",
        "theme": "Этапы развития рынка облачных вычислений",
        "task": "Выберите правильный ответ",
        "question": "Этап, в течение которого облачные вычисления становятся мэйнстримом и на рынке доминирует ограниченное число поставщиков, называется ...",
        "vars": [
            "+: массовым распространением",
            "-: этапом первопроходцев",
            "-: консолидацией рынка"
        ]
    },
    {
        "type": "single",
        "theme": "Определение транзакции",
        "task": "Выберите правильный ответ",
        "question": "Транзакция - это …",
        "vars": [
            "+: совокупность операций",
            "-: передача данных",
            "-: совокупность протоколов",
            "-: совокупность данных"
        ]
    },
    {
        "type": "many",
        "theme": "Разновидности предоставления приложений в режиме услуг 1",
        "task": "Выберите правильные варианты ответов",
        "question": "Существует следующие разновидности предоставления приложений в режиме услуг:",
        "vars": [
            "+: IaaS",
            "+: SaaS",
            "+: PaaS",
            "-: ZaaS"
        ]
    },
    {
        "type": "many",
        "theme": "Достоинства и недостатки облачных технологий 1",
        "task": "Выберите правильные варианты ответов",
        "question": "К положительным качествам облачных технологий можно отнести следующие:",
        "vars": [
            "+: экологичность",
            "+: ресурсы доступны одновременно нескольким пользователям",
            "-: высокая рентабельность",
            "-: простота внедрения"
        ]
    },
    {
        "type": "many",
        "theme": "Достоинства и недостатки облачных технологий 2",
        "task": "Выберите правильные варианты ответов",
        "question": "К положительным качествам облачных технологий можно отнести следующие:",
        "vars": [
            "+:  владельцы приватных «облаков» смогут в периоды простоя предоставлять свои вычислительные мощности в аренду на открытом рынке",
            "+: ресурсы доступны одновременно нескольким",
            "-: высокая рентабельность",
            "-: простота внедрения"
        ]
    },
    {
        "type": "many",
        "theme": "Достоинства и недостатки облачных технологий5",
        "task": "Выберите правильные варианты ответов",
        "question": "Недостатками облачных технологий можно считать следующие их особенности:",
        "vars": [
            "+: если облачный поставщик обанкротится или вдруг начнет диктовать пользователям неприемлемые условия, то последним будет некуда деваться",
            "+: облачные сервисы работают на неконтролируемых компьютерах",
            "-: нет успешных бизнес-моделей использования облачных вычислений",
            "-: слабо развитый рынок"
        ]
    },
    {
        "type": "many",
        "theme": "Достоинства и недостатки облачных технологий 6",
        "task": "Выберите правильные варианты ответов",
        "question": "Недостатками облачных технологий можно считать следующие их особенности:",
        "vars": [
            "+: при пользовании облачными сервисами онихранятся на удаленных серверах",
            "+: облачные сервисы работают на неконтролируемых компьютерах и потому чрезвычайно ограничивают возможности изучения программы в работе",
            "-: нет успешных бизнес-моделей использования облачных вычислений.",
            "-: слабо развитый рынок."
        ]
    },
    {
        "type": "many",
        "theme": "Облачные вычисления 3",
        "task": "Выберите правильные варианты ответов",
        "question": "Достоинствами гибридных облаков являются:",
        "vars": [
            "+:  гибридная модель позволяет избежать «революций»: те приложения или части систем, которые не могут быть вынесены в публичное «облако» останутся во внутренней сети",
            "+: гибридные «облака» позволяют избежать проблем, связанных с потерей контроля над ключевыми данными",
            "+: гибридная модель позволит заказчикам интегрировать публичные облачные сервисы от разных поставщиков",
            "-: хорошо  развитый рынок"
        ]
    },
    {
        "type": "many",
        "theme": "AWS 4",
        "task": "Выберите правильные варианты ответов",
        "question": "Несмотря на то, что бренд AWS был представлен еще в 2002 году,фактически AWS в современном виде существует с 2006года, когда были анонсированы сервисы:",
        "vars": [
            "+: EC2",
            "+: S3",
            "-: E3",
            "-: W3C"
        ]
    },
    {
        "type": "many",
        "theme": "Российский IaaS 2",
        "task": "Выберите правильные варианты ответов",
        "question": "К преимуществам отечественных облачных провайдеров относится возможность …",
        "vars": [
            "+: увеличивать и уменьшать количество доступной оперативной памяти и дискового пространства",
            "+: платить только лишь за фактически использованное процессорное время",
            "-: получать высококвалифицированную техническую поддержку",
            "-: работать с российскими платёжными системами"
        ]
    },
    {
        "type": "many",
        "theme": "РоссийскийIaaS 6",
        "task": "Выберите правильные варианты ответов",
        "question": "Провайдер ISP Server отходит от общей модели: необходимо платить …",
        "vars": [
            "+:  а дисковое пространство, израсходованное выше нормы",
            "+: за процессорное время",
            "-: за техподдержку",
            "-: за ускорение подключения сверх тарифа"
        ]
    },
    {
        "type": "many",
        "theme": "РоссийскийIaaS 8",
        "task": "Выберите правильные варианты ответов",
        "question": "Оператор Selectel реализовал чрезвычайно гранулированную систему учета вычислительных ресурсов, в рамках которой подсчитывается не только процессорное время и объем ОЗУ, но и…",
        "vars": [
            "+: нагрузка на сеть",
            "+: количество дисковых операций",
            "-: техподдержка",
            "-: ускорение подключения сверх тарифа"
        ]
    },
    {
        "type": "many",
        "theme": "Российский IaaS 9",
        "task": "Выберите правильные варианты ответов",
        "question": "Оператор Selectel реализовал чрезвычайно гранулированную систему учета вычислительных ресурсов, в рамках которой подсчитывается не только процессорное время и объем ОЗУ, но и …",
        "vars": [
            "+: объем занятого дискового пространства",
            "+: объем информации, записанной на диск или прочитанной с диска.",
            "-: ускорение подключения сверх тарифа",
            "-: техподдержку"
        ]
    },
    {
        "type": "many",
        "theme": "Электронная почта и коммуникации 2",
        "task": "Выберите правильные варианты ответов",
        "question": "Преимущества корпоративной электронной почты по модели SaaS вполне очевидны: организации не нужно …",
        "vars": [
            "+: поддерживать собственный почтовый сервер",
            "+: вырабатывать собственную политику борьбы со спамом и вирусами",
            "+: администрировать системы",
            "-: создавать собственную информационную инфраструктуру",
            "-: приобретать программное обеспечение"
        ]
    },
    {
        "type": "many",
        "theme": "SaaSдляавтоматизациибизнеса3",
        "task": "Выберите правильные варианты ответов",
        "question": "В России наиболее распространёнными решениями в области CRM являются …",
        "vars": [
            "+: Asoft CRM",
            "+: qCRM",
            "+: On-crm",
            "-: CeReMonia"
        ]
    },
    {
        "type": "many",
        "theme": "Office 365 3",
        "task": "Выберите правильные варианты ответов",
        "question": "Летом 2011 года Microsoft официально анонсировала Office 365. Развернутое решение не требует …",
        "vars": [
            "+: обслуживания со стороны штатных ИТ-специалистов",
            "+: расходов на дорогое серверное оборудование",
            "-: денег за лицензию"
        ]
    },
    {
        "type": "many",
        "theme": "ffice 3654",
        "task": "Выберите правильные варианты ответов",
        "question": "Базовые компоненты Office 365, входящие во все сервисные планы – это …",
        "vars": [
            "+: система для организации электронной почты, календарей и контактов",
            "+: система публикации документов и организации внутреннего документооборота",
            "-: система редактирования векторной и растровой графики",
            "-: система профессиональной обработки и монтажа видео"
        ]
    },
    {
        "type": "many",
        "theme": "ffice 365 5",
        "task": "Выберите правильные варианты ответов",
        "question": "Базовые компоненты Office 365, входящие во все сервисные планы – это …",
        "vars": [
            "+: система объединенных коммуникаций",
            "+: онлайновые аналоги знакомых приложений MicrosoftOffice",
            "-: система редактирования векторной и растровой графики",
            "-: система профессиональной обработки и монтажа видео"
        ]
    },
    {
        "type": "enter",
        "theme": "Облачные вычисления 1",
        "task": "Впишите пропущенное слово строчными буквами",
        "question": "Модель обеспечения повсеместного и удобного сетевого доступа по требованию к общему пулу конфигурируемых вычислительных ресурсов называется ### вычислениями",
        "vars": [
            "+: облачными",
            "+: обл*чн#$#"
        ]
    },
    {
        "type": "enter",
        "theme": "История и эволюция облачных технологий 3",
        "task": "Впишите пропущенную цифру",
        "question": "Если до ### года виртуализация понималась преимущественно как возможность развернуть нужное количество виртуальных серверов на собственном оборудовании, то благодаря появлению Amazon Elastic Compute Cloud в привычку вошла идея аренды виртуальных серверов на чужом оборудовании.",
        "vars": [
            "+:2006"
        ]
    },
    {
        "type": "compliance",
        "theme": "Разновидности предоставления приложений в режиме услуг2",
        "task": "Сделайте соответствие",
        "question": "Виртуальные машины обладают следующими основными преимуществами дляпользователя:",
        "vars": [
            "L1: IaaS",
            "L2: SaaS",
            "R1: инфраструктура как сервис",
            "R2: программное обеспечение как сервис"
        ]
    },
    {
        "type": "compliance",
        "theme": "Разновидности предоставления приложений в режиме услуг3",
        "task": "Сделайте соответствие",
        "question": "Виртуальные машины обладают следующими основными преимуществами для пользователя:",
        "vars": [
            "L1: PaaS",
            "L2: SaaS",
            "R1: платформа как сервис",
            "R2: программное обеспечение как сервис"
        ]
    },
    {
        "type": "compliance",
        "theme": "Этапы развития облачных технологий 2",
        "task": "Сделайте соответствие",
        "question": "Согласно модели, предложенной Gartner, облачные вычисления будут развиваться следующим образом:",
        "vars": [
            "L1: Первый этап",
            "L2: Второй  этап",
            "L3: Третий этап",
            "R1: время первопроходцев и период формирования рынка",
            "R2: консолидация рынка",
            "R3: накопление критической массы и массовое распространение облачных технологий",
            "R4: Повсеместный переход на облачные вычисления"
        ]
    },
    {
        "type": "compliance",
        "theme": "Этапы развития облачных технологий 3",
        "task": "Сделайте соответствие",
        "question": "К положительным качествам облачных технологий можно отнести следующие:",
        "vars": [
            "L1: экологичность",
            "L2: ресурсы доступны одновременно нескольким пользователям",
            "L3: высокая рентабельность",
            "R1: По мнению сторонников этой аргументации, облачные вычисления не только позволят сэкономить на используемом оборудовании, но и повысят эффективность использования вычислительных мощностей в расчете на киловатт-час.",
            "R2: Это позволяет добиться существенной экономии и оптимизировать ресурсные затраты в публичных облачных средах. Но необходимым условием для такой оптимизации является наличие пользователей с разными графиками загрузки ИТ-ресурсов.",
            "R3:"
        ]
    },
    {
        "type": "compliance",
        "theme": "Этапы развития облачных технологий 4",
        "task": "Сделайте соответствие",
        "question": "К положительным качествам облачных технологий можно отнести следующие:",
        "vars": [
            "L1: экологичность",
            "L2: владельцы приватных «облаков» смогут в периоды простоя предоставлять свои вычислительные мощности в аренду на открытом рынке",
            "L3: высокая рентабельность",
            "R1: По мнению сторонников этой аргументации, облачные вычисления не только позволят сэкономить на используемом оборудовании, но и повысят эффективность использования вычислительных мощностей в расчете на киловатт-час.",
            "R2: Возможность заработать немного денег в любом случае выгоднее, чем пустое простаивание серверов."
        ]
    },
    {
        "type": "enter",
        "theme": "Облачные вычисления 1",
        "task": "Впишите пропущенное слово строчными буквами",
        "question": "Внедрение облачных вычислений, при которых часть системы размещается в публичном «облаке», т.е. на базе дата-центров облачного провайдера, а часть – в приватном «облаке», т.е. на серверах, принадлежащих самой компании называются ###",
        "vars": [
            "+: гибридными",
            "+: г*бридн#$#"
        ]
    },
    {
        "type": "enter",
        "theme": "AWS 3",
        "task": "Впишите пропущенную цифру",
        "question": "Несмотря на то, что бренд AWS был представлен еще в 2002 году,фактически AWS в современном виде существует с ### года, когда были анонсированы сервисы ElasticComputeCloud (EC2) и SimpleStorageService (S3).",
        "vars": [
            "+: 2006"
        ]
    },
    {
        "type": "compliance",
        "theme": "AWS 5",
        "task": "Сделайте соответствие",
        "question": "AmazonWebServices анонсировал в 2006 году следующие сервисы:",
        "vars": [
            "L1: EC2",
            "L2: S3",
            "L3: W3C",
            "R1: позволяет арендовать образы виртуальных машин",
            "R2: хранить данные, забыв об ограничениях, свойственных дисковым накопителям"
        ]
    },
    {
        "type": "enter",
        "theme": "RackspaceCloud 1",
        "task": "Впишите пропущенное слово строчными буквами",
        "question": "В отличие от Amazon.com бизнес компании Rackspace изначально связан с услугами ### и коллокации.",
        "vars": [
            "+: хостинга",
            "+: хост*нг#$#"
        ]
    },
    {
        "type": "enter",
        "theme": "Office 365 1",
        "task": "Впишите пропущенный год",
        "question": "Летом ### года Microsoft официально анонсировала Office 365 – единое облачное предложение, содержащее настольный пакет Office, а также инструменты для совместной работы.",
        "vars": [
            "+: 2011"
        ]
    },
    {
        "type": "compliance",
        "theme": "ПродуктыPaaS4",
        "task": "Сделайте соответствие",
        "question": "Количество различных PaaS-решений резко возросло, и сегодня разработчики обладают беспрецедентной свободой выбора облачных решений:",
        "vars": [
            "L1: Stackato",
            "L2: Cloudbees",
            "L3: PHP Fog",
            "R1: для программистов на Perl",
            "R2: для Java-разработчиков",
            "R3:"
        ]
    }
];