questions = [
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "",
    question: "Единицей измерения проводимости электрической ветви является…",
    opts: [
      ["Сименс", true],
      ["Ом", false],
      ["Вольт", false],
      ["Ампер", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "",
    question: "При последовательном соединении приемников выполняется:",
    opts: [
      ["через все элементы протекает один и тот же ток", true],
      ["все ветви цепи находятся под одним и тем же напряжением", false],
      ["эквивалентное сопротивление цепи равно нулю", false],
      ["сумма токов, сходящихся в узле равна 0", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "",
    question: "Единицей измерения проводимости электрической ветви является…",
    opts: [
      ["Сименс", true],
      ["Ампер", false],
      ["Вольт", false],
      ["Ом", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "Выберите один вариант ответа:",
    question: "Величина, обратная сопротивлению участка цепи называется ###",
    opts: [
      ["проводимостью", true],
      ["мощностью", false],
      ["напряжением", false],
      ["силой тока", false],
    ],
  },
  {
    type: "many",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "Указать правильные ответы:",
    question:
      "Узлом будет точка электрической схемы, если к ней подключено ветвей:",
    opts: [
      ["три", true],
      ["четыре", true],
      ["пять", true],
      ["одна", false],
      ["две", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "",
    question:
      "Указать, какая из приведенных схем замещения относится к\nреальному источнику ЭДС…",
    opts: [
      ["", true],
      ["", false],
      ["", false],
      ["", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "Выберите один вариант ответа:",
    question:
      "Электрическая цепь, у которой электрические напряжения и\nэлектрические токи связаны друг с другом линейными зависимостями,\nназывается ###",
    opts: [
      ["линейной электрической цепью", true],
      ["принципиальной схемой", false],
      ["схемой замещения", false],
      ["нелинейной электрической цепью", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "",
    question: "Единица измерения ЭДС:",
    opts: [
      ["В", true],
      ["Вт", false],
      ["Ом", false],
      ["ВА", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "",
    question: "Режиму короткого замыкания соответствуют условия:",
    opts: [
      ["Imax, U =0", true],
      ["I=0, U =0", false],
      ["I=0, Umax", false],
      ["Imax, Umax", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "",
    question: "Идеальному источнику ЭДС соответствует характеристика:",
    opts: [
      ["", true],
      ["", false],
      ["", false],
      ["", false],
      ["", false],
      ["", false],
      ["", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "",
    question: "Идеальному источнику тока соответствует характеристика:",
    opts: [
      ["", true],
      ["", false],
      ["", false],
      ["", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "",
    question: "Какой характеристике соответствует наибольшее сопротивление:",
    opts: [
      ["1", true],
      ["2", false],
      ["3", false],
      ["4", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "",
    question: "Какой характеристике соответствует наименьшее сопротивление:",
    opts: [
      ["4", true],
      ["1", false],
      ["2", false],
      ["3", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "",
    question:
      "Электрическая цепь содержит четыре источника электрической\nэнергии. Согласно метода наложения число вспомогательных схем\nравно:",
    opts: [
      ["4", true],
      ["1", false],
      ["2", false],
      ["3", false],
      ["5", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "",
    question: "Единица измерения электрического заряда:",
    opts: [
      ["Кл", true],
      ["Дж", false],
      ["В", false],
      ["А", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "",
    question:
      "Какой из режимов работы цепи постоянного тока указан на графике\nточкой А?",
    opts: [
      ["режим короткого замыкания", true],
      ["режим холостого хода", false],
      ["согласованный режим", false],
      ["номинальный режим", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "Выберите один вариант ответа:",
    question:
      "Графическое изображение электрической цепи, содержащее\nусловные обозначения элементов и показывающее их соединение,\nназывается ###",
    opts: [
      ["схемой электрической цепи", true],
      ["ветвью", false],
      ["контуром", false],
      ["узлом", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "",
    question:
      "При заданной вольт-амперной характеристике приемника напряжение на\nнем при токе 5 А составит…",
    opts: [
      ["25 В +", true],
      ["125 В", false],
      ["0,2 В", false],
      ["250 В", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "",
    question:
      "При заданной вольт-амперной характеристике приемника его\nсопротивление составит…",
    opts: [
      ["20 Ом", true],
      ["50 Ом", false],
      ["100 Ом", false],
      ["10 Ом", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "Выберите один вариант ответа:",
    question:
      "Задана цепь ЭДС 60 В, внутренним сопротивлением источника ЭДС 5 Ом\nи сопротивление нагрузки 25 Ом. Тогда напряжение на нагрузке будет равно\n###",
    opts: [
      ["50 В", true],
      ["50 В", false],
      ["60 В", false],
      ["70 В", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "",
    question:
      "Если резисторы имеют сопротивление R=10 Ом, то эквивалентное\nсопротивление цепи будет равно…",
    opts: [
      ["10 Ом", true],
      ["5 Ом", false],
      ["20 Ом", false],
      ["30 Ом", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "",
    question:
      "Если резисторы имеют сопротивления: R1=2 Ом, R2=4 Ом, R3=6 Ом,\nто эквивалентное сопротивление цепи будет равно…",
    opts: [
      ["2 Ом", true],
      ["4,4 Ом", false],
      ["12 Ом", false],
      ["10 Ом", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "",
    question:
      "Если резисторы имеют сопротивление R=10 Ом, то эквивалентное\nсопротивление цепи будет равно…",
    opts: [
      ["10 Ом", true],
      ["20 Ом", false],
      ["5 Ом", false],
      ["30 Ом", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "Выберите один вариант ответа:",
    question:
      "Формула закона Ома для участка цепи, содержащего только приемники\nэнергии, через проводимость цепи C1, имеет вид ###",
    opts: [
      ["I = U C1", true],
      ["U = I C1", false],
      ["I = U/ C1", false],
      ["C1 = UI", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "",
    question:
      "Если к цепи приложено напряжение U=120 В, а сила тока I=2 А, то\nсопротивление цепи равно",
    opts: [
      ["60 Ом", true],
      ["240 Ом", false],
      ["0,017 Ом", false],
      ["120 Ом", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "",
    question: "Определить токи I2 и I3, если I1 = 6 А, R1=R, R2 =2R",
    opts: [
      ["I2 =4А, I3=2А", true],
      ["I2 = I3=3А", false],
      ["I2 =2А, I3=4А", false],
      ["I2 = I3= I1 = 6А", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "",
    question:
      "Для контура, содержащего ветви R1, R4, R5, уравнение по второму закону\nКирхгофа будет иметь вид…",
    opts: [
      ["I1R1 + I4R4 - I5R5 = E1 + E4 – E5", true],
      ["I1R1 + I4R4 + I5R5 = E1 + E4 – E5", false],
      ["I1R1 + I4R4 - I5R5 = E1 + E4 + E5", false],
      ["I1R1 - I4R4 - I5R5 = E1 + E4 – E5", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "",
    question:
      "Количество независимых уравнений по второму закону Кирхгофа,\nнеобходимое для расчета токов в ветвях составит…",
    opts: [
      ["два", true],
      ["три", false],
      ["четыре", false],
      ["одно", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "",
    question:
      "Для контура, содержащего ветви R2, R3, R5, справедливо уравнение по\nвторому закону Кирхгофа …",
    opts: [
      ["I2R2 – I3R3 + I5R5 = E2 – E3", true],
      ["I2R2 + I3R3 + I5R5 = E2 + E3", false],
      ["I2R2 + I3R3 + I5R5 = E2 – E3", false],
      ["I2R2 + I3R3 - I5R5 = E2 – E3", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "",
    question:
      "Количество независимых уравнений по первому закону Кирхгофа\nнеобходимое для расчета токов в ветвях составит…",
    opts: [
      ["Три", true],
      ["Шесть", false],
      ["Два", false],
      ["Четыре", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "",
    question: "Количество узлов в данной схеме составляет…",
    opts: [
      ["Четыре", true],
      ["Три", false],
      ["Шесть", false],
      ["Два", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "",
    question: "Общее количество ветвей в данной схеме составляет…",
    opts: [
      ["Три", true],
      ["Две", false],
      ["Пять", false],
      ["Четыре", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "",
    question:
      "Если токи в ветвях составляют I1=2А, I2=10 А, то ток I5 будет\nравен…",
    opts: [
      ["12 А", true],
      ["6 А", false],
      ["8 А", false],
      ["20 А", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "",
    question: "Второй закон Кирхгофа?",
    opts: [
      ["U   E", true],
      ["U  IR", false],
      [" I n  0", false],
      [" EI   I 2 R", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "",
    question: "Для узла а справедливо уравнение по 1 закону Кирхгофа:",
    opts: [
      ["I1-I2-I3=0", true],
      ["I1-I2+I3=0", false],
      ["–I1-I2+I3=0", false],
      ["I1+I2+I3=0", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "",
    question: "Какое из приведенных уравнений соответствует рисунку?",
    opts: [
      ["I1 +I2 =I3 +I4", true],
      ["–I1 +I2 -I3 -I4 =0", false],
      ["I3 +I4 +I1 +I2 =0", false],
      ["I1 –I2 –I3 –I4 =0", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "",
    question: "Какое из приведенных уравнений соответствует рисунку?",
    opts: [
      ["I1 +I2 =I3 –I4", true],
      ["I1 +I2 -I3 -I4 =0", false],
      ["I3 +I4 –I1 –I2 =0", false],
      ["I1 +I2 +I3 +I4 =0", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "",
    question:
      "Число узловых уравнений в системе при расчете электрических\nцепей методом уравнений Кирхгофа должно быть (q – число узлов в\nсхеме):",
    opts: [
      ["q-1", true],
      ["q+1", false],
      ["q", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "",
    question:
      "Число контурных уравнений в системе при расчете электрических\nцепей методом уравнений Кирхгофа должно быть (Р – число ветвей в\nсхеме; РТ – число ветвей с источником тока; q – число узлов):",
    opts: [
      ["Р-РТ-q+1", true],
      ["Р-РТ-q-1", false],
      ["P-PТ+q+1", false],
      ["P+PТ+q+1", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "",
    question: "Количество узлов в данной схеме составляет…",
    opts: [
      ["Три", true],
      ["Пять", false],
      ["Четыре", false],
      ["Семь", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "",
    question:
      "Если сопротивления R1=100 Ом, R2=20 Ом, R3=200 Ом, то в ветвях будут\nнаблюдаться следующие токи…",
    opts: [
      ["В R2→max, в R3→min +", true],
      ["В R2→max, в R1→min", false],
      ["В R1→max, в R2→min", false],
      ["Во всех один и тот же ток", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "",
    question:
      "Полярность на вольтметре показывает направление напряжения. Если\nпоказание вольтметра pV=50 В, то показание амперметра pA равно…",
    opts: [
      ["1 А", true],
      ["10 А", false],
      ["11 А", false],
      ["6 А", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "",
    question:
      "Эквивалентное сопротивление цепи относительно источника ЭДС\nсоставит…",
    opts: [
      ["3R+", true],
      ["4R", false],
      ["R", false],
      ["6R", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "Выберите один вариант ответа:",
    question: "Закон Ома графически выражается в виде ###",
    opts: [
      ["прямой, проходящей через начало координат", true],
      ["параболы", false],
      ["прямой параллельной горизонтальной оси", false],
      ["прямой параллельной вертикальной оси", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "",
    question:
      "Определить эквивалентное сопротивление цепи, если: R1 = 10 Ом, R2\n= R3 = 5 Ом, R4 = R5=10",
    opts: [
      ["Rэкв = 10 Ом", true],
      ["Rэкв = 20 Ом", false],
      ["Rэкв = 5 Ом", false],
      ["Rэкв =30Ом", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "",
    question:
      "При увеличении числа параллельных ветвей в цепи постоянного\nтока эквивалентная проводимость:",
    opts: [
      ["увеличивается", true],
      ["уменьшается", false],
      ["не изменяется", false],
      ["равна наибольшей из проводимостей ветвей", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "",
    question: "Определить показание вольтметра, если U = 50В, R1=R2 =20 Ом",
    opts: [
      ["50 В", true],
      ["10 В", false],
      ["30 В", false],
      ["40 В", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "",
    question:
      "Найти эквивалентную проводимость цепи, если R1 = 4 Ом, R2 = 2\nОм, R3 = 3 Ом",
    opts: [
      ["gэкв ≈ 1,1 Cм", true],
      ["gэкв ≈ 9 Cм", false],
      ["gэкв ≈0,9 Cм", false],
      ["gэкв ≈ 2,7 Cм", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "",
    question: "Определить показание амперметра, если U = 50В, R1=R2 =20 Ом",
    opts: [
      ["5 А", true],
      ["10А", false],
      ["20 А", false],
      ["2,5 А", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "",
    question: "Определить показание амперметра, если U = 50В, R1=R2 =20 Ом",
    opts: [
      ["2,5 А", true],
      ["5 А", false],
      ["10А", false],
      ["20 А", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "",
    question: "Согласно закону Ома:",
    opts: [
      ["I  U R", true],
      ["I  UR", false],
      ["I  R U", false],
      ["U  I R", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "",
    question:
      "Определить сопротивления R1 и R2, если известно: R1= R2, U=50В, I",
    opts: [
      ["100 Ом", true],
      ["20 Ом", false],
      ["5 Ом", false],
      ["50Ом", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "",
    question:
      "Определить напряжения UR1, UR2, и UR3 если известно: R1= R2= R3,\nU=60В, I = 1 А:",
    opts: [
      ["UR1= UR2= UR3=20В", true],
      ["UR1=10В, UR2=20В, UR3=30В", false],
      ["UR1=0В, UR2=30В, UR3=30В", false],
      ["UR1= UR2= UR3=60В", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "",
    question:
      "Определить ток в цепи если известно: R1= R2= 20 Ом, R3=30 Ом,\nU=70В:",
    opts: [
      ["1 А", true],
      ["5 А", false],
      ["10А", false],
      ["2 А", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "",
    question: "Определить показание вольтметра, если I1 = 4 А, R1=R2 =20 Ом",
    opts: [
      ["40 В", true],
      ["10 В", false],
      ["30 В", false],
      ["50 В", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "",
    question:
      "Определить напряжения UR1, UR2, и UR3 если известно: R1=R, R2=2R,\nR3=3R, U=60В, I = 1 А:",
    opts: [
      ["UR1=10В, UR2=20В, UR3=30В", true],
      ["UR1=0В, UR2=30В, UR3=30В", false],
      ["UR1= UR2= UR3=60В", false],
      ["UR1= UR2= UR3=20В", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "",
    question:
      "Определить эквивалентное сопротивление цепи, если R1 = R2 = R3 =\nR4 = 1 Ом",
    opts: [
      ["Rэкв = 0,5 Ом", true],
      ["Rэкв = 1 Ом", false],
      ["Rэкв = 0,75 Ом", false],
      ["Rэкв =2 Ом", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "",
    question:
      "Если сопротивления всех резисторов R одинаковы и равны 6 Ом, то\nвходное сопротивление схемы, изображенной на рисунке, равно ###",
    opts: [
      ["11 Ом", true],
      ["36 Ом", false],
      ["12 Ом", false],
      ["18 Ом", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "Выберите один вариант ответа:",
    question:
      "Если сопротивления всех резисторов одинаковый равны по 6 Ом, то\nэквивалентное сопротивление пассивной резистивной цепи,\nизображенной на рисунке, равно ###",
    opts: [
      ["2 ОМ", true],
      ["1,5 Ом", false],
      ["6 Ом", false],
      ["3 Ом", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "",
    question:
      "Если сопротивления R1=100 Ом, R2=20 Ом, R3=200 Ом, то на\nрезисторах будут наблюдаться следующие напряжения ###",
    opts: [
      ["на R3 – max, на R2 – min", true],
      ["на R2 – max, на R1 – min", false],
      ["на всех одно и то же напряжение", false],
      ["на R1 – max, на R2 – min", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "Выберите один вариант ответа:",
    question:
      "Эквивалентное сопротивление цепи относительно источника ЭДС\nсоставит ###",
    opts: [
      ["4R", true],
      ["2R", false],
      ["6R", false],
      ["10R Ом", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "Выберите один вариант ответа:",
    question:
      "Эквивалентное сопротивление участка цепи, состоящего из трех\nпоследовательно соединенных сопротивлений номиналом 1 Ом, 10 Ом,\n1000 Ом, равно ###",
    opts: [
      ["1011 Ом", true],
      ["1000 Ом", false],
      ["11 Ом", false],
      ["1 Ом", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "Выберите один вариант ответа:",
    question:
      "Если напряжения на трех последовательно соединенных резисторах\nотносятся как 1:2:4, то отношение сопротивлений резисторов ###",
    opts: [
      ["подобно отношению напряжений 1:2:4", true],
      ["равно 4:2:1", false],
      ["равно 1:4:2", false],
      ["равно 1:1/2:1/4", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "Выберите один вариант ответа:",
    question:
      "Если номинальный ток I = 100 А, тогда номинальное напряжение U\nисточника напряжения с ЭДС Е = 230 В и внутренним сопротивлением\nRВТ = 0,1 Ом равно ###",
    opts: [
      ["220 В", true],
      ["225 В", false],
      ["230 В", false],
      ["200 В", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "",
    question: "Источники ЭДС работают в следующих режимах…",
    opts: [
      ["оба в генераторном режиме", true],
      ["оба в режиме потребления", false],
      ["Е1 – потребитель, а Е2 – генератор", false],
      ["Е1 – генератор, а Е2 – потребитель", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "",
    question: "Уравнение баланса мощностей представлено выражением…",
    opts: [
      ["Е1I1 - E3I3 = R1I12 + R2I22 + R3I32 +", true],
      ["Е1I1 + E3I3 = R1I12 + R2I22 + R3I32", false],
      ["-Е1I1 + E3I3 = R1I12 + R2I22 + R3I32", false],
      ["Е1I1 + E3I3 = R1I12 - R2I22 + R3I32", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "",
    question:
      "Если сопротивления цепи заданы в Омах, а токи в ветвях составляют\nI1=1 А, I2=2 А, I3=1 А, то потребляемая мощность имеет величину…",
    opts: [
      ["10 Вт", true],
      ["20 Вт", false],
      ["8 Вт", false],
      ["2 Вт", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "",
    question:
      "При известных величинах токов и сопротивлений, потребляемая\nмощность составит…",
    opts: [
      ["10 Вт", true],
      ["2 Вт", false],
      ["20 Вт", false],
      ["8 Вт", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "",
    question:
      "Выражение для мощности P0, выражающейся на внутреннем\nсопротивлении источника R0 имеет вид…",
    opts: [
      ["", true],
      ["", false],
      ["", false],
      ["", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "",
    question: "Мощность источника питания определяется формулой:",
    opts: [
      ["P  EI", true],
      ["P  EI 2", false],
      ["P  E 2 I", false],
      ["P  UI 2", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "",
    question:
      "В цепи известны сопротивления резисторов R1=20 Ом, R2=30 Ом,\nЭДС источника E=120 B и мощность Р=120 Вт всей цепи. Мощность\nР2 второго резистора будет равна ###",
    opts: [
      ["Р2=30 Вт", true],
      ["Р2=80 Вт", false],
      ["Р2=125 Вт", false],
      ["Р2=25 Вт", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "",
    question:
      "Выражение для мощности Р, выделяющейся в нагрузке с\nсопротивлением R, имеет вид ###",
    opts: [
      ["Р=I2R", true],
      ["Р=IR", false],
      ["Р=IR2", false],
      ["Р=I2R2", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "",
    question: "Эквивалентное сопротивление цепи будет равно:",
    opts: [
      ["4R", true],
      ["R", false],
      ["2R", false],
      ["3R", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "Выберите один вариант ответа:",
    question:
      "Если пять резисторов с сопротивлениями R1 = 100 Ом, R2 = 10 Ом,\nR3 = 20 Ом, R4 = 500 Ом, R5 = 100 Ом соединены последовательно, то\nток будет ###",
    opts: [
      ["один и тот же", true],
      ["наибольшим в сопротивлении R2", false],
      ["наибольшим в сопротивлении R4", false],
      ["наибольшим в сопротивлениях R1, R5", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "Выберите один вариант ответа:",
    question:
      "В цепи известны сопротивления R1 = 30 Ом, R2 = 60 Ом, R3 = 120 Ом\nи ток в первой ветви I1 = 4 А. Тогда ток I и мощность Р цепи\nсоответственно равны ###",
    opts: [
      ["I = 7 A; P = 840 Вт", true],
      ["I = 8 A; P = 960 Вт", false],
      ["I = 1 A; P = 540 Вт", false],
      ["I = 9 A; P = 810 Вт", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "Выберите один вариант ответа:",
    question: "Из представленных значений единицей мощности являются ###..",
    opts: [
      ["20 МВт", true],
      ["1 А", false],
      ["30 Дж", false],
      ["100 кВт·ч", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "",
    question:
      "Если статическое сопротивление нелинейного элемента при токе I1=0,3А\nравно 10 Ом, то напряжение U1 составит…",
    opts: [
      ["3 В", true],
      ["10,3 В", false],
      ["33,33 В", false],
      ["0,03 В", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "",
    question:
      "Если статическое сопротивление нелинейного элемента при напряжении\nU1=20 В равно 5 Ом, то сила тока I1 составит",
    opts: [
      ["4 А", true],
      ["0,25 А", false],
      ["25 А", false],
      ["100 А", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "",
    question:
      "При параллельном соединении нелинейных сопротивлений, заданных\nхарактеристиками R1 и R2, характеристика эквивалентного сопротивления RЭ\nпройдет…",
    opts: [
      ["Пройдет ниже характеристики R2", true],
      ["Совпадет с кривой R2", false],
      ["Пройдет выше характеристики R1", false],
      ["Пройдет между ними", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "",
    question:
      "При последовательном соединении линейного и нелинейного\nсопротивлений с характеристиками а и б характеристика\nэквивалентного сопротивления…",
    opts: [
      ["Пройдет выше характеристики а", true],
      ["Совпадет с кривой а", false],
      ["Пройдет ниже характеристики б", false],
      ["Пройдет между ними", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "",
    question:
      "Статическое сопротивление нелинейного элемента при токе 2 А\nсоставит…",
    opts: [
      ["15 Ом", true],
      ["28 Ом", false],
      ["60 Ом", false],
      ["32 Ом", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "Выберите один вариант ответа:",
    question:
      "На рисунке представлены вольт-амперные характеристики\nприемников, из них нелинейных элементов - ###",
    opts: [
      ["а,б,г", true],
      ["б,в,г", false],
      ["все", false],
      ["а,б,в", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "Выберите один вариант ответа:",
    question:
      "При параллельном соединении заданы вольт-амперные\nхарактеристики нелинейных сопротивлений. При напряжении U = 20 В\nсила тока I составит ###",
    opts: [
      ["4 А", true],
      ["5 А", false],
      ["3 А", false],
      ["1 А", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "Выберите один вариант ответа:",
    question:
      "Если статическое сопротивление нелинейного элемента при\nнапряжении U1 = 150 В равно 30 Ом, то сила тока I1 составит ###",
    opts: [
      ["5 А", true],
      ["0,2 А", false],
      ["4,5 А", false],
      ["180 А", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "",
    question:
      "При последовательном соединении заданы вольт-амперные\nхарактеристики нелинейных сопротивлений. При токе I=2А\nнапряжение U составит ###",
    opts: [
      ["40 В", true],
      ["10 В", false],
      ["30 В", false],
      ["20 В", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "",
    question:
      "Статическое сопротивление нелинейного элемента в точке А\nопределяется выражением ###\nI\nU1\nI\nm",
    opts: [
      ["Rстат ", true],
      ["Rстат  1  I tg 180    \nU1 mU", false],
      ["Rстат  1\nU1\n mRtg\nI1\nI\nm", false],
      ["Rстат  1  U tg 90   \nU1 mI", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "Выберите один вариант ответа:",
    question:
      "При заданной вольт-амперной характеристике статическое\nсопротивление нелинейного элемента в точке А составляет ###",
    opts: [
      ["10 Ом", true],
      ["100 Ом", false],
      ["20 Ом", false],
      ["30 Ом", false],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "Выберите один вариант ответа:",
    question: "Первый закон Кирхгофа формулируется следующим образом ###",
    opts: [
      [
        "алгебраическая сумма токов ветвей, сходящихся в узле, равна нулю",
        true,
      ],
      ["алгебраическая сумма напряжений вдоль контура равна нулю", false],
      [
        "алгебраическая сумма падений напряжения в контуре равна\nалгебраической сумме ЭДС в том контуре",
        false,
      ],
      [
        "сила тока в цепи прямо пропорциональна приложенному\nнапряжению и обратно пропорциональна сопротивлению этой цепи",
        false,
      ],
    ],
  },
  {
    type: "single",
    theme:
      "Основные определения и методы расчета линейных и нелинейных электрических цепей постоянного тока",
    task: "Выберите один вариант ответа:",
    question:
      "При последовательном соединении нелинейных сопротивлений с\nхарактеристиками R1 и R2 характеристика эквивалентного\nсопротивления R3 ###",
    opts: [
      ["пройдет выше характеристики R1", true],
      ["совпадает с кривой R2", false],
      ["пройдет ниже характеристики R2", false],
      ["пройдет между ними", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "Выберите один вариант ответа:",
    question:
      "Симметричная вольт-амперная характеристика нелинейного элемента\nсоответствует рисунку ###",
    opts: [
      ["", true],
      ["", false],
      ["", false],
      ["", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "Выберите один вариант ответа:",
    question: "Действующее значение напряжения составляет ###",
    opts: [
      ["220 В", true],
      ["110 В", false],
      ["310,2 В", false],
      ["437,4 В", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "Действующее значение синусоидального электрического тока\ni(t)=1,41sin(314t+/2) A составляет…",
    opts: [
      ["1 А", true],
      ["0 А", false],
      ["1,41 А", false],
      ["2 А", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "Выберите один вариант ответа:",
    question:
      "Для мгновенного значения однофазного синусоидального тока i(t)\nсправедливо ###",
    opts: [
      ["i(t) = i(t+Т)", true],
      ["i(t) = i(t-3Т/2)", false],
      ["i(t) = i(t-Т/2)", false],
      ["i(t) = i(t+Т/2)", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "Выберите один вариант ответа:",
    question:
      "Амплитудное значение напряжения u(t) составит, если ток и\nсопротивление равны i  20 sin 314  45 A, Z=10 Ом, ###",
    opts: [
      ["200 В", true],
      ["2 В", false],
      ["20 В", false],
      ["10 B", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "Выберите один вариант ответа:",
    question: "Действующее значение тока, это ###",
    opts: [
      ["I  I m / 2", true],
      ["I  I m / 2", false],
      ["I  2 I m", false],
      ["I  I m", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "При напряжении u(t)=100 sin (314t+  /4) В и величине R, равной 50 Ом,\nмгновенное значение тока i(t)…",
    opts: [
      ["i(t)=2 sin (314t +  /4) A +", true],
      ["i(t)=0.5 sin 314t A", false],
      ["i(t)=5000 sin (314t +  /4) A", false],
      ["i(t)=2 sin 314t A", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "характер сопротивления пассивной электрической цепи для случая,\nсоответствующего приведенной векторной диаграмме,…",
    opts: [
      ["активно-индуктивный,", true],
      ["индуктивный", false],
      ["емкостный", false],
      ["активный", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "Выберите один вариант ответа:",
    question:
      "Полное сопротивление пассивного двухполюсника Z при действующем\nзначении напряжения U=100 В и действующем значении тока I=2 А составит\n###",
    opts: [
      ["50 Ом", true],
      ["200 Ом", false],
      ["100 Ом", false],
      ["70,7 Ом", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "Комплексное сопротивление приведенной цепи Z в алгебраической форме\nзаписи при R=8 Ом, XL=7 Ом, XC=13 Ом составляет…",
    opts: [
      ["Z=8-j6 Ом", true],
      ["Z=28 Ом", false],
      ["Z=8+j6 Ом", false],
      ["Z=8- j20 Ом", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "Частота ƒ синусоидального тока при угловой частоте ω равной 314 с-1\nсоставит",
    opts: [
      ["50 Гц", true],
      ["0,00628 Гц", false],
      ["628 Гц", false],
      ["100 Гц", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "При изменении частоты ƒ от нуля до бесконечности полное сопротивление\nZ…",
    opts: [
      ["Увеличивается", true],
      ["Достигает минимума, а затем увеличивается", false],
      ["Остается неизменным", false],
      ["Уменьшается", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "Емкостное сопротивление XC при величине С=100 мкФ и частоте ƒ=50 Гц\nравно…",
    opts: [
      ["31,84 Ом", true],
      ["314 Ом", false],
      ["100 Ом", false],
      ["31400 Ом", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "Полное сопротивление Z приведенной цепи при XC=40 Ом и R=30 Ом\nсоставляет…",
    opts: [
      ["50 Ом +", true],
      ["10 Ом", false],
      ["70 Ом", false],
      ["1200 Ом", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "Угловая частота ω при частоте синусоидального тока ƒ равной 50 Гц\nсоставит…",
    opts: [
      ["314 с-1", true],
      ["100 с-1", false],
      ["628 с-1", false],
      ["0,01 с-1", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "В выражении для мгновенного значения однофазного синусоидального\nтока\n, периодом является…",
    opts: [
      ["T", true],
      ["i", false],
      ["Im", false],
      ["i(t)", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "Единицей измерения активной мощности P цепи синусоидального тока\nявляется…",
    opts: [
      ["Вт", true],
      ["Дж", false],
      ["ВАр", false],
      ["ВА", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "Комплексное сопротивление приведенной цепи Z в алгебраической форме\nзаписи при XL=30 Ом и R=40 Ом составляет…",
    opts: [
      ["Z= 40 + j30 Ом", true],
      ["Z= 40 - j30 Ом", false],
      ["Z= 30 - j40 Ом", false],
      ["Z= 30 + j40 Ом", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "Индуктивное сопротивление XL при частоте тока f, равной 50 Гц, и\nвеличине L, равной 0,318 Гн, составит…",
    opts: [
      ["100 Ом", true],
      ["0,318 Ом", false],
      ["314 Ом", false],
      ["0,00102 Ом", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question: "Режим резонанса напряжения может быть установлен в цепи…",
    opts: [
      ["", true],
      ["", false],
      ["", false],
      ["", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "К возникновению режима резонанса напряжений ведет выполнение\nусловия…",
    opts: [
      ["XL=XC", true],
      ["R=XL", false],
      ["XL=1/XC", false],
      ["R=XC", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "Начальная фаза напряжения u(t) при токе i(t)=2sin(314t-/6) А равна…",
    opts: [
      ["-/6 рад", true],
      ["0 рад", false],
      ["/2 рад", false],
      ["+/6 рад", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "Угол сдвига фаз φ между напряжением и током на входе цепи при XC=40\nОм и R=30 Ом составляет…",
    opts: [
      ["φ=-53о", true],
      ["φ=-37о", false],
      ["φ=53о", false],
      ["φ=37о", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "При токе i(t)=2sin(314t+/2) A и величине R, равной 50 Ом, амплитудное\nзначение напряжения u(t) равно…",
    opts: [
      ["100 В", true],
      ["0,04 В", false],
      ["50 В", false],
      ["2 В", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question: "Полное комплексное сопротивление равно\nR\nXC",
    opts: [
      ["Z = R – jXС", true],
      ["Z = R + jXC", false],
      ["Z = R + XC", false],
      ["Z = R - XC", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question: "Полное комплексное сопротивление схемы равно\nR\nXL",
    opts: [
      ["Z = R + jXL", true],
      ["Z = R + XL", false],
      ["Z = R – jXL", false],
      ["Z = R - XL", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question: "Полное комплексное сопротивление схемы равно\nR\nXL\nXC",
    opts: [
      ["Z = R + j(XL – XC)", true],
      ["Z = R – J(XL – XC)", false],
      ["Z = R + XL + XC", false],
      ["Z = R – XL – XС", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question: "Условие резонанса напряжений",
    opts: [
      ["XL = XC", true],
      ["R = XL", false],
      ["R = XС", false],
      ["R = XL - XC", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "Модуль Z и фаза φ полного комплексного сопротивления при R = 2 Ом, XL\n= 1 Ом равно\nR\nXL",
    opts: [
      ["Z = √5, φ = arctg1/2", true],
      ["Z = 1, φ = arctg1/2", false],
      ["Z = √5, φ = arctg2", false],
      ["Z = 3, φ = arctg2", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "Модуль Z и фаза φ полного комплексного сопротивления при R = 3 Ом, XL\n= 2 Ом равно\nR\nXL",
    opts: [
      ["Z = √13, φ = arctg2/3", true],
      ["Z = 5, φ = arctg2/3", false],
      ["Z = 1, φ = arctg2/3", false],
      ["Z = √5, φ = arctg3/2", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "Модуль Z и фаза φ полного комплексного сопротивления при R = 1 Ом, XL\n= 2 Ом равно\nR\nXL",
    opts: [
      ["Z = √5, φ = arctg2", true],
      ["Z = √5, φ = arctg1/2", false],
      ["Z = 3, φ = arctg2", false],
      ["Z = 3, φ = arctg1/2", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "Модуль Z и фаза φ полного комплексного сопротивления при R = 2 Ом, XL\n= 2 Ом равно\nR\nXL",
    opts: [
      ["Z = 2√2, φ = arctg1", true],
      ["Z = 4, φ = arctg1", false],
      ["Z = 2, φ = arctg1", false],
      ["Z = √8, φ = arctg0", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "Модуль Z и фаза φ полного комплексного сопротивления при R = 2 Ом, XL\n= 3 Ом равно\nR\nXL",
    opts: [
      ["Z = √13, φ = arctg3/2", true],
      ["Z = √13, φ = arctg1/2", false],
      ["Z = √5, φ = arctg2/3", false],
      ["Z = √5, φ = arctg3/2", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "Модуль Z и фаза φ полного комплексного сопротивления при R = 4 Ом, XL\n= 3 Ом равно\nR\nXL",
    opts: [
      ["Z = 5, φ = arctg3/4", true],
      ["Z = 7, φ = arctg4/3", false],
      ["Z = 7, φ = arctg3/4", false],
      ["Z = 5, φ = arctg4/3", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "Модуль Z и фаза φ полного комплексного сопротивления при R = 3 Ом, XL\n= 4 Ом равно\nR\nXL",
    opts: [
      ["Z = 5, φ = arctg4/3", true],
      ["Z = 7, φ = arctg4/3", false],
      ["Z = 5, φ = arctg3/4", false],
      ["Z = 7, φ = arctg3/4", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "Модуль Z и фаза φ полного комплексного сопротивления при R = 5 Ом, XL\n= 4 Ом равно\nR\nXL",
    opts: [
      ["Z = √41, φ = arctg4/5", true],
      ["Z = 9, φ = arctg4/5", false],
      ["Z =1, φ = arctg5/4", false],
      ["Z = 3, φ = arctg4/5", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "Модуль Z и фаза φ полного комплексного сопротивления при R = 4 Ом, XL\n= 5 Ом равно\nR\nXL",
    opts: [
      ["Z = √41, φ = arctg5/4", true],
      ["Z = 9, φ = arctg5/4", false],
      ["Z = 3, φ = arctg4/5", false],
      ["Z = √41, φ = arctg4/5", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "Модуль Z и фаза φ полного комплексного сопротивления при R = 6 Ом, XL\n= 5 Ом равно\nR\nXL",
    opts: [
      ["Z = √61, φ = arctg5/6", true],
      ["Z = 11, φ = arctg5/6", false],
      ["Z = √11, φ = arctg6/5", false],
      ["Z = √61, φ = arctg6/5", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "Модуль Z и фаза φ полного комплексного сопротивления при R = 5 Ом, XL\n= 6 Ом равно\nR\nXL",
    opts: [
      ["Z = √61, φ = arctg6/5", true],
      ["Z = √11, φ = arctg5/6", false],
      ["Z = √61, φ = arctg5/6", false],
      ["Z = 11, φ = arctg6/5", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "Модуль Z и фаза φ полного комплексного сопротивления при R = 6 Ом, XL\n= 7 Ом равно\nR\nXL",
    opts: [
      ["Z = √85, φ = arctg7/6", true],
      ["Z = 13, φ = arctg7/6", false],
      ["Z = √13, φ = arctg7/6", false],
      ["Z = √31, φ = arctg6/7", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "Модуль Z и фаза φ полного комплексного сопротивления при R = 4 Ом, XL\n= 2 Ом равно\nR\nXL",
    opts: [
      ["Z = √20, φ = arctg1/2", true],
      ["Z = 6, φ = arctg2", false],
      ["Z = √6, φ = arctg1/2", false],
      ["Z = √20, φ = arctg2", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "Модуль Z и фаза φ полного комплексного сопротивления при R = 4 Ом, XL\n= 5 Ом равно\nR\nXL",
    opts: [
      ["Z = √41, φ = arctg5/4", true],
      ["Z = √41, φ = arctg4/5", false],
      ["Z = 9, φ = arctg4/5", false],
      ["Z = 3, φ = arctg5/4", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "Модуль Z и фаза φ полного комплексного сопротивления при R = 4 Ом, XL\n= 1 Ом равно\nR\nXL",
    opts: [
      ["Z = √17, φ = arctg1/4", true],
      ["Z = √17, φ = arctg4", false],
      ["Z = √5, φ = arctg1/4", false],
      ["Z = √5, φ = arctg4", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "Модуль Z и фаза φ полного комплексного сопротивления при R = 3 Ом, XL\n= 1 Ом равно\nR\nXL",
    opts: [
      ["Z = √10, φ = arctg1/3", true],
      ["Z = 5, φ = arctg1/3", false],
      ["Z = √5, φ = arctg3", false],
      ["Z = √5, φ = arctg1/3", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "Модуль Z и фаза φ полного комплексного сопротивления при R = 5 Ом, XL\n= 2 Ом равно\nR\nXL",
    opts: [
      ["Z = √29, φ = arctg2/5", true],
      ["Z = √29, φ = arctg5/2", false],
      ["Z = √7, φ = arctg5/2", false],
      ["Z = √7, φ = arctg2/5", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "Модуль Z и фаза φ полного комплексного сопротивления при R = 6 Ом, XL\n= 2 Ом равно\nR\nXL",
    opts: [
      ["Z = √40, φ = arctg2/3", true],
      ["Z = 8, φ = arctg4", false],
      ["Z = 2√2, φ = arctg1/3", false],
      ["Z = 2√10, φ = arctg1/3", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "Модуль Z и фаза φ полного комплексного сопротивления при R = 5 Ом, XL\n= 3 Ом равно\nXL\nR",
    opts: [
      ["Z = √34, φ = arctg3/5", true],
      ["Z = √34, φ = arctg5/3", false],
      ["Z = 2√2, φ = arctg3/5", false],
      ["Z = 8, φ = arctg5/3", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "Модуль Z и фаза φ полного комплексного сопротивления при R = 1 Ом, XL\n= 7 Ом равно\nXL\nR",
    opts: [
      ["Z = √50, φ = arctg7", true],
      ["Z = 10, φ = arctg7", false],
      ["Z = √10, φ = arctg1/7", false],
      ["Z = 5√2, φ = arctg1/7", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "Модуль Z и фаза φ полного комплексного сопротивления при R = 2 Ом, XC\n= 1 Ом равны\nR\nXC",
    opts: [
      ["Z = √5, φ = arctg(-1/2)", true],
      ["Z = √5, φ = arctg1/2", false],
      ["Z = √5, φ = arctg2", false],
      ["Z = 3, φ = arctg(-2)", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "Модуль Z и фаза φ полного комплексного сопротивления при R = 1 Ом, XC\n= 2 Ом равны\nR\nXC",
    opts: [
      ["Z = √5, φ = arctg(-2)", true],
      ["Z = √5, φ = arctg(-1/2)", false],
      ["Z = 3, φ = arctg(-2)", false],
      ["Z = 3, φ = arctg(-1/2)", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "Модуль Z и фаза φ полного комплексного сопротивления при R = 3 Ом, XC\n= 2 Ом равны\nR\nXC",
    opts: [
      ["Z = √13, φ = arctg(-2/3)", true],
      ["Z = √13, φ = arctg2/3", false],
      ["Z = √5, φ = arctg(-3/2)", false],
      ["Z = √5, φ = arctg2/3", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "Модуль Z и фаза φ полного комплексного сопротивления при R = 2 Ом, XC\n= 3 Ом равны\nR\nXC",
    opts: [
      ["Z = √13, φ = arctg(-3/2)", true],
      ["Z = 5, φ = arctg(-3/2)", false],
      ["Z = √5, φ = arctg2/3", false],
      ["Z = √13, φ = arctg3/2", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "Модуль Z и фаза φ полного комплексного сопротивления при R = 4Ом, XC\n=3 Ом равны\nR\nXC",
    opts: [
      ["Z = 5, φ = arctg(-3/4)", true],
      ["Z = 7, φ = arctg(-3/4)", false],
      ["Z = 7, φ = arctg4/3", false],
      ["Z = 5, φ = arctg4/3", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "Модуль Z и фаза φ полного комплексного сопротивления при R = 3 Ом, XC\n= 4 Ом равны\nR\nXC",
    opts: [
      ["Z = 5, φ = arctg(-4/3)", true],
      ["Z = 5, φ = arctg(-3/4)", false],
      ["Z = 7, φ = arctg3/4", false],
      ["Z = 7, φ = arctg4/3", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "Модуль Z и фаза φ полного комплексного сопротивления при R = 5 Ом, XC\n= 4 Ом равны\nR\nXC",
    opts: [
      ["Z = √41, φ = arctg(-4/5)", true],
      ["Z = 9, φ = arctg(-5/4)", false],
      ["Z = 9, φ = arctg5/4", false],
      ["Z = √41, φ = arctg(-5/4)", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "Модуль Z и фаза φ полного комплексного сопротивления при R = 5 Ом, XC\n= 5 Ом равны\nR\nXC",
    opts: [
      ["Z = √50, φ = arctg(-1)", true],
      ["Z = √50, φ = arctg1", false],
      ["Z = √10, φ = arctg1", false],
      ["Z = 10, φ = arctg(-1)", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "Модуль Z и фаза φ полного комплексного сопротивления при R = 6 Ом, XC\n= 5 Ом равны\nR\nXC",
    opts: [
      ["Z = √61, φ = arctg-(5/6)", true],
      ["Z = 11, φ = arctg6/5", false],
      ["Z = √61, φ = arctg1", false],
      ["Z = √11, φ = arctg(-6/5)", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "Модуль Z и фаза φ полного комплексного сопротивления при R = 5 Ом, XC\n= 6 Ом равны\nR\nXC",
    opts: [
      ["Z = √61, φ = arctg(-6/5)", true],
      ["Z = √61, φ = arctg(-5/6)", false],
      ["Z = √61, φ = arctg6/5", false],
      ["Z = √11, φ = arctg5/6", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "Модуль Z и фаза φ полного комплексного сопротивления при R = 3 Ом, XC\n= 1 Ом равны\nR\nXC",
    opts: [
      ["Z = √10, φ = arctg1/3", true],
      ["Z = √10, φ = arctg(-3)", false],
      ["Z = 10, φ = arctg3", false],
      ["Z = 4, φ = arctg1/3", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "Модуль Z и фаза φ полного комплексного сопротивления при R = 1 Ом, XC\n= 3 Ом равны\nR\nXC",
    opts: [
      ["Z = √10, φ = arctg(-3)", true],
      ["Z = √10, φ = arctg1/3", false],
      ["Z = √13, φ = arctg(-1/3)", false],
      ["Z = √13, φ = arctg(-1/3)", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "Модуль Z и фаза φ полного комплексного сопротивления при R = 4 Ом, XC\n= 2 Ом равны\nR\nXC",
    opts: [
      ["Z = 2√5, φ = arctg(-1/2)", true],
      ["Z = √20, φ = arctg(-2)", false],
      ["Z = √20, φ = arctg(-1/2)", false],
      ["Z = √6, φ = arctg2", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "Модуль Z и фаза φ полного комплексного сопротивления при R = 2 Ом, XC\n= 4 Ом равны\nR\nXC",
    opts: [
      ["Z = 2√5, φ = arctg(-2)", true],
      ["Z = 6, φ = arctg2/4", false],
      ["Z = √6, φ = arctg4/2", false],
      ["Z = 2√5, φ = arctg1/2", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "Модуль Z и фаза φ полного комплексного сопротивления при R = 5 Ом, XC\n= 2 Ом равны\nR\nXC",
    opts: [
      ["Z = √39, φ = arctg(-2/5)", true],
      ["Z = √39, φ = arctg(-5/2)", false],
      ["Z = √7, φ = arctg2/5", false],
      ["Z = 7, φ = arctg5/2", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "Модуль Z и фаза φ полного комплексного сопротивления при R = 2 Ом, XC\n= 5 Ом равны\nR\nXC",
    opts: [
      ["Z = √39, φ = arctg(-5/2)", true],
      ["Z = 7, φ = arctg5/2", false],
      ["Z = √7, φ = arctg(-2/5)", false],
      ["Z = √39, φ = arctg(-2/5)", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "Модуль Z и фаза φ полного комплексного сопротивления при R = 6 Ом, XC\n= 1 Ом равны\nR\nXC",
    opts: [
      ["Z = √37, φ = arctg(-1/6)", true],
      ["Z = √37, φ = arctg6", false],
      ["Z = √7, φ = arctg(-6)", false],
      ["Z = 7, φ = arctg6", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "Модуль Z и фаза φ полного комплексного сопротивления при R = 1 Ом, XC\n= 6 Ом равны\nR\nXC",
    opts: [
      ["Z = √31, φ = arctg(-6)", true],
      ["Z = 7, φ = arctg(-6)", false],
      ["Z = √7, φ = arctg(-1/6)", false],
      ["Z = √37, φ = arctg1/6", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "Модуль Z и фаза φ полного комплексного сопротивления при R = 6 Ом, XC\n= 4 Ом равны\nR\nXC",
    opts: [
      ["Z = √52, φ = arctg(-1/3)", true],
      ["Z = 10, φ = arctg(-3/2)", false],
      ["Z = √10, φ = arctg3/2", false],
      ["Z = 52, φ = arctg1/3", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "Модуль Z и фаза φ полного комплексного сопротивления при R = 4 Ом, XC\n= 6 Ом равны\nR\nXC",
    opts: [
      ["Z = √52, φ = arctg(-3/2)", true],
      ["Z = √52, φ = arctg(-2/3)", false],
      ["Z = √10, φ = arctg3/2", false],
      ["Z = 10, φ = arctg(-2/3)", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "Модуль Z и фаза φ полного комплексного сопротивления при R = 3 Ом, XL\n= 2 Ом, Xc = 1 Ом равны\nR\nXL",
    opts: [
      ["Z = √10, φ = arctg1/3", true],
      ["Z = √10, φ = arctg3", false],
      ["Z = 10, φ = arctg1/3\nXC", false],
      ["Z = 6, φ = arctg3", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "Модуль Z и фаза φ полного комплексного сопротивления при R = 4 Ом, XL\n= 3 Ом, Xc = 1 Ом равны\nR\nXL\nXC",
    opts: [
      ["Z = 2√5, φ = arctg1/2", true],
      ["Z = 2√5, φ = arctg1", false],
      ["Z = 8, φ = arctg2", false],
      ["Z = 2√2, φ = arctg1/2", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "Модуль Z и фаза φ полного комплексного сопротивления при R = 4 Ом, XL\n= 1 Ом, Xc = 3 Ом равны\nR\nXL\nXC",
    opts: [
      ["Z = 2√5, φ = arctg(-1/2)", true],
      ["Z = 2√2, φ = arctg2", false],
      ["Z = 2√2, φ = arctg(-2)", false],
      ["Z = 2√5, φ = arctg1/2", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "Модуль Z и фаза φ полного комплексного сопротивления при R = 3 Ом, XL\n= 1 Ом, Xc = 2 Ом равны\nR\nXL\nXC",
    opts: [
      ["Z = √10, φ = arctg(-1/3)", true],
      ["Z = √10, φ = arctg1/3", false],
      ["Z = √6, φ = arctg3", false],
      ["Z = ·6, φ = arctg1/3", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "Модуль Z и фаза φ полного комплексного сопротивления при R = 2 Ом, XL\n= 2 Ом, Xc = 1 Ом равны\nR\nXL\nXC",
    opts: [
      ["Z = √5, φ = arctg1/2", true],
      ["Z = √5, φ = arctg2", false],
      ["Z = √5, φ = arctg(-1/2)", false],
      ["Z = 6, φ = arctg(-2)", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "Модуль Z и фаза φ полного комплексного сопротивления при R = 3 Ом, XL\n= 3 Ом, Xc = 3 Ом равны\nR\nXL\nXC",
    opts: [
      ["Z = 9, φ = arctg4/3", true],
      ["Z = 3, φ = arctg0", false],
      ["Z = √3, φ = arctg1", false],
      ["Z = √27, φ = arctg0", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "Модуль Z и фаза φ полного комплексного сопротивления при R = 0 Ом, XL\n= 4 Ом, Xc = 3 Ом равны\nR\nXL\nXC",
    opts: [
      ["Z = 1, φ = arctg1", true],
      ["Z = 5, φ = arctg4/3", false],
      ["Z = √5, φ = arctg1", false],
      ["Z = 1, φ = arctg(-1)", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "Модуль Z и фаза φ полного комплексного сопротивления при R = 4 Ом, XL\n= 2 Ом, Xc = 5 Ом равны\nR\nXL\nXC",
    opts: [
      ["Z = 5, φ = arctg(-3/4)", true],
      ["Z = 5, φ = arctg3/4", false],
      ["Z = √5, φ = arctg4/3", false],
      ["Z = √45, φ = arctg3/4", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "Модуль Z и фаза φ полного комплексного сопротивления при R = 3 Ом, XL\n= 5 Ом, Xc = 1 Ом равны\nR\nXL\nXC",
    opts: [
      ["Z = 5, φ = arctg4/3", true],
      ["Z = 5, φ = arctg3/4", false],
      ["Z = √5, φ = arctg2", false],
      ["Z = √5, φ = arctg1/2", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "Модуль Z и фаза φ полного комплексного сопротивления при R = 5 Ом, XL\n= 2 Ом, Xc = 3 Ом равны\nR\nXL\nXC",
    opts: [
      ["Z = √26, φ = arctg(-1/5)", true],
      ["Z = √26, φ = arctg1", false],
      ["Z = 26, φ = arctg(-5)", false],
      ["Z = √26, φ = arctg1/5", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "Выберите один вариант ответа:",
    question:
      "Полное сопротивление пассивного двухполюсника Z при заданных\nдействующих значениях напряжения U и тока I равно",
    opts: [
      ["U / I", true],
      ["U  I", false],
      ["U m / I m", false],
      ["I / U", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "Выберите один вариант ответа:",
    question:
      "С увеличением частоты f при неизменном действующем значении\nприложенного напряжения U действующее значение напряжения U L ###",
    opts: [
      ["увеличивается", true],
      ["остается неизменным", false],
      ["уменьшается", false],
      ["достигает минимума, а затем увеличивается", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "Выберите один вариант ответа:",
    question:
      "Если известны полное сопротивление Z пассивного двухполюсника и угол\nφ сдвига фаз между напряжением u(t) и током i(t) на входе цепи, то\nкомплексное сопротивление Z определяется выражением ###",
    opts: [
      ["Z  Ze j", true],
      ["Z  Z", false],
      ["Z  Ze", false],
      ["Z  Z  ", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "Выберите один вариант ответа:",
    question:
      "Комплексная амплитуда тока i(t)=1,41sin(314t -π/2) А составляет ###\nj\n",
    opts: [
      ["Im  1,41e 2 A\nj\n", true],
      ["Im  e 2 A\nj\n", false],
      ["Im  1,41e 2 A\n\nj", false],
      ["Im  e 2 A", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "Выберите один вариант ответа:",
    question: "Какой род нагрузки изображен на векторной диаграмме?",
    opts: [
      ["активно-емкостная", true],
      ["активно-индуктивная", false],
      ["активная", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "Выберите один вариант ответа:",
    question: "Резонанс напряжений характеризуется ###",
    opts: [
      ["максимальным значением тока", true],
      ["максимальным сопротивлением", false],
      ["минимальным значением тока", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "Выберите один вариант ответа:",
    question: "При активно-индуктивной нагрузке ###",
    opts: [
      ["напряжение опережает ток на угол меньше 90º", true],
      ["ток опережает напряжение на 90º", false],
      ["напряжение опережает ток на 90º", false],
      ["ток опережает напряжение на угол меньше 90º", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "Выберите один вариант ответа:",
    question:
      "Определить род нагрузки, которой соответствует график мгновенных\nзначений тока и напряжения?",
    opts: [
      ["активно-индуктивная", true],
      ["активная", false],
      ["активно-емкостная", false],
      ["индуктивная", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "Выберите один вариант ответа:",
    question: "Представленной цепи соответствует векторная диаграмма",
    opts: [
      ["", true],
      ["", false],
      ["", false],
      ["", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "Выберите один вариант ответа:",
    question:
      "При напряжении u(t)=100 sin(314t) В и значении XC, равной 50 Ом,\nдействующее значение тока i(t) равно ###",
    opts: [
      ["1,41 А", true],
      ["0,5 А", false],
      ["2 А", false],
      ["0,707 А", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "Активную мощность P цепи синусоидального тока можно определить по\nформуле…",
    opts: [
      ["P=UIcosφ +", true],
      ["P=UIsinφ", false],
      ["P=UItgφ", false],
      ["P=UIcosφ+UIsinφ", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "Выберите один вариант ответа:",
    question:
      "Коэффициентом мощности электрической цепи синусоидального тока\nназывается ###",
    opts: [
      ["отношение активной мощности Р к полной мощности S", true],
      ["отношение реактивной мощности Q к полной мощности S", false],
      ["отношение полной мощности S к активной мощности Р", false],
      ["отношение активной мощности Р к реактивной мощности Q", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "Выберите один вариант ответа:",
    question: "Полная мощность цепи однофазного синусоидального тока, это ###",
    opts: [
      ["S=IU", true],
      ["P=IUcosφ", false],
      ["Q=IUsinφ", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "Единицей измерения реактивной мощности Q цепи синусоидального тока\nявляется…",
    opts: [
      ["Вар", true],
      ["ВА", false],
      ["Вт", false],
      ["Дж", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "Выберите один вариант ответа:",
    question: "Условие возникновения резонанса напряжений ###",
    opts: [
      ["XL = XC", true],
      ["L=C", false],
      ["U r  U L  UC", false],
      ["I=U", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "Выберите один вариант ответа:",
    question: "В какой из цепей может возникнуть резонанс токов?",
    opts: [
      ["", true],
      ["", false],
      ["", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "Выберите один вариант ответа:",
    question: "Какой из графиков соответствует резонансу токов?",
    opts: [
      ["", true],
      ["", false],
      ["", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "Критерием возникновения резонансного явления в цепи, содержащей\nиндуктивные и емкостные элементы, является…",
    opts: [
      [
        "Равенство нулю угла сдвига фаз φ между напряжением и током на\nвходе цепи",
        true,
      ],
      [
        "Равенство  угла сдвига фаз φ между напряжением и током на входе\nцепи",
        false,
      ],
      ["Равенство нулю активного сопротивления цепи R", false],
      ["Равенство L и C", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "В трехфазной цепи нагрузка соединена по схеме «звезда», фазное\nнапряжение 380 В, линейное напряжение равно…",
    opts: [
      ["660 В", true],
      ["380 В", false],
      ["220 В", false],
      ["127 В", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "В трехфазной цепи вольтметром было замерено напряжение 380 В,\nлинейное напряжение Uab равно…",
    opts: [
      ["660 В", true],
      ["127 В", false],
      ["220 В", false],
      ["380 В", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "В симметричной трехфазной системе напряжений прямой\nпоследовательности вектор напряжения Uc сдвинут относительно вектора Ub\nна угол, равный…",
    opts: [
      ["-120о", true],
      ["-90о", false],
      ["-45о", false],
      ["-60о", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "Определить линейный ток I A для данной схемы, если U л  380 B ; xL  10Ом ;\nxC  10Ом\nA\nxL\nN\nRс\nxC\nC\nB\n",
    opts: [
      ["22  e  j 90 ; A", true],
      ["38  e  j 90 ; A\n\nxL", false],
      ["38 A", false],
      ["22 A", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "Определить линейный ток I A для данной схемы, если U л  380 B ;\nxL  100Ом ; xC  10Ом\nA\nxL\nN\nRс\nxL\nxC\nC\nB",
    opts: [
      ["2,2  e  j 90 ; A", true],
      ["3,8 A", false],
      ["2,2 A", false],
      ["3,8  e  j 90 ; A", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "Определить линейный ток I A для данной схемы, если U л  380 B ; xL  20Ом ;\n\n\nxC  10Ом\nA\nxL\nN\nRс\nxL\nxC\nC\nB\n",
    opts: [
      ["11  e  j 90 ; A", true],
      ["11A", false],
      ["19  e  j 90 ; A", false],
      ["19 A", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "Определить линейный ток I A для данной схемы, если U л  380 B ;\nxL  200Ом ; xC  10Ом\n\nA\nxL\nN\nRс\nxL\nxC\nC\nB\n",
    opts: [
      ["1,1A", true],
      ["1,9  e  j 90 ; A", false],
      ["1,9 A", false],
      ["1,1  e  j 90 ; A", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "Определить линейный ток I A для данной схемы, если U л  380 B ; xL  50Ом ;\n\nxC  10Ом\nA\nxL\nN\nRс\nxL\nxC\nC\nB",
    opts: [
      ["4,4 A", true],
      ["7,6 A", false],
      ["4,4  e  j 90 ; A", false],
      ["7,6  e  j 90 ; A", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "Определить линейный ток I A для данной схемы, если U л  220B ;\nRb  xL  xC  20Ом ; Ra  10Ом\n\n\nA\nRa\nRb\nN\nxC\nC\nB",
    opts: [
      ["12,7 A", true],
      ["22 A\nxL", false],
      ["12,7  2 A", false],
      ["11A", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "Определить линейный ток I A для данной схемы, если U л  220B ;\nRb  xL  xC  20Ом ; Ra  100 Ом\nA\nRa\nRb\nN\nxL\nxC\nC\nB",
    opts: [
      ["1,27 A", true],
      ["2,2 A", false],
      ["2,2  2 A", false],
      ["1,27  2 A", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "Определить линейный ток I A для данной схемы, если U л  220B ;\nRb  xL  xC  20Ом ; Ra  50Ом\nA\nRa\nRb\nN\nxC\nxL\nC\nB",
    opts: [
      ["2,54 A", true],
      ["4,4 A", false],
      ["4,4  2 A", false],
      ["2,54  2 A", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "Определить линейный ток I A для данной схемы, если U л  220B ;\nRb  xL  xC  20Ом ; Ra  200Ом\nA\nRa\nRb\nN\nxL\nxC\nC\nB",
    opts: [
      ["0,635 A", true],
      ["1,1A", false],
      ["1,1  2 A", false],
      ["0,635  2 A", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "Определить линейный ток I A для данной схемы, если U л  220B ;\nRb  xL  xC  20Ом ; Ra  20Ом\nA\nRa\nRb\nN\nxL\nxC\nC\nB",
    opts: [
      ["6,35 A", true],
      ["11A", false],
      ["6,35  2 A", false],
      ["11/ 2 A", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "Определить линейный ток I A данной схемы, если Rab  Rbc  Rca ; I ab  20 A\n\nIA\nA\nRca\n\nI ab\nC\nRbc\nB",
    opts: [
      ["20  3 A\nRab", true],
      ["40 A", false],
      ["20  2 A", false],
      ["20 / 3 A", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "Определить линейный ток I A данной схемы, если Rab  Rbc  Rca ; I ab  10 A\n\nIA\nA\nRca\n\nRab\nI ab\nC\nRbc\nB",
    opts: [
      ["3  10 A", true],
      ["20 A", false],
      ["10 / 3 A", false],
      ["10 2 A", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "Определить линейный ток I A данной схемы, если Rab  Rbc  Rca ; I ab  30 A\n\nIA\nA\nRca\n\nRab\nI ab\nC\nRbc\nB",
    opts: [
      ["3  30 A", true],
      ["60 A", false],
      ["30  2 A", false],
      ["30 / 3 A", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "Определить линейный ток I A данной схемы, если Rab  Rbc  Rca ; I ab  50 A\n\nIA\nA\nRca\n\nI ab\nC\nRbc\nB",
    opts: [
      ["50  3 A", true],
      ["100 A\nRab", false],
      ["50 / 3 A", false],
      ["50 2 A", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "Определить линейный ток I A данной схемы, если Rab  Rbc  Rca ; I ab  25 A\n\nIA\nA\nRca\n\nRab\nI ab\nC\nRbc\nB",
    opts: [
      ["3  25 A", true],
      ["50 A", false],
      ["25 / 3 A", false],
      ["25 / 2 A", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "Определить линейный ток I A данной схемы, если Rab  Rbc  Rca ; I ab  5 A\n\nIA\nA\nRca\n\nRab\nI ab\nC\nRbc\nB",
    opts: [
      ["3  5 A", true],
      ["2  5 A", false],
      ["10 A", false],
      ["5 / 3 A", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "Определить линейный ток I A данной схемы, если Rab  Rbc  Rca ; I ab  15 A\n\nIA\nA\nRca\n\nRab\nI ab\nC\nRbc\nB",
    opts: [
      ["3  15 A", true],
      ["30 A", false],
      ["15 A", false],
      ["2  15 A", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "Определить линейный ток I A данной схемы, если Rab  Rbc  Rca ; I ab  8 A\n\nIA\nA\nRca\n\nRab\nI ab\nC\nRbc\nB",
    opts: [
      ["3  8 A", true],
      ["16 A", false],
      ["8 A", false],
      ["8 / 3 A", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет линейных цепей переменного тока",
    task: "",
    question:
      "Определить линейный ток I A данной схемы, если Rab  Rbc  Rca ; I ab  3 A\n\nIA\nA\nRca\n\nI ab\nC\nRbc\nB",
    opts: [
      ["3  3 A", true],
      ["3A", false],
      ["6 A", false],
      ["3 / 2 A", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет магнитных цепей",
    task: "",
    question:
      "Определить линейный ток I A данной схемы, если Rab  Rbc  Rca ; I ab  12 A\n\nIA\nA\nRca\n\nRab\nI ab\nC\nRbc\nB",
    opts: [
      ["3  12 A", true],
      ["24 A", false],
      ["12 A", false],
      ["2  12 A", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет магнитных цепей",
    task: "",
    question:
      "Если потери мощности в активном сопротивлении провода катушки со\nстальным сердечником PR=2 Вт, потери мощности на гистерезис PГ=12 Вт, на\nвихревые токи PВ=20 Вт, то показания ваттметра составляет…",
    opts: [
      ["34 Вт", true],
      ["32 Вт", false],
      ["14 Вт", false],
      ["22 Вт", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет магнитных цепей",
    task: "",
    question:
      "Основной кривой намагничивания ферромагнитных материалов\nназывается…",
    opts: [
      [
        "Геометрическое место вершин симметричных частных петель\nгистерезиса и предельной гистерезисной петли",
        true,
      ],
      ["Кривая первоначального намагничивания", false],
      ["Частная петля гистерезиса зависимости В(Н)", false],
      ["Предельная петля гистерезиса зависимости В(Н)", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет магнитных цепей",
    task: "",
    question: "Величиной, имеющей размерность А/м, является…",
    opts: [
      ["Напряженность магнитного поля Н", true],
      ["Напряженность электрического поля Е", false],
      ["Магнитный поток Ф", false],
      ["Магнитная индукция В", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет магнитных цепей",
    task: "",
    question:
      "Если при неизменном токе I, числе витков w, площади S поперечного\nсечения и длине l магнитопровода (сердечник не насыщен), увеличить\nвоздушный зазор , то магнитный поток Ф…",
    opts: [
      ["Уменьшится", true],
      ["Не изменится", false],
      ["Не хватает данных", false],
      ["Увеличится", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет магнитных цепей",
    task: "",
    question: "Отрезок в-г основной кривой намагничивания В(Н) соответствуют…",
    opts: [
      ["Участку насыщения ферромагнетика +", true],
      ["Участку интенсивного намагничивания ферромагнетика", false],
      ["Размагниченному состоянию ферромагнетика", false],
      ["Участку начального намагничивания ферромагнетика", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет магнитных цепей",
    task: "",
    question:
      "Если при неизменной амплитуде напряжения Um, питающего катушку со\nстальным сердечником, уменьшить его частоту, то потери мощности в\nмагнитопроводе…",
    opts: [
      ["Уменьшатся +", true],
      ["Не изменятся", false],
      ["Не хватает данных", false],
      ["Увеличатся\n№42номер вопроса: К=С", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет магнитных цепей",
    task: "",
    question:
      "Магнитодвижущую силу (МДС) вдоль магнитной цепи можно представить\nв виде…",
    opts: [
      ["Iw=Hферlфер+Нδδ +", true],
      ["Iw=Hфер/lфер+Нδ/δ", false],
      ["Iw=Фlфер+Фδ", false],
      ["Iw=HферS+НδS", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет магнитных цепей",
    task: "",
    question: "При описании магнитного поля используется величина…",
    opts: [
      ["Магнитного потока Ф +", true],
      ["Напряженности электрического поля Е", false],
      ["Электрического смещения D", false],
      ["Диэлектрической постоянной ε0", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет магнитных цепей",
    task: "",
    question:
      "Если напряжение, приложенное к катушке с ферромагнитным сердечником\nu=Umsinωt, число витков в катушки равно w, то, пренебрегая рассеянием и\nактивным сопротивлением катушки, можно принять, что амплитуда\nмагнитного потока в сердечнике…",
    opts: [
      ["", true],
      ["", false],
      ["", false],
      ["", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет магнитных цепей",
    task: "",
    question:
      "Ферромагнитные материалы принято разделять на магнитно-мягкие и\nмагнито-твердые по величине…",
    opts: [
      ["Коэрцитивной силы HC", true],
      ["Индукции насыщения BS", false],
      ["Абсолютной магнитной проницаемости a", false],
      ["Остаточной индукции Br", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет магнитных цепей",
    task: "",
    question:
      "Если при неизменной амплитуде Um увеличить частоту синусоидального\nнапряжения, питающего катушку со стальным сердечником, то потери\nмощности в магнитопроводе…",
    opts: [
      ["Уменьшатся", true],
      ["Не изменятся", false],
      ["Не хватает данных", false],
      ["Увеличатся", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет магнитных цепей",
    task: "",
    question: "Абсолютной магнитной проницаемостью a является величина…",
    opts: [
      ["310-3 Гн/м", true],
      ["800 А/м", false],
      ["0,7 Тл", false],
      ["0,310-3 Вб", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет магнитных цепей",
    task: "",
    question:
      "Если при неизменном токе I, числе витков w, площади S поперечного\nсечения уменьшить длину l магнитопровода (сердечник не насыщен), то\nмагнитный поток Ф…",
    opts: [
      ["Уменьшится", true],
      ["Не изменится", false],
      ["Не хватает данных", false],
      ["Увеличится", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет магнитных цепей",
    task: "",
    question:
      "На эквивалентной последовательной схеме замещения катушки с\nферромагнитным сердечником потери в проводе катушки учитывает\nэлемент…",
    opts: [
      ["R", true],
      ["R0", false],
      ["Xp", false],
      ["X0", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет магнитных цепей",
    task: "",
    question: "К ферромагнитным материалам относится…",
    opts: [
      ["Электротехническая сталь", true],
      ["Электротехническая медь", false],
      ["Алюминий", false],
      ["Чугун", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет магнитных цепей",
    task: "",
    question: "Величиной, имеющей размерность Гн/м, является…",
    opts: [
      ["Абсолютная магнитная проницаемость a", true],
      ["Напряженность магнитного поля Н", false],
      ["Магнитный поток Ф", false],
      ["Магнитная индукция В", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет магнитных цепей",
    task: "Выберите один вариант ответа:",
    question:
      "Если увеличить амплитуду синусоидального напряжения U m на катушке со\nстальным сердечником (магнитопровод не насыщен), то амплитуда\nмагнитной индукции в сердечнике Bm ###",
    opts: [
      ["увеличится", true],
      ["не хватает данных", false],
      ["уменьшится", false],
      ["не изменится", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет магнитных цепей",
    task: "Выберите один вариант ответа:",
    question:
      "Если потери мощности в активном сопротивлении провода катушки со\nстальным сердечником Pr = 2 Вт, потери мощности на гистерезис Pr = 12 Вт,\nна вихревые токи Pr = 20 Вт, то показание ваттметра составляет ###",
    opts: [
      ["34 Вт", true],
      ["14 Вт", false],
      ["22 Вт", false],
      ["32 Вт", false],
      ["2 Вт", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет магнитных цепей",
    task: "Выберите один вариант ответа:",
    question:
      "На эквивалентной последовательной схеме замещения катушки с\nферромагнитным сердечником потери в проводе катушки учитывает элемент\n###\n1",
    opts: [
      ["r1", true],
      ["r0", false],
      ["X0", false],
      ["X1", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет магнитных цепей",
    task: "",
    question: "Магнитодвижущая сила в витках обмотки определяется:",
    opts: [
      ["F  Iw", true],
      ["F  IФ", false],
      ["F  I w", false],
      ["F  w I", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет магнитных цепей",
    task: "",
    question:
      "Величина относительной магнитной проницаемости ферромагнитных\nматериалов:",
    opts: [
      ["r  1", true],
      ["r  1 ;", false],
      ["r  0 ;", false],
      ["r  1;", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет магнитных цепей",
    task: "",
    question:
      "Если при неизменном магнитном потоке Ф увеличить площадь\nпоперечного сечения S магнитопровода, то магнитная индукция В…",
    opts: [
      ["увеличится,", true],
      ["уменьшится,", false],
      ["не изменится,", false],
      ["не хватает данных", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет магнитных цепей",
    task: "",
    question:
      "Если площадь 1 – потери на гистерезис за один цикл перемагничивания, а\nплощади 2 – потери на вихревые токи за один цикл перемагничивания, то\nзамкнутая кривая «в» представляет …",
    opts: [
      ["статическую петлю гистерезиса,", true],
      ["динамическую петлю гистерезиса,", false],
      ["кривую первоначального намагничивания,", false],
      ["основную кривую намагничивания", false],
    ],
  },
  {
    type: "single",
    theme: "Анализ и расчет магнитных цепей",
    task: "",
    question: "Величиной, имеющей размерность Гн/м является …",
    opts: [
      ["абсолютная магнитная проницаемость µа", true],
      ["магнитный поток Ф,", false],
      ["магнитная индукция В,", false],
      ["напряженность магнитного поля Н,", false],
    ],
  },
  {
    type: "single",
    theme:
      "Электромагнитные устройства, электрические машины, основы электропривода и электроснабжения",
    task: "",
    question:
      "Зависимость магнитной индукции В от напряженности магнитного поля Н,\nописываемая замкнутой кривой б-в-г-а, называется …",
    opts: [
      ["предельной петлей гистерезиса,", true],
      ["основной кривой намагничивания,", false],
      ["частной петлей гистерезиса,", false],
      ["кривой первоначального намагничивания", false],
    ],
  },
  {
    type: "single",
    theme:
      "Электромагнитные устройства, электрические машины, основы электропривода и электроснабжения",
    task: "",
    question:
      "Если напряжение первичной обмотки однофазного трансформатора U1=380\nВ, а напряжение вторичной обмотки U2=100 В, то приближенный\nкоэффициент трансформации составит…",
    opts: [
      ["3,8", true],
      ["280", false],
      ["0,263", false],
      ["38000", false],
    ],
  },
  {
    type: "single",
    theme:
      "Электромагнитные устройства, электрические машины, основы электропривода и электроснабжения",
    task: "",
    question:
      "Трансформатор работает в режиме:\n*\nЛАТр\na\nA\nA 1 * W1\n220 B\nA2\nV1\nx\nX",
    opts: [
      ["короткого замыкания", true],
      ["холостого хода", false],
      ["режим под нагрузкой", false],
      ["номинальный режим", false],
    ],
  },
  {
    type: "single",
    theme:
      "Электромагнитные устройства, электрические машины, основы электропривода и электроснабжения",
    task: "",
    question:
      "Трансформатор работает в режиме:\nЛАТр\n*\nA 1 * W1\n220 B\nA\na\nV1\nV2\nX\nx",
    opts: [
      ["холостого хода", true],
      ["короткого замыкания", false],
      ["режим под нагрузкой", false],
      ["номинальный режим", false],
    ],
  },
  {
    type: "single",
    theme:
      "Электромагнитные устройства, электрические машины, основы электропривода и электроснабжения",
    task: "",
    question: "Трансформатор работает в режиме:",
    opts: [
      ["режим под нагрузкой", true],
      ["холостого хода", false],
      ["короткого замыкания", false],
      ["не достаточно данных", false],
    ],
  },
  {
    type: "single",
    theme:
      "Электромагнитные устройства, электрические машины, основы электропривода и электроснабжения",
    task: "",
    question: "При работе трансформатора отсутствуют потери мощности:",
    opts: [
      ["механические потери", true],
      ["электрические потери в обмотках", false],
      ["потери в стали на гистерезис и вихревые токи", false],
    ],
  },
  {
    type: "single",
    theme:
      "Электромагнитные устройства, электрические машины, основы электропривода и электроснабжения",
    task: "",
    question:
      "В опыте холостого хода трансформатора показание ваттметра pW1 равно…",
    opts: [
      ["Потерям в магнитопроводе", true],
      ["Нулю", false],
      ["Потерям в обмотках", false],
      ["Суммарным потерям в трансформаторе", false],
    ],
  },
  {
    type: "single",
    theme:
      "Электромагнитные устройства, электрические машины, основы электропривода и электроснабжения",
    task: "",
    question: "Опыт холостого хода трансформатора проводится при…",
    opts: [
      [
        "Разомкнутой вторичной обмотке и номинальном напряжении на\nпервичной обмотке",
        true,
      ],
      ["Номинальных токах и напряжениях", false],
      [
        "Разомкнутой вторичной обмотке и пониженном напряжении на\nпервичной обмотке",
        false,
      ],
      ["Замкнутой на коротко вторичной обмотке и номинальных токах", false],
    ],
  },
  {
    type: "single",
    theme:
      "Электромагнитные устройства, электрические машины, основы электропривода и электроснабжения",
    task: "",
    question:
      "В цепи обмотка якоря двигателя постоянного тока с параллельным\nвозбуждением устанавливается пусковой реостат для…",
    opts: [
      ["Уменьшения пускового тока", true],
      ["Увеличения частоты вращения", false],
      ["Увеличения потока возбуждения", false],
      ["Уменьшения потока возбуждения", false],
    ],
  },
  {
    type: "single",
    theme:
      "Электромагнитные устройства, электрические машины, основы электропривода и электроснабжения",
    task: "",
    question:
      "В цепи обмотки якоря двигателя постоянного тока с параллельным\nвозбуждением устанавливается пусковой реостат для…",
    opts: [
      ["Уменьшения пускового тока", true],
      ["Увеличения частоты вращения", false],
      ["Увеличения потока возбуждения", false],
      ["Уменьшения потока возбуждения", false],
    ],
  },
  {
    type: "single",
    theme:
      "Электромагнитные устройства, электрические машины, основы электропривода и электроснабжения",
    task: "",
    question:
      "В цепи обмотки якоря двигателя постоянного тока с независимым\nвозбуждением устанавливается пусковой реостат для…",
    opts: [
      ["Уменьшения пускового тока", true],
      ["Увеличения частоты вращения", false],
      ["Увеличения потока возбуждения", false],
      ["Уменьшения потока возбуждения", false],
    ],
  },
  {
    type: "single",
    theme:
      "Электромагнитные устройства, электрические машины, основы электропривода и электроснабжения",
    task: "",
    question:
      "В цепи обмотки якоря двигателя постоянного тока с независимым\nвозбуждением устанавливается пусковой реостат для…",
    opts: [
      ["Уменьшения пускового тока +", true],
      ["Увеличения частоты вращения", false],
      ["Увеличения потока возбуждения", false],
      ["Уменьшения потока возбуждения", false],
    ],
  },
  {
    type: "single",
    theme:
      "Электромагнитные устройства, электрические машины, основы электропривода и электроснабжения",
    task: "",
    question:
      "Величину момента двигателя постоянного тока определяет выражение…",
    opts: [
      ["", true],
      ["", false],
      ["", false],
      ["", false],
    ],
  },
  {
    type: "single",
    theme:
      "Электромагнитные устройства, электрические машины, основы электропривода и электроснабжения",
    task: "",
    question: "ЭДС машины постоянного тока определяется по формуле…",
    opts: [
      ["E=CEФn", true],
      ["E=CEnIЯ", false],
      ["E=CEФIВ", false],
      ["E=IЯRЯ", false],
    ],
  },
  {
    type: "single",
    theme:
      "Электромагнитные устройства, электрические машины, основы электропривода и электроснабжения",
    task: "",
    question: "Дополнительные полюсы в МПТ служат для:",
    opts: [
      ["снижения реакции якоря,", true],
      ["создания главного магнитного потока", false],
      ["регулирования частоты вращения", false],
      ["пуска машины", false],
    ],
  },
  {
    type: "single",
    theme:
      "Электромагнитные устройства, электрические машины, основы электропривода и электроснабжения",
    task: "",
    question: "Основной магнитный поток в МПТ создается:",
    opts: [
      ["обмоткой возбуждения", true],
      ["обмоткой якоря", false],
      ["обмоткой дополнительных полюсов", false],
      ["щеточно-коллекторным узлом", false],
    ],
  },
  {
    type: "single",
    theme:
      "Электромагнитные устройства, электрические машины, основы электропривода и электроснабжения",
    task: "",
    question:
      "Режиму максимальной нагрузки асинхронного двигателя соответствует\nточка механической характеристики номер…",
    opts: [
      ["3", true],
      ["2", false],
      ["4", false],
      ["1", false],
    ],
  },
  {
    type: "single",
    theme:
      "Электромагнитные устройства, электрические машины, основы электропривода и электроснабжения",
    task: "",
    question:
      "Номинальному режиму асинхронного двигателя соответствует точка\nмеханической характеристики номер…",
    opts: [
      ["2", true],
      ["4", false],
      ["3", false],
      ["1", false],
    ],
  },
  {
    type: "single",
    theme:
      "Электромагнитные устройства, электрические машины, основы электропривода и электроснабжения",
    task: "",
    question:
      "Частота вращения магнитного поля статора асинхронного двигателя и\nчастота вращения ротора связаны соотношением…",
    opts: [
      ["n1  n2", true],
      ["n1 = n2", false],
      ["n1 + n2 = 0", false],
      ["n1  n2", false],
    ],
  },
  {
    type: "single",
    theme:
      "Электромагнитные устройства, электрические машины, основы электропривода и электроснабжения",
    task: "",
    question:
      "Режиму максимальной нагрузки асинхронного двигателя соответствует\nточка механической характеристики номер…",
    opts: [
      ["3", true],
      ["2", false],
      ["4", false],
      ["1", false],
    ],
  },
  {
    type: "single",
    theme:
      "Электромагнитные устройства, электрические машины, основы электропривода и электроснабжения",
    task: "",
    question: "К асинхронным относятся двигатели, у которых…",
    opts: [
      [
        "Скорость вращения ротора меньше скорости вращения магнитного\nполя статора",
        true,
      ],
      [
        "Скорость вращения ротора равно скорости вращения магнитного\nполя статора",
        false,
      ],
      [
        "Скорость вращения ротора больше скорости вращения магнитного\nполя статора",
        false,
      ],
      [
        "Скорость вращения ротора не зависит от скорости вращения\nмагнитного поля статора",
        false,
      ],
    ],
  },
  {
    type: "single",
    theme:
      "Электромагнитные устройства, электрические машины, основы электропривода и электроснабжения",
    task: "",
    question:
      "Скольжение АД определяется по формуле ( n0 -скорось вращения\nмагнитного поля, n – скорость вращения ротора):\nn n\n;\nn",
    opts: [
      ["s  n0  n ;\nn0\nn  n0", true],
      ["s \nn0\nn  n0", false],
      ["s \nn0", false],
      ["s  0", false],
    ],
  },
  {
    type: "single",
    theme:
      "Электромагнитные устройства, электрические машины, основы электропривода и электроснабжения",
    task: "",
    question: "Проводники ротора в виде «беличьей клетки» используются в:",
    opts: [
      ["АД с КЗР", true],
      ["ДПТ", false],
      ["АД с ФР", false],
      ["СМ", false],
    ],
  },
  {
    type: "single",
    theme:
      "Электромагнитные устройства, электрические машины, основы электропривода и электроснабжения",
    task: "",
    question:
      "В цепь обмотки ротора АД с контактными кольцами вводят добавочное\nсопротивление при пуске для:",
    opts: [
      ["уменьшения пускового тока", true],
      ["уменьшения пускового момента", false],
      ["уменьшения времени разбега", false],
      ["увеличения пускового тока", false],
    ],
  },
  {
    type: "single",
    theme:
      "Электромагнитные устройства, электрические машины, основы электропривода и электроснабжения",
    task: "",
    question: "В момент пуска асинхронного двигателя скольжение s будет:",
    opts: [
      ["s  1", true],
      ["s  0", false],
      ["s  0", false],
      ["s  0", false],
    ],
  },
  {
    type: "single",
    theme:
      "Электромагнитные устройства, электрические машины, основы электропривода и электроснабжения",
    task: "",
    question: "Пуску асинхронного двигателя с КЗР не соответствует:",
    opts: [
      ["реостатный", true],
      ["прямой", false],
      ["при пониженном напряжении", false],
    ],
  },
  {
    type: "single",
    theme:
      "Электромагнитные устройства, электрические машины, основы электропривода и электроснабжения",
    task: "",
    question: "Для изменения направления вращения ротора АД необходимо:",
    opts: [
      ["поменять местами два линейных провода обмотки статора", true],
      ["поменять местами три линейных провода обмотки статора", false],
      ["разомкнуть одну из фаз обмотки статора", false],
      ["подключить регулировочный реостат", false],
    ],
  },
  {
    type: "single",
    theme:
      "Электромагнитные устройства, электрические машины, основы электропривода и электроснабжения",
    task: "",
    question:
      "Частота ЭДС, создаваемой на статоре синхронной машины, определяется\nсоотношением...",
    opts: [
      ["", true],
      ["", false],
      ["", false],
      ["", false],
    ],
  },
  {
    type: "single",
    theme:
      "Электромагнитные устройства, электрические машины, основы электропривода и электроснабжения",
    task: "",
    question:
      "Если скорость вращения поля статора синхронной четырехполюсной\nмашины 1500 об/мин, то номинальная скорость вращения ротора…",
    opts: [
      ["1500 об/мин", true],
      ["3000 об/мин", false],
      ["1000 об/мин", false],
      ["2940 об/мин", false],
    ],
  },
  {
    type: "single",
    theme:
      "Электромагнитные устройства, электрические машины, основы электропривода и электроснабжения",
    task: "",
    question: "На рисунке изображены роторы электрических двигателей…",
    opts: [
      [
        "а - явнополюсный ротор синхронного двигателя\nб - неявнополюсный ротор синхронного двигателя",
        true,
      ],
      [
        "а – якорь двигателя постоянного тока\nб - неявнополюсный ротор синхронного двигателя",
        false,
      ],
      [
        "а - неявнополюсный ротор синхронного двигателя\nб - явнополюсный ротор синхронного двигателя",
        false,
      ],
      [
        "а - явнополюсный ротор синхронного двигателя\nб - короткозамкнутый ротор асинхронного двигателя",
        false,
      ],
    ],
  },
  {
    type: "single",
    theme:
      "Электромагнитные устройства, электрические машины, основы электропривода и электроснабжения",
    task: "",
    question:
      "Частота вращения магнитного поля синхронной машины n0 и частота\nвращения ротора n связаны соотношением…",
    opts: [
      ["n0 = n", true],
      ["n0  n", false],
      ["n0  n", false],
      ["n0 – n = n5", false],
    ],
  },
  {
    type: "single",
    theme:
      "Электромагнитные устройства, электрические машины, основы электропривода и электроснабжения",
    task: "",
    question:
      "Вращающееся магнитное поле синхронного двигателя создается при\nвыполнении следующих условий…",
    opts: [
      [
        "Обмотки статора сдвинуты по поверхности статора на 120О и\nподключены к трехфазной сети с фазовым сдвигом напряжений на 120О",
        true,
      ],
      [
        "Имеется одна обмотка, которая включена в сеть однофазного\nпеременного тока",
        false,
      ],
      [
        "Обмотки статора сдвинуты по поверхности статора на 120О и\nподключены к цепи постоянного тока",
        false,
      ],
      [
        "Обмотка статора включена в цепь постоянного тока, а обмотка\nротора в сеть трехфазного тока",
        false,
      ],
    ],
  },
  {
    type: "single",
    theme:
      "Электромагнитные устройства, электрические машины, основы электропривода и электроснабжения",
    task: "",
    question:
      "Частота вращения магнитного поля синхронной машины n0  1500 об/мин,\nтогда частота вращения ротора:",
    opts: [
      ["n  1500 об/мин;", true],
      ["n  3000 об/мин;", false],
      ["n  750 об/мин;", false],
      ["n  1000 об/мин;", false],
    ],
  },
  {
    type: "single",
    theme:
      "Электромагнитные устройства, электрические машины, основы электропривода и электроснабжения",
    task: "",
    question:
      "Частота вращения магнитного поля синхронной машины n  3000 об/мин.\nОпределить число пар полюсов p, если f = 50 Гц",
    opts: [
      ["p = 1", true],
      ["p = 2", false],
      ["p = 3", false],
      ["p = 4", false],
    ],
  },
  {
    type: "single",
    theme: "Основы электроники и электрические измерения",
    task: "",
    question:
      "Частота вращения магнитного поля синхронной машины n0  3000 об/мин,\nтогда частота вращения ротора:",
    opts: [
      ["n  3000 об/мин;", true],
      ["n  1500 об/мин;", false],
      ["n  750 об/мин;", false],
      ["n  1000 об/мин;", false],
    ],
  },
  {
    type: "single",
    theme: "Основы электроники и электрические измерения",
    task: "",
    question: "На рисунке изображена структура",
    opts: [
      ["Диодного тиристора", true],
      ["Триодного тиристора", false],
      ["Полевого транзистора", false],
      ["Стабилитрона", false],
    ],
  },
  {
    type: "single",
    theme: "Основы электроники и электрические измерения",
    task: "",
    question: "На рисунке изображена вольтамперная характеристика…",
    opts: [
      ["Диодного тиристора", true],
      ["Триодного тиристора", false],
      ["Полевого транзистора", false],
      ["Биполярного транзистора", false],
    ],
  },
  {
    type: "single",
    theme: "Основы электроники и электрические измерения",
    task: "",
    question: "На рисунке изображена вольтамперная характеристика…",
    opts: [
      ["Тиристора", true],
      ["Биполярного транзистора", false],
      ["Выпрямительного диода", false],
      ["Полевого транзистора", false],
    ],
  },
  {
    type: "single",
    theme: "Основы электроники и электрические измерения",
    task: "",
    question: "На рисунке изображен…",
    opts: [
      ["Полевой транзистор", true],
      ["Выпрямительный диод", false],
      ["Полевой транзистор с управляющим p-n переходом", false],
      ["Диодный тиристор", false],
    ],
  },
  {
    type: "single",
    theme: "Основы электроники и электрические измерения",
    task: "",
    question: "У биполярных транзисторов средний слой называют…",
    opts: [
      ["Базой", true],
      ["Анодом", false],
      ["Катодом", false],
      ["Заземлением", false],
    ],
  },
  {
    type: "single",
    theme: "Основы электроники и электрические измерения",
    task: "",
    question: "На рисунке изображено условное обозначение …",
    opts: [
      ["биполярного транзистора", true],
      ["полевого транзистора", false],
      ["тиристора", false],
      ["диода", false],
    ],
  },
  {
    type: "single",
    theme: "Основы электроники и электрические измерения",
    task: "",
    question:
      "Двухполупериодной мостовой схеме выпрямления соответствует\nвременная диаграмма напряжения…",
    opts: [
      ["", true],
      ["", false],
      ["", false],
      ["", false],
    ],
  },
  {
    type: "single",
    theme: "Основы электроники и электрические измерения",
    task: "",
    question:
      "Приведены временные диаграммы напряжения на входе (а) и выходе\nустройства (б). Данное устройство…",
    opts: [
      ["Сглаживающий фильтр", true],
      ["Стабилизатор напряжения", false],
      ["Выпрямитель", false],
      ["Трансформатор", false],
    ],
  },
  {
    type: "single",
    theme: "Основы электроники и электрические измерения",
    task: "",
    question:
      "Приведены временные диаграммы напряжения на входе (а) и выходе\nустройства (б). Данное устройство…",
    opts: [
      ["Двухполупериодный мостовой выпрямитель +", true],
      ["Трехфазный выпрямитель", false],
      ["Стабилизатор напряжения", false],
      ["Сглаживающий фильтр", false],
    ],
  },
  {
    type: "single",
    theme: "Основы электроники и электрические измерения",
    task: "",
    question:
      "Схема включения транзистора с общим коллектором соответствует\nрисунок…",
    opts: [
      ["", true],
      ["", false],
      ["", false],
      ["", false],
    ],
  },
  {
    type: "single",
    theme: "Основы электроники и электрические измерения",
    task: "",
    question: "На графике ƒ1 определяет для усилителя…",
    opts: [
      ["Нижнюю граничную частоту усиления ?", true],
      ["Верхнюю граничную частоту нелинейных искажений", false],
      ["Нижнюю граничную частоту нелинейных искажений", false],
      ["Верхнюю граничную частоту усиления", false],
    ],
  },
  {
    type: "single",
    theme: "Основы электроники и электрические измерения",
    task: "",
    question: "На рисунке приведена схема…",
    opts: [
      ["Усилителя на биполярном транзисторе", true],
      ["Усилителя на полевом транзисторе", false],
      ["Однополупериодного выпрямителя", false],
      ["Делителя напряжения", false],
    ],
  },
  {
    type: "single",
    theme: "Основы электроники и электрические измерения",
    task: "",
    question: "На графике ƒ2 определяет для усилителя…",
    opts: [
      ["Верхнюю граничную частоту усиления", true],
      ["Нижнюю граничную частоту усиления", false],
      ["Верхнюю граничную частоту нелинейных искажений", false],
      ["Нижнюю граничную частоту нелинейных искажений", false],
    ],
  },
  {
    type: "single",
    theme: "Основы электроники и электрические измерения",
    task: "",
    question: "На рисунке изображен транзистор, включенный\nпо схеме",
    opts: [
      ["с общим эмиттером", true],
      ["с общим коллектором", false],
      ["с общей базой", false],
      ["с общим истоком", false],
    ],
  },
  {
    type: "single",
    theme: "Основы электроники и электрические измерения",
    task: "",
    question: "Максимальное усиление по мощности дает схема:",
    opts: [
      ["с общим эмиттером", true],
      ["с общим коллектором", false],
      ["с общей базой", false],
      ["с общим истоком", false],
    ],
  },
  {
    type: "single",
    theme: "Основы электроники и электрические измерения",
    task: "",
    question: "Максимальное усиление по току дает схема:",
    opts: [
      ["с общим коллектором", true],
      ["с общим эмиттером", false],
      ["с общей базой", false],
      ["с общим истоком", false],
    ],
  },
  {
    type: "single",
    theme: "Основы электроники и электрические измерения",
    task: "",
    question: "Максимальное усиление по напряжение дает схема:",
    opts: [
      ["с общей базой", true],
      ["с общим эмиттером", false],
      ["с общим коллектором", false],
      ["с общим истоком", false],
    ],
  },
  {
    type: "single",
    theme: "Основы электроники и электрические измерения",
    task: "",
    question:
      "Приведенной таблице истинности соответствует схема…\nx1\nx2\nY\n0\n0\n1\n1\n0\n1\n0\n1\n1\n1\n1\n0",
    opts: [
      ["", true],
      ["", false],
      ["", false],
      ["", false],
    ],
  },
  {
    type: "single",
    theme: "Основы электроники и электрические измерения",
    task: "",
    question:
      "Приведенная таблица истинности, соответствует элементу,\nвыполняющему операцию\nx1 x2 y\n0\n0\n1\n1\n0\n0\n0\n1\n0\n1\n1\n0",
    opts: [
      ["стрелка Пирса (ИЛИ-НЕ)", true],
      ["инверсия (НЕ),", false],
      ["умножение (И),", false],
      ["сложение (ИЛИ),", false],
    ],
  },
  {
    type: "single",
    theme: "Основы электроники и электрические измерения",
    task: "",
    question:
      "Приведенная таблица истинности, соответствует элементу,\nвыполняющему операцию\nx1 x2 y\n0\n0\n0\n1\n0\n1\n0\n1\n1\n1\n1\n1",
    opts: [
      ["сложение (ИЛИ),", true],
      ["инверсия (НЕ),", false],
      ["умножение (И),", false],
      ["стрелка Пирса (ИЛИ-НЕ)", false],
    ],
  },
  {
    type: "single",
    theme: "Основы электроники и электрические измерения",
    task: "",
    question:
      "Приведенная таблица истинности, соответствует элементу,\nвыполняющему операцию\nx1 x2 y\n0\n0\n0\n1\n0\n0\n0\n1\n0\n1\n1\n1",
    opts: [
      ["умножение (И),", true],
      ["инверсия (НЕ),", false],
      ["сложение (ИЛИ),", false],
      ["стрелка Пирса (ИЛИ-НЕ)", false],
    ],
  },
  {
    type: "single",
    theme: "Основы электроники и электрические измерения",
    task: "",
    question:
      "Приведенная таблица истинности, соответствует элементу,\nвыполняющему операцию\nx y\n0 1\n1 0",
    opts: [
      ["инверсия (НЕ),", true],
      ["умножение (И),", false],
      ["сложение (ИЛИ),", false],
      ["стрелка Пирса (ИЛИ-НЕ)", false],
    ],
  },
  {
    type: "single",
    theme: "Основы электроники и электрические измерения",
    task: "",
    question:
      "Приведенной таблице истинности соответствует схема…\nx1\nx2\nY\n0\n0\n0\n1\n0\n0\n0\n1\n0\n1\n1\n1",
    opts: [
      ["", true],
      ["", false],
      ["+", false],
      ["", false],
    ],
  },
  {
    type: "single",
    theme: "Основы электроники и электрические измерения",
    task: "",
    question:
      "Приведенной таблице истинности соответствует схема…\nx1\nx2\nY\n0\n0\n0\n1\n0\n1\n0\n1\n1\n1\n1\n1",
    opts: [
      ["", true],
      ["", false],
      ["", false],
      ["", false],
    ],
  },
  {
    type: "single",
    theme: "Основы электроники и электрические измерения",
    task: "",
    question: "Приведенная схема соответствует следующей логической операции:",
    opts: [
      ["сложение (ИЛИ),", true],
      ["инверсия (НЕ),", false],
      ["умножение (И),", false],
      ["стрелка Пирса (ИЛИ-НЕ)", false],
    ],
  },
  {
    type: "single",
    theme: "Основы электроники и электрические измерения",
    task: "",
    question: "Приведенная схема соответствует следующей логической операции:",
    opts: [
      ["умножение (И),", true],
      ["инверсия (НЕ),", false],
      ["сложение (ИЛИ),", false],
      ["стрелка Пирса (ИЛИ-НЕ)", false],
    ],
  },
  {
    type: "single",
    theme: "Основы электроники и электрические измерения",
    task: "",
    question: "Приведенная схема соответствует следующей логической операции:",
    opts: [
      ["стрелка Пирса (ИЛИ-НЕ)", true],
      ["инверсия (НЕ),", false],
      ["умножение (И),", false],
      ["сложение (ИЛИ),", false],
    ],
  },
  {
    type: "single",
    theme: "Основы электроники и электрические измерения",
    task: "",
    question: "На рисунке изображено условное обозначение",
    opts: [
      ["Стабилитрона", true],
      ["Диодного тиристора", false],
      ["Триодного тиристора", false],
      ["Полевого транзистора", false],
    ],
  },
  {
    type: "single",
    theme: "Основы электроники и электрические измерения",
    task: "",
    question: "На рисунке изображено условное обозначение",
    opts: [
      ["Диода", true],
      ["Триодного тиристора", false],
      ["Полевого транзистора", false],
      ["Стабилитрона", false],
    ],
  },
  {
    type: "single",
    theme: "Основы электроники и электрические измерения",
    task: "",
    question: "На рисунке изображено условное обозначение",
    opts: [
      ["Триодного тиристора", true],
      ["Диода", false],
      ["Полевого транзистора", false],
      ["Стабилитрона", false],
    ],
  },
  {
    type: "single",
    theme: "Основы электроники и электрические измерения",
    task: "",
    question:
      "Приведенная структурная схема x1+x2 соответствует следующей\nлогической операции:",
    opts: [
      ["сложение (ИЛИ),", true],
      ["инверсия (НЕ),", false],
      ["умножение (И),", false],
      ["стрелка Пирса (ИЛИ-НЕ)", false],
    ],
  },
  {
    type: "single",
    theme: "Основы электроники и электрические измерения",
    task: "",
    question:
      "Приведенная структурная схема x1*x2соответствует следующей логической\nоперации:",
    opts: [
      ["умножение (И),", true],
      ["инверсия (НЕ),", false],
      ["сложение (ИЛИ),", false],
      ["стрелка Пирса (ИЛИ-НЕ)", false],
    ],
  },
  {
    type: "single",
    theme: "Основы электроники и электрические измерения",
    task: "",
    question: "Приведенная структурная схема\nоперации:",
    opts: [
      ["инверсия (НЕ),\n, соответствует следующей логической", true],
      ["умножение (И),", false],
      ["сложение (ИЛИ),", false],
      ["стрелка Пирса (ИЛИ-НЕ)", false],
    ],
  },
  {
    type: "single",
    theme: "Основы электроники и электрические измерения",
    task: "",
    question: "Приведенная схема соответствует следующей структурной формуле:",
    opts: [
      ["x1+x2,", true],
      [",", false],
      ["x1*x2,", false],
      ["", false],
    ],
  },
  {
    type: "single",
    theme: "Основы электроники и электрические измерения",
    task: "",
    question: "0 < len(parts[0]) < MAX_TYPE_LEN",
    opts: [
      ["x1*x2,", true],
      [",", false],
      ["x1+x2,", false],
      ["", false],
    ],
  },
  {
    type: "single",
    theme: "",
    task: "",
    question: "Приведенная схема соответствует следующей структурой формуле:",
    opts: [
      ["", true],
      [",", false],
      ["x1*x2,", false],
      ["x1+x2,", false],
    ],
  },
];
