let questions = [
  {
    "type": "single",
    "theme": "k=b",
    "task": "",
    "question": "В сферу административно-правового регулирования входят отношения:",
    "vars": [
      "+: которые складываются по поводу и в связи с осуществлением исполнительной власти в процессе государственного управления;",
      "-: которые складываются по поводу и в связи с осуществлением законодательной власти в процессе государственного управления;",
      "-: которые складываются по поводу и в связи с осуществлением судебной власти в процессе государственного управления;",
      "-: все ответы верны;"
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "К юридическим признакам административного правонарушения не относится:",
    "vars": [
      "-: противоправность;",
      "-: виновность;",
      "-: наказуемость;",
      "+: общественная опасность;"
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "В состав административного правонарушения включаются:",
    "vars": [
      "- : объект;",
      "-: объективная сторона;",
      "-: субъективная сторона;",
      "+: все ответы верны;"
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Объективная сторона административного правонарушения – это:",
    "vars": [
      "-: права и свободы человека и гражданина;",
      "+: конкретные действия, выразившиеся в нарушении установленных административно-правовыми нормами правил;",
      "-: физические и юридические лица;",
      "-: правильный ответ отсутствует."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Субъектами административной ответственности являются:",
    "vars": [
      "- : физические лица;",
      "-: юридические лица;",
      "+:  как физические, так и юридические лица;",
      "-: органы государственной власти;"
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Применение мер административной ответственности:",
    "vars": [
      "+: не влечет судимости и увольнения с работы;",
      "-: влечет судимость и увольнение с работы;",
      "-: в зависимости от тяжести может, как повлечь, так и не повлечь судимость и увольнение с работы;",
      "-: правильный ответ отсутствует."
    ]
  },
  {
    "type": "single",
    "theme": "k=b",
    "task": "",
    "question": "Лицо, к которому применены меры административной ответственности, считается административно наказанным:",
    "vars": [
      "-: в течение неопределенного срока;",
      "-: в течение 3 лет;",
      "+: в течение 1 года;",
      "-: в течение 5 лет."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Привлечение к административной ответственности возможно:",
    "vars": [
      "-: только в судебном порядке;",
      "+: как в судебном, так и в административном порядке;",
      "-: только в административном порядке;",
      "-: правильный ответ отсутствует."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "К органам (должностным лицам), уполномоченным рассматривать дела об административных правонарушениях, в соответствии с Кодексом РФ об административных правонарушениях не относятся:",
    "vars": [
      "+: законодательные органы государственной власти субъектов РФ;",
      "-: судьи арбитражных судов;",
      "-: федеральные органы исполнительной власти;",
      "-: мировые судьи."
    ]
  },
  {
    "type": "single",
    "theme": "k=b",
    "task": "",
    "question": "Предусмотренный Кодексом РФ об административных правонарушениях срок, в течение которого лицо считается подвергнутым административному наказанию, составляет:",
    "vars": [
      "-: 6 месяцев со дня вынесения постановления о назначении административного наказания;",
      "+: 1 год со дня окончания исполнения постановления о назначении административного наказания;",
      "-: 2 года со дня вступления в силу постановления о назначении административного наказания.",
      "-: нет правильного ответа"
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Административная правоспособность гражданина возникает:",
    "vars": [
      "+: с рождения;",
      "-: с 14 лет;",
      "-: с 16 лет;",
      "-: с 18 лет."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Административная дееспособность гражданина возникает:",
    "vars": [
      "-: с его физическим и интеллектуальным взрослением;",
      "+: с 18 лет;",
      "-: с рождения;",
      "-: с 16 лет."
    ]
  },
  {
    "type": "many",
    "theme": "k=a",
    "task": "",
    "question": "Обязательные отметки в паспорте гражданина России:",
    "vars": [
      "+: о регистрации по месту жительства;",
      "+: об отношении к воинской обязанности;",
      "+: о детях в возрасте до 14 лет;",
      "-: о национальности;"
    ]
  },
  {
    "type": "many",
    "theme": "k=a",
    "task": "",
    "question": "Паспорт гражданина России подлежит обязательной замене по достижении возраста:",
    "vars": [
      "+: 20 лет;",
      "+: 45 лет;",
      "-: 30 лет;",
      "-: 50 лет."
    ]
  },
  {
    "type": "many",
    "theme": "k=b",
    "task": "",
    "question": "Ограничения административно-правового статуса иностранных граждан:",
    "vars": [
      "+: не могут избирать и быть избраны в государственные органы;",
      "+: не могут быть государственными служащими;",
      "+: не могут проживать без специальных документов;",
      "-: не могут заниматься предпринимательской деятельностью;"
    ]
  },
  {
    "type": "single",
    "theme": "k=b",
    "task": "",
    "question": "Сроки обращения гражданина с жалобой в суд:",
    "vars": [
      "+: три месяца со дня, когда стало известно о нарушении его прав;",
      "-: месяц со дня истечения месячного срока после подачи жалобы в вышестоящий орган при отсутствии на нее письменного ответа;",
      "-: 15 дней со дня, когда стало известно о нарушении прав;",
      "-: срок не ограничен."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Действия (решения), которые могут быть обжалованы в суде:",
    "vars": [
      "+: в результате которых нарушены права и свободы гражданина;",
      "-: в результате которых созданы препятствия осуществлению прав и свобод;",
      "-: отказа государственного органа принять предложения по совершенствованию работы;",
      "-: если гражданин считает их нецелесообразными."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Административная правосубъектность общественного объединения возникает с момента:",
    "vars": [
      "-: решения о создании и принятии устава;",
      "-: разрешения органа государства;",
      "+: регистрации в органах юстиции;",
      "-: регистрации его устава."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Виды мер административно-правового принуждения в зависимости от их целевого назначения:",
    "vars": [
      "-:  предупредительные;",
      "-: меры пресечения;",
      "+: меры административной ответственности;",
      "-: меры административно-процессуального обеспечения;"
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Мерами административного пресечения являются:",
    "vars": [
      "+:  административное задержание;",
      "-: применение оружия;",
      "-: изъятие огнестрельного оружия;",
      "-:  административный арест."
    ]
  },
  {
    "type": "enter",
    "theme": "k=a",
    "task": "",
    "question": "Признаками административного правонарушения являются:",
    "vars": [
      "+:  антиобщественность;",
      "+: противоправность;",
      "+: виновность;",
      "+: наказуемость деяния."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Основными субъектами  административной ответственности являются:",
    "vars": [
      "+:  субъектами ответственности могут быть как физические, так и юридические лица;",
      "-: устанавливается законодательством Российской Федерации и субъектов РФ;",
      "-: множественность органов и должностных лиц, уполномоченных применять административные наказания;",
      "-: целью наказаний является воспитание правонарушителей, предупреждение новых правонарушений."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Виды административных наказаний:",
    "vars": [
      "-:  предупреждение;",
      "-: штраф;",
      "-: лишение специальных прав физического лица;",
      "+: все ответы верны;"
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Административный арест не может применяться к:",
    "vars": [
      "+:  беременным женщинам;",
      "-: женщинам, имеющим детей в возрасте до 18 лет;",
      "-: лицам, достигшим 18 лет;",
      "-:  иностранцам."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Обстоятельствами, отягчающими административную ответственность, признаются:",
    "vars": [
      "-:  совершение правонарушения группой лиц;",
      "-: вовлечение несовершеннолетнего в совершение правонарушения;",
      "-: совершение правонарушения в состоянии опьянения;",
      "+: все ответы верны."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Административный арест могут применять:",
    "vars": [
      "+:  суды;",
      "-: милиция;",
      "-: органы прокуратуры;",
      "-: комиссии по делам несовершеннолетних."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Закон об административной ответственности имеет обратную силу, если он:",
    "vars": [
      "+:  смягчает ответственность;",
      "-: улучшает положение лица, привлекаемого к административной ответственности;",
      "-: устанавливает новый вид правонарушений;",
      "-:  усиливает ответственность."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "При назначении наказания за административное правонарушение учитываются:",
    "vars": [
      "-: имущественное положение;",
      "-: смягчающие обстоятельства;",
      "-: отягчающие обстоятельства.",
      "+: все ответы верны"
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Виды административно-юрисдикционных производств:",
    "vars": [
      "+:  по делам об административных правонарушениях;",
      "-: лицензионное;",
      "-: надзорное;",
      "-: регистрационное."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Признак права:",
    "vars": [
      "-: социальность;",
      "-: нормативность;",
      "-: формальная определенность;",
      "+: все ответы верны."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Под суверенитетом государства понимают:",
    "vars": [
      "-: верховенство государственной власти внутри страны;",
      "-: независимость государственной власти вовне;",
      "+: верховенство государственной власти внутри страны и независимость ее вовне;",
      "-: правильный ответ отсутствует."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Государственная власть подразделяется на:",
    "vars": [
      "-: законодательную и исполнительную;",
      "-: исполнительную и судебную;",
      "+: законодательную, исполнительную и судебную;",
      "-: правильный ответ отсутствует."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Понятие «форма государства» включает в себя:",
    "vars": [
      "-: форму правления;",
      "-: форму государственного устройства;",
      "-: форма политического режима;",
      "+: все ответы верны."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "По форме правления государства делятся на:",
    "vars": [
      "+: республики и монархии;",
      "-: республики и федерации;",
      "-: монархии и конфедерации;",
      "-: правильный ответ отсутствует."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Для унитарного государства характерна:",
    "vars": [
      "+: единая система органов государственной власти;",
      "-: две относительно самостоятельные системы органов государства: федеративная и система органов субъектов федерации;",
      "-: оба варианта возможны;",
      "-: правильный ответ отсутствует."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Под политическим режимом понимаются:",
    "vars": [
      "+: приемы и способы осуществления государственной власти;",
      "-: территориальная организация государственной власти, соотношение между центром и остальными властями государства;",
      "-: организация высшей власти государства, компетенция, взаимодействие высших органов государства, степень участия населения в их образовании;",
      "-: правильный ответ отсутствует."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "В федеративных государствах законодательные органы функционируют:",
    "vars": [
      "-: только на уровне федерации;",
      "-: только на уровне субъектов федерации;",
      "+: как на уровне федерации, так и субъектов федерации;",
      "-: правильный ответ отсутствует."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Федеральный закон вступает в силу:",
    "vars": [
      "+: не ранее его официального опубликования;",
      "-: до его официального опубликования;",
      "-: может вступать в силу как до, так и после официального опубликования;",
      "-: правильный ответ отсутствует."
    ]
  },
  {
    "type": "single",
    "theme": "k=b",
    "task": "",
    "question": "Диспозитивные нормы – это:",
    "vars": [
      "-: повелительные, строго обязательные предписания;",
      "+: правила, дающие сторонам регулируемого отношения возможность самим определять права и обязанности путем заключения договора;",
      "-: все ответы верны;",
      "-: правильный ответ отсутствует."
    ]
  },
  {
    "type": "single",
    "theme": "k=b",
    "task": "",
    "question": "Императивные нормы представляют собой:",
    "vars": [
      "+: повелительные, строго обязательные предписания;",
      "-: правила, которые могут быть изменены соглашением сторон;",
      "-: правила, которые могут быть изменены волей одной из сторон;",
      "-: правильный ответ отсутствует."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Официальными изданиями, в которых публикуются федеральные законы Российской Федерации, являются:",
    "vars": [
      "-: \"Комсомолец\";",
      "+ :\"Собрание законодательства Российской Федерации\";",
      "-: Бюллетень Верховного суда;",
      "-: нет верного ответа."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Отрасль права – это:",
    "vars": [
      "+: элемент системы права, представляющий собой совокупность норм права, регулирующих качественно однородную группу общественных отношений;",
      "-: составная часть правового института;",
      "-: составная часть подотрасли права;",
      "-: правильный ответ отсутствует."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "В зависимости от степени общественной опасности правонарушения подразделяются:",
    "vars": [
      "-: на преступления и административные акты;",
      "-: на проступки и административные акты;",
      "+: на преступления и проступки;",
      "-: правильный ответ отсутствует."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Укажите, какой признак характерен для парламентской республики:",
    "vars": [
      "+: верховенство власти принадлежит парламенту;",
      "-: и парламент, и президент избираются населением;",
      "-: президент вправе распустить правительство;",
      "-: президент возглавляет правительство и самостоятельно назначает в его состава министров."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Принятый в особом порядке нормативный правовой акт законодательного органа власти, обладающий высшей юридической силой и направленный на регулирование наиболее важных общественных отношений называется:",
    "vars": [
      "-: декларация;",
      "-: указ Президента;",
      "+: закон;",
      "-: прецедент."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Положение человека в социальной структуре общества, которое определяется тем или иным кругом прав и обязанностей, называют:",
    "vars": [
      "-: социальной ролью;",
      "+: социальным статусом;",
      "-: социальной мобильностью.",
      "-: нет правильного ответа"
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Политический режим - это:",
    "vars": [
      "-: территориально-политическое деление государства;",
      "-: совокупность политических партий и организаций, действующих в государстве;",
      "+: совокупность методов, способов и средств осуществления государственной власти.",
      "-: нет правильного ответа."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Государственные органы по принципу разделения властей классифицируют на :",
    "vars": [
      "-: высшие и местные;",
      "+: законодательные, исполнительные, судебные;",
      "-: правотворческие, правоприменительные, правоохранительные.",
      "-: нет правильного ответа."
    ]
  },
  {
    "type": "single",
    "theme": "",
    "task": "",
    "question": "Судебный прецедент широко распространен в:",
    "vars": [
      "+:  Великобритании;",
      "-: России;",
      "-: Германии.",
      "-: Белоруссии."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Деликтоспособность - это:",
    "vars": [
      "-: способность быть субъектом правоотношений;",
      "+: способность нести юридическую ответственность за совершенные правонарушения;",
      "-: способность быть носителем юридических прав и обязанностей.",
      "-: нет правильного ответа."
    ]
  },
  {
    "type": "single",
    "theme": "k=b",
    "task": "",
    "question": "Аналогия права применяется:",
    "vars": [
      "+: при обнаружении пробела в праве, когда нет аналогичной нормы;",
      "-: для создания нового нормативно-правового акта;",
      "-: при обнаружении пробела в праве.",
      "-: нет правильного ответа"
    ]
  },
  {
    "type": "single",
    "theme": "k=b",
    "task": "",
    "question": "К субъективной стороне правонарушения относят:",
    "vars": [
      "-: лицо, совершившее правонарушение;",
      "-: отношение окружающих к проступку;",
      "+: психическое отношение субъекта правонарушения к совершенному деянию и его последствиям.",
      "-: нет правильного ответа."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "К какому виду юридической ответственности относится наказание в виде лишения свободы?",
    "vars": [
      "-: административной;",
      "-: дисциплинарной;",
      "+: уголовной.",
      "-: все ответы верны"
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Под свойством, относящимся к верховенству  государственной власти внутри страны и за    ее  пределами, понимается:",
    "vars": [
      "-: Правосубъектность;",
      "+: Государственный суверенитет;",
      "-: Правоспособность.",
      "-: нет правильного ответа"
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "К решающим факторам в  определении основных направлений деятельности государства, в постановке его целей и задач на  соответствующем этапе развития общества, относятся:",
    "vars": [
      "-: Сущность государства и его социальное назначение;",
      "-: Форма правления и национально - государственное  устройство;",
      "+: Политический режим и административно- территориальное устройство.",
      "-: нет правильного ответа"
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Совокупность методов и приемов осуществления  государственной власти, а также уровень политической  свободы в обществе и характер правового положения  личности – это:",
    "vars": [
      "+: Политико-правовой режим;",
      "-: Политическая система;",
      "-: Система государственного управления.",
      "-: нет правильного ответа"
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Взгляд на развитие государственности,  определяемый множеством факторов (характером  господствующей идеологии; уровнем духовности  народа, его национальным складом; географической  средой; международным окружением), соответствует:",
    "vars": [
      "-: Формационному подходу;",
      "+: Цивилизационному подходу;",
      "-: Синдикалистскому подходу.",
      "-: нет правильного ответа"
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Система общественных отношений,  где граждане обладают реальными конституционными правами и свободами это:",
    "vars": [
      "-: Гражданским обществом;",
      "-: Политической системой общества;",
      "+: Правовым государством.",
      "-: нет правильного ответа"
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Государственная регистрация правовых актов включает:",
    "vars": [
      "-:  юридическую экспертизу;",
      "-: присвоение регистрационного номера;",
      "+: занесение акта в Государственный реестр;",
      "-:  опубликование."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Субъекты гражданского права по российскому законодательству –это:",
    "vars": [
      "- : только юридические лица;",
      "- : только коммерческие организации;",
      "+ : как юридические лица, так и физические лица;",
      "- : правильный ответ отсутствует."
    ]
  },
  {
    "type": "single",
    "theme": "k=b",
    "task": "",
    "question": "Коммерческая организация по законодательству Российской Федерации – это:",
    "vars": [
      "+ : организация, основная цель деятельности которой направлена на получение прибыли;",
      "- : организация, учрежденная предпринимателями;",
      "- : организация, наделенная правом осуществления предпринимательской деятельности;",
      "- : правильный ответ отсутствует."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Легальное определение юридического лица дано:",
    "vars": [
      "+ : в Гражданском кодексе Российской Федерации;",
      "- : в Конституции Российской Федерации;",
      "- : в Указе Президента Российской Федерации;",
      "- : правильный ответ отсутствует."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Правоспособность и дееспособность юридического лица возникают:",
    "vars": [
      "+: с момента регистрации юридического лица;",
      "-: с момента составления учредительных документов;",
      "-: по истечении первого года хозяйственной деятельности юридического лица;",
      "-: правильный ответ отсутствует."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Способом прекращения деятельности юридического лица, связанным с правопреемством является:",
    "vars": [
      "+:  реорганизация;",
      "-: ликвидация;",
      "-: как реорганизация, так и ликвидация;",
      "-: правильный ответ отсутствует."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Деятельность акционерных обществ регулируется:",
    "vars": [
      "-: ФЗ «Об акционерном обществе»;",
      "-: Гражданским кодексом РФ;",
      "+:  Гражданским кодексом РФ и ФЗ «Об акционерном обществе»;",
      "-: правильный ответ отсутствует."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "В качестве учредителя федерального казенного предприятия могут выступать:",
    "vars": [
      "+: Российская Федерация;",
      "-: субъект Российской Федерации;",
      "-: орган местного самоуправления;",
      "-: все ответы верны."
    ]
  },
  {
    "type": "single",
    "theme": "k=b",
    "task": "",
    "question": "Право собственности является:",
    "vars": [
      "+: абсолютным правом;",
      "-: относительным правом;",
      "-: как абсолютным, так и относительным правом;",
      "-: правильный ответ отсутствует."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Право общей собственности может быть:",
    "vars": [
      "-: только долевой;",
      "-: только совместной;",
      "+: как долевой, так и совместной;",
      "-: правильный ответ отсутствует."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Способы возникновения права собственности могут быть:",
    "vars": [
      "-: первоначальными;",
      "-: производными;",
      "+: как первоначальными, так и производными;",
      "-: правильный ответ отсутствует."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "В соответствии с российским законодательством наследование может быть:",
    "vars": [
      "-: только по завещанию;",
      "-: только по закону;",
      "+: как по закону, так и по завещанию;",
      "-: правильный ответ отсутствует."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Открытие наследства по общему правилу в Российской Федерации",
    "vars": [
      "+: в момент смерти наследодателя;",
      "-: по истечении 6 месяцев с момента смерти наследодателя;",
      "-: российским законодательством срок не установлен;",
      "-: правильный ответ отсутствует."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Способность своими действиями приобретать и осуществлять гражданские права, приобретать для себя гражданские обязанности и исполнять их называется:",
    "vars": [
      "-: правоспособностью;",
      "-: деликтоспособностью;",
      "+: дееспособностью;",
      "-: сделкоспособностью."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "В случае смерти одного из супругов свидетельство о праве собственности на долю в общем, имуществе супругов выдается нотариусом:",
    "vars": [
      "-:  племянникам;",
      "-: детям;",
      "+: пережившему супругу;",
      "-: внукам."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Временем открытия наследства является день:",
    "vars": [
      "+:  смерти наследодателя или день вступления решения суда в законную силу об объявлении гражданина умершим;",
      "-: когда наследники узнали о смерти наследодателя;",
      "-: обнаружения наследственного имущества;",
      "-: выдачи свидетельства о смерти."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Договор о возведении жилого дома на отведенном земельном участке удостоверяется нотариусом:",
    "vars": [
      "-:  по месту жительства обратившегося лица;",
      "-: в любом месте;",
      "+: по месту отвода земельного участка;",
      "-: по месту нахождения нотариальной конторы."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Завещание должно быть:",
    "vars": [
      "-:  составлено письменно с указанием места и времени;",
      "-: подписано собственноручно завещателем;",
      "+: составлено письменно и удостоверено нотариусом;",
      "-: с конкретным указанием того, что завещано."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Завещание составляется в форме:",
    "vars": [
      "-:  простой письменной;",
      "+: письменной и нотариально удостоверенной;",
      "-: любой;",
      "-: на удостоверение наследодателя."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Местом открытия наследства является:",
    "vars": [
      "+:  последнее место жительства наследодателя, а если оно не известно, то место нахождения основной части имущества;",
      "-: место жительства наследодателя и наследников;",
      "-: место смерти наследодателя;",
      "-: место жительства наследодателя."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Наследник, пропустивший срок для принятия наследства, может быть включен в свидетельство о праве на наследство с согласия:",
    "vars": [
      "+: суда;",
      "-: всех других наследников;",
      "-: помощника нотариуса;",
      "-: нотариуса."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "При удостоверении договора отчуждения имущества нотариус должен проверить:",
    "vars": [
      "-:  принадлежность отчуждаемого имущества;",
      "+: дееспособность гражданина;",
      "-: состояние отчуждаемого имущества.",
      "-: все ответы верны"
    ]
  },
  {
    "type": "single",
    "theme": "k=b",
    "task": "",
    "question": "Охрана наследственного имущества продолжается до принятия всеми наследниками, а если оно ими не принято- до истечения:",
    "vars": [
      "-:  одного месяца со дня открытия наследства;",
      "-: трех месяцев со дня открытия наследства;",
      "+: шести месяцев со дня открытия наследства;",
      "-: двенадцати месяцев со дня открытия наследства."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Может быть объявлен полностью дееспособным несовершеннолетний, если  работает по трудовому договору, достигший:",
    "vars": [
      "- : четырнадцати лет;",
      "+: шестнадцати лет;",
      "-: пятнадцати лет.",
      "-: восемнадцати лет"
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Срок действия доверенности, выданной в порядке передоверия, превышать срока действия доверенности, на основании которой она выдана:",
    "vars": [
      "- : может;",
      "+: не может;",
      "-: может, в исключительных случаях.",
      "-: нет правильного ответа"
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Имущество умершего по праву наследования переходит к государству, если:",
    "vars": [
      "-:  нет наследников по завещанию;",
      "-: наследники лишены завещателем наследства;",
      "+: нет наследников ни по закону, ни по завещанию, либо ни один из наследников не принял наследство, либо все наследники лишены завещателем наследства;",
      "-: нет наследников по закону."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Дееспособность состоит из:",
    "vars": [
      "-: сделкоспособности и способности вступать в брак;",
      "-: сделкоспособности, деликтоспособности и способности вступать в брак;",
      "+: сделкоспособности и деликтоспособности.",
      "-: нет правильного ответа"
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Ограничение в правоспособности и дееспособности может быть только установлено:",
    "vars": [
      "+ :судом;",
      "-:  указом Президента;",
      "-:  законом и указом Президента.",
      "-: все ответы верны"
    ]
  },
  {
    "type": "single",
    "theme": "k=b",
    "task": "",
    "question": "Эмансипация – это:",
    "vars": [
      "-: объявление несовершеннолетнего, достигшего возраста 16 лет полностью дееспособным в случае вступления его в брак;",
      "+:  объявление несовершеннолетнего, достигшего возраста 16 лет полностью дееспособным происходит в случае, если он занимается предпринимательской деятельностью с согласия родителя или лиц их заменяющего и работает по трудовому договору;",
      "-: объявление несовершеннолетнего, достигшего возраста 16 лет полностью дееспособным по решению органа опеки и попечительства;",
      "-: нет правильного ответа."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Признание гражданина недееспособным осуществляется по:",
    "vars": [
      "-: заключению психиатрической экспертизы;",
      "- :по решению органа опеки и попечительства;",
      "+: по решению суда.",
      "-: все ответы верны"
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Гражданин может быть объявлен судом умершим, если в месте его нахождения нет сведений о месте его пребывания в течении:",
    "vars": [
      "-: 4 лет;",
      "+: 5 лет;",
      "-: 6 лет;",
      "-: 9 лет."
    ]
  },
  {
    "type": "single",
    "theme": "k=b",
    "task": "",
    "question": "Отношения, связанные с режимом государственной тайны регулируются…:",
    "vars": [
      "-: ФЗ «Об информации, информатизации и защите информации»;",
      "+: Закон РФ «О безопасности», Закон РФ «О государственной тайне»;",
      "-: Закон РФ «О государственной тайне», Закон РФ «О милиции»;",
      "-: Уголовным кодексом РФ."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "В соответствии с ФЗ «Об информации, информационных технологиях и о защите информации» под общественными сведениями и иной информаций, доступ к которой не ограничен, понимается ________информация:",
    "vars": [
      "-: свободная;",
      "-: общая;",
      "-: доступная;",
      "+: общедоступная."
    ]
  },
  {
    "type": "single",
    "theme": "k=b",
    "task": "",
    "question": "Коллегиальным органом, координирующим деятельность органов государственной власти по защите государственной тайны, является…:",
    "vars": [
      "-: Верховный суд РФ;",
      "-: Государственная Дума;",
      "-: Конституционный суд РФ;",
      "+: Межведомственная комиссия."
    ]
  },
  {
    "type": "single",
    "theme": "k=b",
    "task": "",
    "question": "Контроль за защитой информации осуществляется…:",
    "vars": [
      "-: Общественными организациями;",
      "-: Межведомственным сообществом;",
      "+: Органами государственной власти;",
      "-: Органами местного самоуправления."
    ]
  },
  {
    "type": "single",
    "theme": "k=b",
    "task": "",
    "question": "Контроль за обеспечением защиты государственной тайны осуществляет…:",
    "vars": [
      "-: Правительство РФ и палаты Федерального Собрания РФ;",
      "+: Президент и Правительство РФ;",
      "-: Государственная Дума РФ;",
      "-: Президент РФ и Министерство иностранных дел РФ."
    ]
  },
  {
    "type": "single",
    "theme": "k=b",
    "task": "",
    "question": "Процессы, методы поиска, сбора, хранения, обработки, предоставления, распределения информации и способы осуществления таких процессов и методов - это…:",
    "vars": [
      "+: информационные технологии;",
      "-: телекоммуникационная сеть;",
      "-: информационные системы;",
      "-: информационная сеть."
    ]
  },
  {
    "type": "single",
    "theme": "k=b",
    "task": "",
    "question": "В соответствии с ФЗ «Об информации, информатизации и информационных процессах» целями защиты информации не является…:",
    "vars": [
      "-: предотвращение утечки, хищения, утраты, искажения, подделки информации;",
      "-: предотвращение угроз безопасности личности, общества, государства;",
      "+: сокрытие информации в меркантильных целях",
      "-: сохранение государственной тайны."
    ]
  },
  {
    "type": "single",
    "theme": "k=b",
    "task": "",
    "question": "Должностные лица и граждане, виновные в нарушении законодательства РФ о государственной тайне, несут:",
    "vars": [
      "+: Уголовную, административную, гражданско-правовую или дисциплинарную ответственность;",
      "-: дисциплинарную ответственность;",
      "-: международно-правовую;",
      "-: Уголовную или административную ответственность."
    ]
  },
  {
    "type": "single",
    "theme": "k=b",
    "task": "",
    "question": "В соответствии со степенями секретности сведений, составляющих государственную тайну, устанавливаются ___ формы доступа:",
    "vars": [
      "-: 1;",
      "+: 3;",
      "-: 10;",
      "-: 12."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "К государственной тайне не относятся сведения…:",
    "vars": [
      "-: О методах и средствах защиты секретной информации;",
      "+: О размерах золотого запаса и государственных валютных резервов РФ;",
      "-: О защите государственной границы РФ;",
      "-: Об использовании инфраструктуры РФ в целях обеспечения обороноспособности и безопасности."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "К конфиденциальной информации не относится:",
    "vars": [
      "-: Адвокатская тайна;",
      "-: Сведения, составляющие тайну следствия;",
      "-: Персональные данные;",
      "+: Сведения о валовом внутреннем продукте России."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Цензура в Российской Федерации…:",
    "vars": [
      "+: Запрещена законом;",
      "-: Возможна только в исключительных случаях на телевидении;",
      "-: Применяется органами государственной власти по собственному усмотрению;",
      "-: Законодательно не запрещен."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "К принципам отнесения сведений к государственной тайные не относится…:",
    "vars": [
      "-: законность;",
      "-: своевременность;",
      "+: гуманизм;",
      "-: обоснованность."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Преступления в сфере компьютерной информации относится к преступлениям…:",
    "vars": [
      "-: против мира и безопасности человечества;",
      "+: против общественной безопасности;",
      "-: против личности;",
      "-: против жизни."
    ]
  },
  {
    "type": "single",
    "theme": "k=b",
    "task": "",
    "question": "Базовым законом, регулирующим информационные отношения является:",
    "vars": [
      "+: ФЗ «Об информации, информационных технологиях и защите информации»;",
      "-: Закон РФ «О государственной тайне»;",
      "-: ФЗ РФ «О персональных данных»;",
      "-: Конституция РФ."
    ]
  },
  {
    "type": "single",
    "theme": "k=b",
    "task": "",
    "question": "Источником информационного законодательства в РФ является:",
    "vars": [
      "-: Конституция РФ;",
      "-: нормы гражданского права;",
      "-: нормы международного права;",
      "+: все ответы верны."
    ]
  },
  {
    "type": "single",
    "theme": "k=b",
    "task": "",
    "question": "Под распространением информации понимается:",
    "vars": [
      "+: действия, направленные на получение информации неопределенным кругом лиц или передачу информации неопределенному кругу лиц;",
      "-: действия, направленные на получение информации определенным кругом лиц или передачу информации определенному кругу лиц;",
      "-: возможность получения информации и ее использования;",
      "-: установление ограничений доступа к информации только федеральными законами."
    ]
  },
  {
    "type": "single",
    "theme": "k=b",
    "task": "",
    "question": "Гражданин или юридическое лицо, осуществляющее деятельность по эксплуатации информационной системы, в т.ч. по обработке информации, содержащейся в ее базах данных:",
    "vars": [
      "+: оператор информационной системы;",
      "-: оператор связи;",
      "-: собственник информации;",
      "-: обладатель информации."
    ]
  },
  {
    "type": "single",
    "theme": "k=b",
    "task": "",
    "question": "Предоставление информации- это",
    "vars": [
      "-:  действия, направленные на получение информации неопределенным кругом лиц или передачу информации неопределенному кругу лиц;",
      "+:  действия, направленные на получение информации определенным кругом лиц или передачу информации определенному кругу лиц;",
      "-: возможность получения информации и ее использования;",
      "-:  процессы, методы поиска, сбора, хранения, обработки, предоставления, распространения информации и способы осуществления таких процессов и методов."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Из РФ не ограничен вывоз следующих документов:",
    "vars": [
      "-: документы архивных фондов;",
      "-: документы, содержащие санитарно-эпидемиологическую информацию;",
      "+: нормативно-правовые акты, устанавливающие права граждан;",
      "-: нет правильного ответа."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Лица, виновные в нарушении требований закона \"О персональных данных\", несут ответственность:",
    "vars": [
      "-: гражданскую, дисциплинарную ;",
      "-: уголовную;",
      "-: административную;",
      "+: все ответы верны."
    ]
  },
  {
    "type": "single",
    "theme": "k=b",
    "task": "",
    "question": "Информационные технологии -  это",
    "vars": [
      "-: сведения (сообщения, данные) независимо от формы их представления;",
      "+: процессы, методы поиска, сбора, хранения, обработки, предоставления, распространения информации и способы осуществления таких процессов и методов;",
      "-: совокупность содержащейся в базах данных информации и обеспечивающих ее обработку информационных технологий и технических средств;",
      "-: возможность получения информации и ее использования."
    ]
  },
  {
    "type": "single",
    "theme": "k=b",
    "task": "",
    "question": "Средство массовой информации считается зарегистрированным:",
    "vars": [
      "-: со дня принятие соответствующего решения регистрирующим органом в месячный срок;",
      "+: со дня принятия регистрирующим органом решения о регистрации средства массовой информации;",
      "-: На основании решения о регистрации средства массовой информации;",
      "-: в течение пяти рабочих дней со дня получения заявления."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "К субъектам профессиональной тайны не относятся:",
    "vars": [
      "-: доверитель;",
      "-: держатель;",
      "-: пользователь;",
      "+: оператор."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Несанкционированное доведение защищаемой информации до потребителей, не имеющих права доступа к этой информации:",
    "vars": [
      "+: несанкционированное воздействие;",
      "-: непреднамеренное воздействие;",
      "-: утечка;",
      "-: разглашение."
    ]
  },
  {
    "type": "single",
    "theme": "k=b",
    "task": "",
    "question": "Ответственность за проведение в организации мероприятий по защите коммерческой тайне несет:",
    "vars": [
      "+: генеральный директор;",
      "-: заместитель директора;",
      "-: бухгалтер;",
      "-: никто из представленных."
    ]
  },
  {
    "type": "single",
    "theme": "k=b",
    "task": "",
    "question": "Информационное право – это:",
    "vars": [
      "-: совокупность правовых норм, не регулирующих отношения по поводу создания, получения, использования и распространения информации и вязанных с ней информационных объектов;",
      "-: совокупность правовых норм, регулирующих отношения по поводу создания, получения, использования и распространения информации и не вязанных с ней информационных объектов;",
      "+: совокупность правовых норм, регулирующих отношения по поводу создания, получения, использования и распространения информации и связанных с ней информационных объектов;",
      "-: разность правовых норм, регулирующих отношения по поводу создания, получения, использования и распространения информации и вязанных с ней информационных объектов."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Не запрещается распространение информации, которая направлена на",
    "vars": [
      "-: разжигание национальной, расовой или религиозной ненависти и вражды;",
      "-: пропаганду войны;",
      "+: распространение какой либо религии;",
      "-: все ответы не верны."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Гражданин (физическое лицо) имеет право на получение от государственных органов, органов местного самоуправления, их должностных лиц в порядке, установленном законодательством Российской Федерации",
    "vars": [
      "-: любой информации;",
      "+: информации, непосредственно затрагивающей его права и свободы;",
      "-: информации, являющейся ограниченной;",
      "-: нет верного ответа."
    ]
  },
  {
    "type": "single",
    "theme": "k=b",
    "task": "",
    "question": "Срок засекречивания сведений, составляющих государственную тайну, не должен превышать:",
    "vars": [
      "+: 30 лет;",
      "-: 40 лет;",
      "-: 100лет;",
      "-: 50 лет."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Судьи Конституционного Суда РФ, Верховного Суда РФ и Высшего Арбитражного Суда РФ:",
    "vars": [
      "-: избираются на должность Государственной Думой из кандидатов, представленных Президентом РФ;",
      "-: назначаются на должность Президентом РФ по представлению Государственной",
      "-: избираются на должность Советом Федерации из кандидатов, отобранных Государственной Думой;",
      "+: назначаются на должность Советом Федерации по представлению Президента РФ."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Лица, наделенные в конституционном порядке полномочиями осуществлять правосудие и исполняющие свои обязанности на профессиональной основе, называются:",
    "vars": [
      "-: присяжными заседателями;",
      "-: народными заседателями;",
      "+: судьями;",
      "-: прокурорами."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Для избрания Президентом РФ гражданин РФ должен соответствовать следующим требованиям:",
    "vars": [
      "-: быть не моложе 40 лет, обладать безупречной репутацией;",
      "+: быть не моложе 35 лет, постоянно проживать в РФ не менее 10 лет;",
      "-: быть не моложе 40 лет, не иметь судимости;",
      "-: быть не моложе 35 лет, иметь стаж государственной службы не менее 5 лет."
    ]
  },
  {
    "type": "single",
    "theme": "k=b",
    "task": "",
    "question": "Избирательное право в РФ  является:",
    "vars": [
      "-: всеобщим;",
      "-: равным;",
      "+: все ответы верны;",
      "-: прямым."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Какой вид субъекта РФ  предусмотрен Конституцией РФ:",
    "vars": [
      "-: город федерального значения;",
      "-: край;",
      "-: область",
      "+: все ответы верны;"
    ]
  },
  {
    "type": "single",
    "theme": "k=b",
    "task": "",
    "question": "Коллегиальные органы исполнительной власти:",
    "vars": [
      "+: Правительство РФ;",
      "-: Совет безопасности;",
      "-: министерство;",
      "-: Совет федерации."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Президент Российской Федерации является:",
    "vars": [
      "+: главой государства;",
      "-: глава правительства;",
      "-: высшим должностным лицом;",
      "-: главой исполнительной власти."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Главой правительства является:",
    "vars": [
      "+: Председатель Правительства РФ;",
      "-: Председатель Счетной палаты;",
      "-: судья;",
      "-: Уполномоченный по правам человека;"
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Конституционный Суд РФ дает толкование Конституции РФ:",
    "vars": [
      "-:  по запросу Государственной Думы;",
      "-: по запросу Президента РФ;",
      "-: по запросу Правительства РФ;",
      "+: все ответы верны."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Нотариусом может быть:",
    "vars": [
      "+:  гражданин РФ, имеющий высшее юридическое образование, прошедший стажировку, сдавший квалификационный экзамен, имеющий лицензию на право нотариальной деятельности;",
      "-: гражданин РФ, имеющий лицензию на право нотариальной деятельности;",
      "-: любое физическое лицо;",
      "-: физическое лицо, имеющее юридическое образование."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Осуществлять нотариальные действия в РФ имеют право:",
    "vars": [
      "-:  только частные нотариусы;",
      "+: государственные нотариусы, частные нотариусы, в случае отсутствия в населенном пункте нотариуса - должностные лица органов исполнительной власти;",
      "-: только должностные лица органов исполнительной власти;",
      "-: только государственные нотариусы."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Судьями могут быть граждане РФ, достигшие:",
    "vars": [
      "-: 18 лет;",
      "-: 21 года;",
      "+: 25 лет;",
      "-: 35 лет."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Генеральный прокурор РФ назначается по представлению Президента:",
    "vars": [
      "-: Президентом РФ;",
      "+: Советом Федерации;",
      "-: Государственной Думой;",
      "-: Конституционным Судом."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Положения глав 1, 2 и 9 Конституции РФ могут быть пересмотрены:",
    "vars": [
      "-: Федеральным Собранием РФ;",
      "+: Конституционным Собранием;",
      "-: Конституционным Судом;",
      "-: на Референдуме."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Высшим и непосредственным выражением власти народа является",
    "vars": [
      "-: Президент Российской Федерации;",
      "-: Государственная Дума Российской Федерации;",
      "+:  референдум, свободные выборы;",
      "-: нет правильного ответа."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Согласно Конституции высшим органом законодательной власти в нашей стране является:",
    "vars": [
      "-: Правительство Российской Федерации;",
      "+: Федеральное Собрание Российской Федерации;",
      "-: Конституционный Суд Российской Федерации;",
      "-: Президент Российской Федерации."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Кто является Верховным Главнокомандующим вооруженных сил РФ?",
    "vars": [
      "-: министр обороны;",
      "-: начальник Генерального штаба;",
      "+: Президент РФ;",
      "-: Председатель Государственной Думы Российской Федерации."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Отлагательное вето, т.е. право вернуть принятый Федеральным Собранием закон для повторного рассмотрения, принадлежит:",
    "vars": [
      "+: Президенту РФ;",
      "-: премьер – министру РФ;",
      "-: Генеральному прокурору РФ;",
      "-: председателю Конституционного Суда РФ."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Статус республики определяется Конституцией Российской Федерации и",
    "vars": [
      "-: уставом республики;",
      "+: конституцией республики;",
      "-: федеральным законом;",
      "-: нет правильного ответа."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "В Российской Федерации признается",
    "vars": [
      "-: идеология ведущей политической партии;",
      "-: государственная идеология;",
      "+: идеологическое многообразие;",
      "-: нет правильного ответа."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Гражданин Российской Федерации  может самостоятельно осуществлять в полном объеме свои права и обязанности",
    "vars": [
      "-: с 21 года;",
      "-: с 14 лет;",
      "+: с 18 лет;",
      "-: нет правильного ответа."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Слово «Конституция» образовано от латинского constitution, что означает:",
    "vars": [
      "-: согласие",
      "-: система взглядов",
      "+: установление, устройство",
      "-: правила."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Какой политический  режим в Р.Ф.:",
    "vars": [
      "+: демократический;",
      "-: либеральный;",
      "-: авторитарный.",
      "-: нет правильного ответа"
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Территориальное устройство Р.Ф.:",
    "vars": [
      "+: федеративное;",
      "-: конфедерация;",
      "-: унитарное.",
      "-: все ответы верны."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "В Р.Ф. республиканская форма правления:",
    "vars": [
      "-: дуалистическая;",
      "-: парламентская;",
      "+: смешанная (полупрезидентская).",
      "-: все ответы верны"
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Главный закон Р.Ф.:",
    "vars": [
      "-: билль о правах человека;",
      "+: Конституция;",
      "-: Коран.",
      "-: нет правильного ответа"
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "К какому типу правовой системы относится Россия:",
    "vars": [
      "+: Романо-германская   правовая семья;",
      "-: англосаксонская правовая система;",
      "-: религиозно- общинные системы.",
      "-: все ответы верны"
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Права, принадлежащие человеку с рождения:",
    "vars": [
      "+: естественное право;",
      "-: позитивное право.",
      "-: право крови",
      "-: все ответы верны"
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Президент в Р.Ф. избирается:",
    "vars": [
      "-: на 3 года;",
      "+: на 6 года;",
      "-: на 5 лет.",
      "-: все ответы верны"
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Совет Федерации:",
    "vars": [
      "+: верхняя палата;",
      "-: нижняя палата.",
      "-: средняя палата.",
      "-: все ответы верны"
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Метод семейного права является:",
    "vars": [
      "-: дозволительным;",
      "-\t: императивным;",
      "+: диспозитивным - императивным;",
      "-\t: все ответы верны."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Имущественные отношения между супругами урегулированы:",
    "vars": [
      "+: только нормами семейного права;",
      "-\t: только нормами гражданского законодательства;",
      "-:  как нормами семейного, так и нормами гражданского права;",
      "-\t: правильный ответ отсутствует."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "С момента государственной регистрации заключения брака у супругов",
    "vars": [
      "-\t : только личные права и обязанности;",
      "-\t : только имущественные права и обязанности;",
      "+:  как личные, так и имущественные права и обязанности;",
      "-\t: правильный ответ отсутствует."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Семейный кодекс предусматривает:",
    "vars": [
      "-\t : только законный режим имущества супругов;",
      "-\t:  только договорный режим имущества супругов;",
      "+:  как законный, так и договорный режим имущества супругов;",
      "-\t: правильный ответ отсутствует."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "К раздельному имуществу супругов относится:",
    "vars": [
      "-\t: имущество, принадлежавшее каждому из супругов до вступления в брак;",
      "- : имущество, полученное им во время брака в дар, в порядке наследования или по другим безвозмездным     сделкам;",
      "-\t: вещи, индивидуального пользования (одежда, обувь, средства личной гигиены и т.п.);",
      "+ : все ответы верны."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Брачный договор может быть заключен:",
    "vars": [
      "-\t: только до заключения брака;",
      "-\t: только после заключения брака;",
      "+ : как до, так и в любое время после заключения брака;",
      "-\t : правильный ответ отсутствует."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Закон предусматривает для брачного договора:",
    "vars": [
      "-\t : простую письменную форму;",
      "+: обязательную письменную форму с последующим его нотариальным удостоверением;",
      "-\t: как устную, так и письменную форму;",
      "-\t: правильный ответ отсутствует."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Брачным договором могут регулироваться:",
    "vars": [
      "-\t: только личные неимущественные отношения между супругами;",
      "+:   только имущественные отношения между супругами;",
      "-\t : как личные неимущественные, так и имущественные отношения между супругами;",
      "-\t : правильный ответ отсутствует."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Режим общего имущества распространяется:",
    "vars": [
      "+:  только на имущество, приобретенное в зарегистрированном браке;",
      "-\t : только на имущество, приобретенное в процессе фактических брачных отношений;",
      "-\t:  как на имущество, приобретенное в зарегистрированном браке, так и на имущество, приобретенное в процессе фактических брачных отношений;",
      "-\t : правильный ответ отсутствует."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Раздел общего имущества супругов возможен:",
    "vars": [
      "-\t : только во время брака;",
      "-\t : только после развода;",
      "+:   как во время брака, так и после развода;",
      "-\t: правильный ответ отсутствует."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "По личным обязательствам супруга взыскания обращаются на:",
    "vars": [
      "-\t: его личное имущество;",
      "-:  его долю в общем, имуществе;",
      "+: как на его личное имущество, так и на его долю в общем, имуществе;",
      "-\t: правильный ответ отсутствует."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Основания для лишения родительских прав исчерпывающим образом",
    "vars": [
      "+: Семейном кодексе РФ;",
      "-\t: Конституции РФ;",
      "-\t : Федеральном законе;",
      "-\t : правильный ответ отсутствует."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Лишение родительских прав осуществляется:",
    "vars": [
      "-\t : органами опеки и попечительства;",
      "-\t : прокуратурой;",
      "-\t:  как органами опеки и попечительства, так и судом;",
      "+:  только судом."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Лишение родительских прав носит:",
    "vars": [
      "-\t : необратимый характер;",
      "+:  обратимый характер;",
      "-\t: как обратимый, так и необратимый характер по усмотрению органов опеки и попечительства;",
      "-\t: правильный ответ отсутствует."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "К прямым родственникам  относится:",
    "vars": [
      "- : отец;",
      "- : мать;",
      "+: все ответы верны;",
      "-: дети."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Какие отношения супругов могут быть урегулированы брачным договором:",
    "vars": [
      "- : любые отношения по соглашению супругов;",
      "+ : только имущественные отношения;",
      "- : только отношения по ведению домашнего хозяйства;",
      "- : имущественные и личные неимущественные отношения в части, ж урегулированной законом."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Если оба супруга, имеющие несовершеннолетних детей, согласны на расторжение брака, оно производится:",
    "vars": [
      "- : органом ЗАГС;",
      "+ : судом;",
      "- : органом ЗАГС или судом по выбору супругов;",
      "- : нотариусом."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "В соответствии с Семейным кодексом РФ если супруг,  в период брака осуществлял ведение домашнего хозяйства и поэтому не имел самостоятельного дохода:",
    "vars": [
      "- : ему не принадлежит право на совместную собственность;",
      "+:  право на совместную собственность ему принадлежит наравне с другим супругом;",
      "- : право на совместную собственность ему принадлежит наравне с другим супругом, если это прямо предусмотрено брачным договором;",
      "- : ему принадлежит безусловное право на одну треть от совместной собственности."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Существует ли в российском законодательстве легальное определение семьи:",
    "vars": [
      "-: да, определение семьи содержится в Семейном кодексе РФ;",
      "- : да, определение семьи содержится в Федеральном законе РФ «Об актах гражданского состояния»;",
      "-: нет, определение семьи существует только в теории.",
      "+: нет правильного ответа."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "В Российской Федерации юридическую силу имеют:",
    "vars": [
      "- : фактические брачные отношения;",
      "+ : зарегистрированный брак;",
      "- : религиозный брак.",
      "-: нет правильного ответа"
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "В случае отсутствия соглашения о порядке осуществления родительских прав родителем, спор разрешает:",
    "vars": [
      "- : суд;",
      "- : орган опеки и попечительства;",
      "+ : суд с участием органа опеки и попечительства.",
      "-: нет правильного ответа"
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "К не прямым родственникам относится:",
    "vars": [
      "+  : дядя;",
      "-  : отец;",
      "-  : мать;",
      "-  : дочь;"
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Брак в Российской Федерации на основании Семейного Кодекса РФ допускается:",
    "vars": [
      "+ : между мужчиной и женщиной;",
      "- : между лицами любого пола, но это не влечет изменения их имущественного положения;",
      "- : между мужчиной и несколькими женщина, если это разрешено законодательством субъекта федерации;",
      "-: нет правильного ответа"
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Какие отношения супругов могут быть урегулированы брачным договором:",
    "vars": [
      "- : любые отношения по соглашению супругов;",
      "- : имущественные отношения и личные неимущественные отношения, если это не выходит за рамки, предусмотренные Конституцией РФ;",
      "+ : исключительно имущественные отношения.",
      "-: нет правильного ответа"
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Трудовое право в Российской Федерации является:",
    "vars": [
      "+: самостоятельной отраслью права;",
      "-: подотраслью;",
      "-: правовым институтом;",
      "-: правильный ответ отсутствует"
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Метод трудового права включает в себя:",
    "vars": [
      "-: только элементы диспозитивного воздействия;",
      "+: как элементы диспозитивного, так и императивного воздействия;",
      "-: только элементы императивного воздействия;",
      "-: правильный ответ отсутствует."
    ]
  },
  {
    "type": "many",
    "theme": "k=a",
    "task": "",
    "question": "Трудовые договоры могут заключаться на:",
    "vars": [
      "+: неопределенный срок;",
      "+: определенный срок не более пяти лет;",
      "-: время выполнения определенной работы;",
      "-: все ответы верны."
    ]
  },
  {
    "type": "single",
    "theme": "k=b",
    "task": "",
    "question": "Срочный договор – это договор, заключаемый на срок:",
    "vars": [
      "-: не более 1 года;",
      "-: не более 3 лет;",
      "+: не более 5 лет;",
      "-: все ответы верны."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Трудовой договор может быть расторгнут:",
    "vars": [
      "-: по соглашению сторон;",
      "-: по инициативе работника;",
      "-: в предусмотренных законом случаях;",
      "+: все ответы верны."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Трудовой договор является:",
    "vars": [
      "+:  соглашением между работником и работодателем по поводу обязательных условий труда;",
      "-: принудительным соглашением между работником и работодателем по поводу существенных условий труда;",
      "-: как добровольным, так и принудительным соглашением между работником и работодателем по поводу существенных условий труда;",
      "-: правильный ответ отсутствует."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Основания прекращения трудового договора перечислены:",
    "vars": [
      "-: в Конституции РФ;",
      "+: в Трудовом кодексе РФ;",
      "-: в федеральном законе;",
      "-: в постановлении правительства."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Определение трудовой дисциплины дано в:",
    "vars": [
      "-: Международной конвенции;",
      "-: Конституции РФ;",
      "+: Трудовом кодексе РФ;",
      "-: вообще не дано в российском законодательстве."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Меры поощрения работников за образцовое выполнение трудовых обязанностей носят:",
    "vars": [
      "-: моральный характер;",
      "-: материальный характер;",
      "+: как материальный, так и моральный характер;",
      "-: правильный ответ отсутствует."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "К мерам дисциплинарного взыскания за нарушение трудовой дисциплины относятся:",
    "vars": [
      "-: замечание и выговор;",
      "-: выговор и увольнение;",
      "+: замечание, выговор и увольнение по соответствующем основаниям;",
      "-: правильный ответ отсутствует."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Какой вид времени отдыха не предусмотрен трудовым законодательством РФ:",
    "vars": [
      "-: перерывы в течение рабочего дня (смены);",
      "-: ежедневный (междусменный) отдых;",
      "-: выходные дни (еженедельный непрерывный отдых);",
      "+: квартальный (плановый) отдых."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Нормальная продолжительность рабочего времени не может превышать:",
    "vars": [
      "+: 40 часов в неделю;",
      "-: 35 часов в неделю;",
      "-: 45 часов в неделю.",
      "-: 50 часов в неделю"
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "К однократному грубому нарушению работником трудовых обязанностей, которое является основанием для расторжения трудового договора по инициативе работодателя, не относится:",
    "vars": [
      "-: появление на работе в состоянии наркотического опьянения;",
      "+: оскорбление коллег по работе;",
      "-: разглашение коммерческой тайны;",
      "-: совершение по месту работы мелкого хищения чужого имущества."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Для каких из следующих лиц может устанавливаться испытание при приеме на работу:",
    "vars": [
      "-: беременные женщины;",
      "-: лица, не достигшие возраста 18 лет;",
      "-: лица, окончившие образовательные учреждения высшего профессионального образования и впервые поступающие на работу по специальности;",
      "+: государственные служащие."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Ежегодный основной оплачиваемый отпуск предоставляется работникам продолжительностью:",
    "vars": [
      "+: 28 календарных дней;",
      "-: 28 рабочих дней;",
      "-: 30 календарных дней;",
      "-: 30 рабочих дней."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Основной институт трудового права:",
    "vars": [
      "-: документ об образования;",
      "+: трудовой договор;",
      "-: трудовой кодекс.",
      "-: все ответы верны"
    ]
  },
  {
    "type": "many",
    "theme": "k=a",
    "task": "",
    "question": "Трудовой спор разрешает:",
    "vars": [
      "-: профсоюз;",
      "+: суд;",
      "+: КТС – комиссии по трудовым спорам.",
      "-: нет правильного ответа"
    ]
  },
  {
    "type": "single",
    "theme": "k=b",
    "task": "",
    "question": "Договор с работодателем можно заключать самостоятельно:",
    "vars": [
      "-: с 14 лет;",
      "+: с 16 лет;",
      "-: с 18 лет.",
      "-: с 12 лет"
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Основные принципы трудового права закреплены:",
    "vars": [
      "+: в Трудовом кодексе РФ;",
      "-: в Гражданском кодексе РФ;",
      "-: в Конституции РФ.",
      "-: в Федеральном законе"
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Стороны трудовых отношений – это:",
    "vars": [
      "+: работник и работодатель;",
      "-: работник, работодатель и посредник (например, биржа труда);",
      "-: работодатель и посредник (например, биржа труда).",
      "-: все ответы верны"
    ]
  },
  {
    "type": "single",
    "theme": "k=b",
    "task": "",
    "question": "Коллективный договор заключается на срок не более:",
    "vars": [
      "-: 1 года;",
      "+: 3 лет;",
      "-: 5 лет.",
      "-: 2 года"
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Трудовой договор – это:",
    "vars": [
      "-: соглашение между работодателем и представителем работника;",
      "-: соглашение между работником и представителем работодателя;",
      "+: соглашение между работодателем и работником.",
      "-: нет правильного ответа"
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Трудовые договоры могут заключаться:",
    "vars": [
      "-: только на неопределенный срок;",
      "+: на определенный либо на неопределенный срок;",
      "-: сроком до 10 лет.",
      "-: нет правильного ответа"
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Трудовой договор вступает в силу:",
    "vars": [
      "-: с оговоренной в нем даты;",
      "+: с момента его подписания;",
      "-: с момента фактического допущения работника к работе.",
      "-: нет правильного ответа"
    ]
  },
  {
    "type": "single",
    "theme": "k=b",
    "task": "",
    "question": "Заключение трудового договора допускается с лицами, достигшими возраста:",
    "vars": [
      "-: 10 лет;",
      "-: 12 лет;",
      "+: 16 лет.",
      "-: 14 лет"
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Основным документом о трудовой деятельности и трудовом стаже являются:",
    "vars": [
      "-: трудовой договор;",
      "-: личное дело;",
      "+: трудовая книжка.",
      "-: нет правильного ответа"
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Трудовой договор заключается:",
    "vars": [
      "+: всегда в письменной форме;",
      "-: как в письменной, так и в устной форме по усмотрению сторон.",
      "-: по усмотрению работодателя.",
      "-: по усмотрению работника."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "При приеме на работу в организации испытательный срок не может превышать для руководителей организаций и их бухгалтеров:",
    "vars": [
      "-: 3 месяцев;",
      "-: 8 месяцев;",
      "+: 6 месяцев.",
      "-: 2 месяца"
    ]
  },
  {
    "type": "single",
    "theme": "k=b",
    "task": "",
    "question": "Работник имеет право расторгнуть трудовой договор, предупредив об этом работодателя в письменной форме:",
    "vars": [
      "-: за 30 дней;",
      "-: за 7 дней;",
      "+: за 2 недели;",
      "-: предварительно уведомления вообще не требуется."
    ]
  },
  {
    "type": "single",
    "theme": "k=b",
    "task": "",
    "question": "Работа за пределами нормальной продолжительности рабочего времени не может превышать:",
    "vars": [
      "-: 2 часов в день и 8 часов в неделю;",
      "-: 3 часов в день и 12 часов в неделю;",
      "+: 4 часов в день и 16 часов в неделю.",
      "-: 1 часа в день и 5 часов в неделю"
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Привлечение к сверхурочным работам производится:",
    "vars": [
      "-: с устного согласия работника;",
      "+: с письменного согласия;",
      "-: по приказу работодателя.",
      "-: по обоюдному согласию сторон"
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Перерыв включается в рабочее время:",
    "vars": [
      "-: да;",
      "+: нет;",
      "-: да, если это оговорено в трудовом договоре.",
      "-: по усмотрению работодателя"
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Продолжительность перерыва в течение рабочего дня может быть:",
    "vars": [
      "-: не менее 15 минут и не более 30 минут;",
      "-: не менее 30 минут и не более 1 часа;",
      "+: не менее  30 минут и не более 2 часов;",
      "-: не менее 30 минут и не более 3 часов."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Право на использование отпуска за первый год работы возникает у работника по истечении:",
    "vars": [
      "-: 8 месяцев непрерывной работы;",
      "+: 6 месяцев непрерывной работы;",
      "-: 4 месяца непрерывной работы.",
      "-: 10 месяцев непрерывной работы"
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Общий размер всех удержаний при каждой выплате заработной платы не может превышать:",
    "vars": [
      "-: 30%;",
      "+: 50%;",
      "-: 25%;",
      "-: 40%."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Испытательный срок по общему правилу не может превышать:",
    "vars": [
      "-: 6 месяцев;",
      "+: 3 месяца",
      "-: 2 месяца;",
      "-: 1 месяц."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "По заявлению женщины ей предоставляется отпуск по уходу за ребенком до достижении им возраста (с сохранением стажа):",
    "vars": [
      "-: 1 года;",
      "+: 3 года;",
      "-: 5 лет.",
      "-: 4 года"
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Ежегодный основной оплачиваемый отпуск работника в возрасте до 18 лет предоставляется продолжительностью:",
    "vars": [
      "-: 25 календарных дней;",
      "-: 28 календарных дней;",
      "-: 29 календарных дней;",
      "+: 31 календарный день."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Преступлением по УК РФ  признается:",
    "vars": [
      "+: совершенное общественно опасное, виновное деяние, запрещенное Уголовным кодексом РФ под угрозой наказания;",
      "-  : общественно опасное деяние, запрещенное законом;",
      "-\t:  общественно опасное деяние, запрещенное как Уголовным, так и Кодексом об административных правонарушениях под угрозой наказания;",
      "-\t : правильный ответ отсутствует."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Признаками преступления являются:",
    "vars": [
      "-\t: общественная опасность;",
      "-\t: противоправность;",
      "-\t: наказуемость;",
      "+ : все ответы верны."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Степень общественной опасности – это:",
    "vars": [
      "+ : количественная характеристика преступного деяния одного и того же вида (характера);",
      "- : качественная характеристика преступного деяния одного и того же вида (характера);",
      "- : как количественная, так и качественная характеристика преступного деяния одного и того же вида (характера);",
      "- : правильный ответ отсутствует."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Общественно опасное деяние признается преступлением, если:",
    "vars": [
      "+ : оно предусмотрено уголовным законом;",
      "- : оно предусмотрено Конституцией РФ;",
      "- : все ответы верны;",
      "- : правильный ответ отсутствует."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "С учетом степени общественной опасности уголовный закон выделяет:",
    "vars": [
      "- : преступления небольшой тяжести и тяжкие преступления;",
      "- : преступления средней тяжести и тяжкие преступления;",
      "- : преступления небольшой тяжести, тяжкие  и особо тяжкие преступления;",
      "+ : преступления небольшой тяжести, средней тяжести, тяжкие и особо тяжкие."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Вина в уголовном праве – это:",
    "vars": [
      "+ : субъективная предпосылка уголовной ответственности;",
      "- : объективная предпосылка уголовной ответственности;",
      "- : как субъективная, так и объективная предпосылка уголовной ответственности;",
      "- : правильный ответ отсутствует."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "В уголовном праве вина предусмотрена в форме:",
    "vars": [
      "-\t: умысла;",
      "-\t: неосторожности;",
      "+ : как умысла, так и неосторожности;",
      "-\t:  правильный ответ отсутствует."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Уголовный кодекс предусматривает уголовную ответственность за виновное деяние в форме:",
    "vars": [
      "-\t: прямого умысла;",
      "-\t: косвенного умысла;",
      "-\t: преступной небрежности;",
      "+ : все ответы верны;"
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "По российскому уголовному праву субъектом преступления признается:",
    "vars": [
      "+  : вменяемое лицо, достигшее к моменту совершения преступления возраста, указанного в уголовном законе;",
      "- : недееспособное лицо, достигшее к моменту совершения преступления",
      "- : лицо, достигшее к моменту совершения преступления возраста, указанного в уголовном законе;",
      "- : правильный ответ отсутствует."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Какой из следующих признаков является обязательным признаком субъективной стороны состава преступления:",
    "vars": [
      "+ : вина;",
      "- : мотив;",
      "- : цель;",
      "- : субъект."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "По общему правилу уголовная ответственность в РФ наступает с:",
    "vars": [
      "- : 14 лет;",
      "+ : 16 лет;",
      "- : 18 лет;",
      "- : 21 года."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Среди предусмотренных Уголовным кодексом РФ признаков преступления отсутствует:",
    "vars": [
      "- : общественная опасность;",
      "+ : цель причинения вреда;",
      "- : наказуемость;",
      "- : виновность."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Уголовным кодексом РФ предусмотрены наказания:",
    "vars": [
      "+: основные и дополнительные;",
      "- : тяжкие и особо тяжкие;",
      "- : не большой тяжести и средней тяжести;",
      "- : средней тяжести и тяжкие."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Какое из следующих обстоятельств не относится к числу обстоятельств, необходимых для  признания лица действовавшим в состоянии необходимой обороны:",
    "vars": [
      "- : действительность посягательства;",
      "- : причиненный вред должен быть меньшим, чем вред предотвращенный;",
      "+ : отсутствие возможности обратиться за помощью к другим лицам или органам власти;",
      "- : наличие посягательства или реальной угрозы посягательства."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Какое из следующих наказаний не может применяться к несовершеннолетним:",
    "vars": [
      "- : арест;",
      "- : лишение права заниматься определенной деятельностью;",
      "+ :пожизненное лишение свободы;",
      "- : обязательные работы."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Какая из следующих мер не может назначаться несовершеннолетнему в качестве принудительной меры воспитательного воздействия:",
    "vars": [
      "- : предупреждение;",
      "- : передача под надзор родителей или лиц, их заменяющих, либо специализированного государственного органа;",
      "+ : возложение обязанности завершить общеобразовательную или профессиональную подготовку;",
      "- : возложение обязанности загладить причиненный вред."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Окончательное наказание по совокупности приговоров в виде лишения свободы в соответствии с Уголовным кодексом РФ не может превышать:",
    "vars": [
      "- : 20 лет;",
      "- : 25 лет;",
      "+ : 30 лет;",
      "- : 35 лет."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Официальное определение наказания дано:",
    "vars": [
      "- : в Конституции РФ;",
      "+ : в Уголовном кодексе РФ;",
      "-\t: в Указе президента;",
      "-\t: в Постановлении правительства РФ."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Уголовное наказание возможно:",
    "vars": [
      "+ : лишь по приговору суда;",
      "-\t: по решению органа государственной власти;",
      "-\t: по решению или определению суда;",
      "-\t: правильный ответ отсутствует."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Система наказаний – это:",
    "vars": [
      "+  : установленный в уголовном законе перечень наказаний, которые может назначить суд за совершение отдельных преступлений;",
      "-\t:  установленный Постановлением пленума Верховного суда РФ перечень наказаний, которые может назначить суд за совершение отдельных преступлений;",
      "-\t: установленный Постановлением правительства перечень наказаний, которые может назначить суд за совершение отдельных преступлений;",
      "-\t: правильный ответ отсутствует."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Разглашение государственной тайны при отсутствии признаков государственной измены является:",
    "vars": [
      "+  : преступлением;",
      "-\t: административным проступком;",
      "-\t: в зависимости от степени тяжести последствий является преступлением или административным проступком;",
      "-\t: правильный ответ отсутствует."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "К уголовным видам правонарушение относится:",
    "vars": [
      "- : проступки;",
      "+: преступления;",
      "- : проступки и преступления;",
      "-: нет правильного ответа."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Нормы уголовного права применяются, если:",
    "vars": [
      "- : гражданин нарушил правила дорожного движения;",
      "+ : совершен захват заложников;",
      "- : гражданин не оплатил проезд в транспор¬те.",
      "-: нет правильного ответа."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "К какому виду юридической ответственности относится наказание в виде лишения свободы?",
    "vars": [
      "- : административной;",
      "+ : уголовной;",
      "- : дисциплинарной.",
      "-: нет правильного ответа"
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Уголовное законодательство в соответствии с Конституцией РФ относится к:",
    "vars": [
      "- : исключительному ведению Российской Федерации;",
      "+ : совместному ведению Российской Федерации и субъектов федерации РФ;",
      "-  : ведению субъектов федерации.",
      "-: нет правильного ответа"
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Основанием наступления юридической ответственности являются:",
    "vars": [
      "+: наличие состава правонарушения;",
      "-: мотив;",
      "-: вина;",
      "-: цель."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Элементами состава преступления является:",
    "vars": [
      "+: объективная сторона, субъективная сторона;",
      "-: умысел;",
      "-: неосторожность;",
      "-: наказуемость."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "В зависимости от характера общественной опасности все преступления делятся на:",
    "vars": [
      "-: 2 категории;",
      "-: 3 категории;",
      "+: 4 категории;",
      "-: 5 категории."
    ]
  },
  {
    "type": "single",
    "theme": "k=b",
    "task": "",
    "question": "В соответствии с ч.2 ст.9 Конституции Российской Федерации земля и другие природные ресурсы могут находиться в:",
    "vars": [
      "-: государственной и муниципальной формах собственности;",
      "-: собственности субъектов РФ, муниципальной, частной и иных формах собственности;",
      "-: формах собственности, установленных федеральными законами;",
      "+: частной, государственной, муниципальной и иных формах собственности."
    ]
  },
  {
    "type": "single",
    "theme": "k=b",
    "task": "",
    "question": "Нормативы допустимых выбросов и сбросов веществ и микроорганизмов устанавливаются исходя из ...:",
    "vars": [
      "-: допустимой антропогенной нагрузки на окружающую среду;",
      "+: нормативов качества окружающей среды;",
      "-: нормативов образования отходов производства и потребления;",
      "-: технологических нормативов."
    ]
  },
  {
    "type": "single",
    "theme": "k=b",
    "task": "",
    "question": "Экологическое право в Российской Федерации является:",
    "vars": [
      "+ :самостоятельной отраслью права;",
      "- : подотраслью права;",
      "- : правовым институтом;",
      "- : правильный ответ отсутствует."
    ]
  },
  {
    "type": "single",
    "theme": "k=b",
    "task": "",
    "question": "Метод государственного управления, при котором на субъект возлагается обязанность воздержаться от определенных действий, является методом…:",
    "vars": [
      "+: запрещения;",
      "-: рекомендаций;",
      "-: санкционирования;",
      "-: обязывания."
    ]
  },
  {
    "type": "single",
    "theme": "k=b",
    "task": "",
    "question": "Метод государственного управления, при котором на субъект возлагается обязанность совершить определенные действия, является методом…:",
    "vars": [
      "-: запрещения;",
      "-: рекомендаций;",
      "-: согласования;",
      "+: обязывания."
    ]
  },
  {
    "type": "single",
    "theme": "k=b",
    "task": "",
    "question": "Метод государственного управления, который основан на финансовом стимулировании деятельности по рациональному использованию природных ресурсов, является методом…:",
    "vars": [
      "-: запрещения;",
      "-: согласования;",
      "-: административным;",
      "+: экономическим;"
    ]
  },
  {
    "type": "single",
    "theme": "k=b",
    "task": "",
    "question": "Общественные отношения, урегулированные нормами права в сфере охраны окружающей среды, природопользования и в области защиты экологических прав физических и юридических лиц, являются ………экологического права:",
    "vars": [
      "-: источником;",
      "-: принципом;",
      "+: предметом;",
      "-: методом."
    ]
  },
  {
    "type": "single",
    "theme": "k=b",
    "task": "",
    "question": "Экологическое право как __________представляет собой организованное знание о системе эколого-правовых отношений, формах и методах формирования эколого-правового сознания:",
    "vars": [
      "+: наука;",
      "-: практика;",
      "-:источник;",
      "-: правонарушение."
    ]
  },
  {
    "type": "single",
    "theme": "k=b",
    "task": "",
    "question": "Равенство сторон и возможность выбора ими самостоятельного поведения является сущностью _______________ метода экологического права:",
    "vars": [
      "+: диспозитивного;",
      "-: правонарушающего;",
      "-: правоисполнительного;",
      "-: запретительного."
    ]
  },
  {
    "type": "single",
    "theme": "k=b",
    "task": "",
    "question": "Право каждого, проживающего на территории России, на правдивую информацию о состоянии окружающей среды является принципом:",
    "vars": [
      "+: гласности;",
      "-: интернационализма;",
      "-: международного сотрудничества;",
      "-: народовластия."
    ]
  },
  {
    "type": "single",
    "theme": "k=b",
    "task": "",
    "question": "Последовательность расположения эколого-правовых институтов и норм в зависимости от их значимости, роли и содержания называется _____________ экологического права:",
    "vars": [
      "+: системой;",
      "-: правонарушением;",
      "-: запретом;",
      "-: обязанностью;"
    ]
  },
  {
    "type": "single",
    "theme": "k=b",
    "task": "",
    "question": "Комплексная система наблюдения за состоянием окружающей среды, оценки и прогноза изменений состояния окружающей среды под воздействием природных и антропогенных факторов называется ________окружающей среды:",
    "vars": [
      "+: государственным мониторингом;",
      "-: нормативом качества;",
      "-: лицензированием природопользования;",
      "-: лимитированием природопользования."
    ]
  },
  {
    "type": "single",
    "theme": "k=a",
    "task": "",
    "question": "Вопросы владения, пользования и распоряжения землей, недрами, водными и другими природными ресурсами, согласно ч. 1 ст. 72 Конституции РФ, находятся ...:",
    "vars": [
      "-: в ведении субъектов Российской Федерации;",
      "-: в ведении органов местного самоуправления;",
      "-: в ведении международных организация по охране окружающей среды;",
      "+: совместном ведении Российской Федерации и субъектов Российской Федерации."
    ]
  },
  {
    "type": "single",
    "theme": "k=b",
    "task": "",
    "question": "Правовое регулирование природопользования, согласно ч. 1 ст. 72 Конституции РФ, находится ...:",
    "vars": [
      "-: в ведении субъектов Российской Федерации;",
      "-: в ведении органов местного самоуправления;",
      "-: в ведении международных организация по охране окружающей среды;",
      "+: совместном ведении Российской Федерации и субъектов Российской Федерации."
    ]
  },
  {
    "type": "single",
    "theme": "k=b",
    "task": "",
    "question": "Охрана окружающей среды и обеспечение экологической безопасности, согласно ч. 1 ст. 72 Конституции РФ, находятся ...:",
    "vars": [
      "-: в ведении субъектов Российской Федерации;",
      "-: в ведении органов местного самоуправления;",
      "-: в ведении международных организация по охране окружающей среды;",
      "+: совместном ведении Российской Федерации и субъектов Российской Федерации."
    ]
  },
  {
    "type": "single",
    "theme": "k=b",
    "task": "",
    "question": "Особо охраняемые природные территории, а так же охрана памятников истории и культуры, согласно ч. 1 ст. 72 Конституции РФ, находятся ...:",
    "vars": [
      "-: в ведении субъектов Российской Федерации;",
      "-: в ведении органов местного самоуправления;",
      "-: в ведении международных организация по охране окружающей среды;",
      "+: совместном ведении Российской Федерации и субъектов Российской Федерации."
    ]
  },
  {
    "type": "single",
    "theme": "k=b",
    "task": "",
    "question": "К органам общей компетенции в области охраны окружающей среды относят __________ Российской Федерации:",
    "vars": [
      "-: Министерство транспорта;",
      "-: Министерство обороны;",
      "-: Федеральную службу безопасности;",
      "+: Федеральное собрание (Государственную Думу и Совет Федерации)."
    ]
  },
  {
    "type": "single",
    "theme": "k=b",
    "task": "",
    "question": "К органам общей компетенции в области охраны окружающей среды относят __________ Российской Федерации:",
    "vars": [
      "-: Министерство транспорта;",
      "-: Министерство обороны;",
      "-: Федеральную службу безопасности;",
      "+: Президент."
    ]
  },
  {
    "type": "single",
    "theme": "k=b",
    "task": "",
    "question": "К органам общей компетенции в области охраны окружающей среды относят __________ Российской Федерации:",
    "vars": [
      "-: Министерство транспорта;",
      "-: Министерство обороны;",
      "-: Федеральную службу безопасности;",
      "+: Правительство."
    ]
  },
  {
    "type": "single",
    "theme": "k=b",
    "task": "",
    "question": "К органам специальной компетенции в области охраны окружающей среды относят __________ Российской Федерации:",
    "vars": [
      "-: Министерство транспорта;",
      "-: Министерство обороны;",
      "-: Федеральную службу безопасности;",
      "+: Министерство природных ресурсов и экологии."
    ]
  },
  {
    "type": "single",
    "theme": "k=b",
    "task": "",
    "question": "К объектам международного экологического права вне пределов национальной юрисдикции относят …:",
    "vars": [
      "+: Мировой океан;",
      "-: леса;",
      "-: озера;",
      "-: участки земли."
    ]
  },
  {
    "type": "single",
    "theme": "k=b",
    "task": "",
    "question": "Постоянные объединения межправительственного характера, созданные в целях содействия решению межгосударственных проблем, называются…:",
    "vars": [
      "+: международными организациями;",
      "-: международными правительствами;",
      "-: международными министерствами;",
      "-: межународными договорами;"
    ]
  },
  {
    "type": "single",
    "theme": "k=b",
    "task": "",
    "question": "Правовые принципы и нормы, регулирующие международные отношения по поводу охраны окружающей среды, являются предметом международного ________права:",
    "vars": [
      "+: экологического;",
      "-: экономического;",
      "-: космического;",
      "-: морского."
    ]
  },
  {
    "type": "single",
    "theme": "k=b",
    "task": "",
    "question": "Основными нормативными актами Российской Федерации, регулирующими охрану земель, является …:",
    "vars": [
      "+: Земельный кодекс РФ и Федеральный закон «Об охране окружающей среды»;",
      "-: Водный кодекс РФ и Федеральный закон «Об охране окружающей среды»;",
      "-: Лесной кодекс РФ и Федеральный закон «Об охране окружающей среды»;",
      "- : Уголовный кодекс РФ  и Федеральный закон «Об охране окружающей среды»."
    ]
  },
  {
    "type": "single",
    "theme": "k=b",
    "task": "",
    "question": "Основными нормативными актами Российской Федерации, регулирующими охрану лесов, является …:",
    "vars": [
      "-: Земельный кодекс РФ и Федеральный закон «Об охране окружающей среды»;",
      "-: Водный кодекс РФ и Федеральный закон «Об охране окружающей среды»;",
      "+: Лесной кодекс РФ и Федеральный закон «Об охране окружающей среды»;",
      "- : Уголовный кодекс РФ и Федеральный закон «Об охране окружающей среды»."
    ]
  },
  {
    "type": "single",
    "theme": "k=b",
    "task": "",
    "question": "Основными нормативными актами Российской Федерации, регулирующими охрану вод, являются …:",
    "vars": [
      "-: Земельный кодекс РФ и Федеральный закон «Об охране окружающей среды»;",
      "+: Водный кодекс РФ и Федеральный закон «Об охране окружающей среды»;",
      "-: Лесной кодекс РФ и Федеральный закон «Об охране окружающей среды»;",
      "- : Уголовный кодекс РФ и Федеральный закон «Об охране окружающей среды»."
    ]
  },
  {
    "type": "single",
    "theme": "k=b",
    "task": "",
    "question": "Основными нормативными актами Российской Федерации, регулирующими охрану недр, являются …:",
    "vars": [
      "-: Земельный кодекс РФ и Федеральный закон «Об охране окружающей среды»;",
      "-: Водный кодекс РФ и Федеральный закон «Об охране окружающей среды»;",
      "-: Лесной кодекс РФ и Федеральный закон «Об охране окружающей среды»;",
      "+ : Закон РФ «О недрах» и Федеральный закон «Об охране окружающей среды»."
    ]
  },
  {
    "type": "single",
    "theme": "k=b",
    "task": "",
    "question": "Наиболее авторитетной из международных организаций по охране окружающей среды является…:",
    "vars": [
      "+: ООН (Организация объединенных наций);",
      "-: ВТО (Всемирная торговая организация);",
      "-: ФАИ (Международная авиационная федерация);",
      "-: МОТ (Международная организация труда)."
    ]
  },
  {
    "type": "many",
    "theme": "k=b",
    "task": "",
    "question": "Объектами международно-правовой охраны окружающей среды не являются…:",
    "vars": [
      "+: озоновый слой;",
      "+: Мировой океан;",
      "+: Антарктида;",
      "-: озёра."
    ]
  }
]